export const readFilterCriterionYAML = `Синоним: Синоним
Комментарий: Комментарий
Тип: Строка(10)
ИспользоватьСтандартныеКоманды: Ложь
Состав:
  - Справочник.СправочникПолный.Реквизит.СтроковыйРеквизитСИндексом
  - Справочник.СправочникПолный.ТабличнаяЧасть.ТабличнаяЧасть.Реквизит.РеквизитТабличнойЧасти
  - Документ.ДокументВсеСвойства.Реквизит.СтроковыйРеквизит
ОсновнаяФорма: FilterCriterion.КритерийОтбораВсеСвойства.Form.ФормаСписка
ПредставлениеСписка: Представление списка
РасширенноеПредставлениеСписка: Расширенное представление списка
Пояснение: |
  Пояснение
Команды:
  Команда1:
    Группа: КоманднаяПанельФормыСоздатьНаОсновании
    ТипПараметраКоманды: Справочник.СправочникПолный`
