#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет является ли контрагент иностранной организацией
//
// Параметры:
//  Контрагент- СправочникСсылка.Контрагенты - ссылка на контрагента для определения страны регистрации
// 
// Возвращаемое значение:
// Булево - Истина - признак того что контрагент иностаранная организация
//
Функция ЭтоИностраннаяОрганизация(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;

	ИменаРеквизитовКонтрагента = "ИНН, ВидКонтрагента, СтранаРегистрации";
	РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, ИменаРеквизитовКонтрагента);
	
	Возврат РеквизитыКонтрагента.СтранаРегистрации <> Справочники.СтраныМира.Россия
		И РеквизитыКонтрагента.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо
		И НЕ ЗначениеЗаполнено(РеквизитыКонтрагента.ИНН);

КонецФункции

// Функция получает основной вид цен продажи из пользовательский настроек.
//
Функция ПолучитьОсновнойВидЦенПродажи() Экспорт
	
	ВидЦенПродажи = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойВидЦенПродажи");
	
	Возврат ?(ЗначениеЗаполнено(ВидЦенПродажи), ВидЦенПродажи, Справочники.ВидыЦен.Оптовая);
	
КонецФункции// ЗаполнитьВидЦен()

// Функция получает вид цен продажи по умолчанию для указанного контрагента.
//
// Принцип получения цены:
//	1. Контрагент -> Основной договор -> Вид цен;
//	2. Настройки пользователя -> Основной вид цен продажи;
//	3. Предопределенный вид цен: Оптовая цена;
//	
Функция ПолучитьВидЦенПоУмолчанию(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
		
		Если ЗначениеЗаполнено(ДоговорПоУмолчанию)
		И ЗначениеЗаполнено(ДоговорПоУмолчанию.ВидЦен) Тогда
		
			Возврат ДоговорПоУмолчанию.ВидЦен;
		Иначе
			Возврат ПолучитьОсновнойВидЦенПродажи();
		КонецЕсли;
		
	Иначе
		
		Возврат ПолучитьОсновнойВидЦенПродажи();
		
	КонецЕсли;
	
КонецФункции

// Функция получает организацию для указанного контрагента.
//
// Принцип получения организации:
//	1. Контрагент -> Основной договор -> Организация; (если вкл. синхронизация данных)
//	2. Настройки пользователя -> Основная организация;
//	3. Предопределенный элемент: Основная организация;
//
Функция ПолучитьОрганизациюПоУмолчанию(Контрагент)
	
	// ВНИМАНИЕ! Не путать с "Константы.УчетПоКомпании.Компания"
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
		Если ЗначениеЗаполнено(ДоговорПоУмолчанию)
		И ЗначениеЗаполнено(ДоговорПоУмолчанию.Организация) Тогда
		
			Возврат ДоговорПоУмолчанию.Организация;
		Иначе
		
			ОсновнаяОрганизация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
			
			Возврат ?(ЗначениеЗаполнено(ОсновнаяОрганизация), ОсновнаяОрганизация, Справочники.Организации.ОрганизацияПоУмолчанию());
		КонецЕсли;
	Иначе
		
		ОсновнаяОрганизация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
		
		Возврат ?(ЗначениеЗаполнено(ОсновнаяОрганизация), ОсновнаяОрганизация, Справочники.Организации.ОрганизацияПоУмолчанию());
		
	КонецЕсли;

	
КонецФункции //ПолучитьОрганизациюПоУмолчанию()

// Получает первый телефон контрагента.
//
Функция ПолучитьТелефонКонтрагента(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат "";
	КонецЕсли;
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	
	Для каждого СтрокаКИ Из КонтрагентОбъект.КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Не ПустаяСтрока(СтрокаКИ.Представление) Тогда
			Возврат(СтрокаКИ.Представление);
		КонецЕсли;
	КонецЦикла;
	Возврат "";
	
КонецФункции

// Возвращает данные о связанных контактах
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагент
//  ДополнительныйВыбор - Неопределено, Структура - позволяет выбирать дополнительные данные контактов:
//   * Наименование - Произвольный
//   * КонтактнаяИнформация - Произвольный
// 
// Возвращаемое значение:
//  * Массив из СправочникСсылка.Контрагенты - если ДополнительныйВыбор = Неопределено
//  * ТаблицаЗначений:
//     ** Ссылка - СправочникСсылка.Контрагенты
//     ** Наименование - Строка - возвращается, если передано в дополнительном выборе
//     ** КонтактнаяИнформация - ТаблицаЗначений - возвращается, если передано в дополнительном выборе:
//         *** НомерСтроки - Число
//         *** Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации
//         *** Вид - СправочникСсылка.ВидыКонтактнойИнформации
//         *** Представление - Строка
//         *** ЗначенияПолей - Строка
//         *** Страна - Строка
//         *** Регион - Строка
//         *** Город - Строка
//         *** АдресЭП - Строка
//         *** ДоменноеИмяСервера - Строка
//         *** НомерТелефона - Строка
//         *** НомерТелефонаБезКодов - Строка
//         *** Значение - Строка
//
Функция СвязанныеКонтакты(Контрагент, ДополнительныйВыбор = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ДополнительныйВыбор = Неопределено Тогда
		ДополнительныйВыбор = Новый Структура;
	КонецЕсли;
	
	ТекстЗапроса = 

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Ссылка КАК Ссылка,
		|	КонтактныеЛица.Наименование КАК Наименование,
		|	КонтактныеЛица.КонтактнаяИнформация.(
		|		НомерСтроки КАК НомерСтроки,
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей,
		|		Страна КАК Страна,
		|		Регион КАК Регион,
		|		Город КАК Город,
		|		АдресЭП КАК АдресЭП,
		|		ДоменноеИмяСервера КАК ДоменноеИмяСервера,
		|		НомерТелефона КАК НомерТелефона,
		|		НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
		|		Значение КАК Значение
		|	) КАК КонтактнаяИнформация
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Контрагент = &Контрагент) КАК СвязиКонтрагентКонтактСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
		|		ПО (КонтактныеЛица.Ссылка = СвязиКонтрагентКонтактСрезПоследних.Контакт)
		|ГДЕ
		|	КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
		|	И СвязиКонтрагентКонтактСрезПоследних.СвязьНедействительна = ЛОЖЬ
		|	И КонтактныеЛица.Недействителен = ЛОЖЬ";
	
	Если Не ДополнительныйВыбор.Свойство("Наименование") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		",
		|	КонтактныеЛица.Наименование КАК Наименование", "");
	КонецЕсли;
	
	Если Не ДополнительныйВыбор.Свойство("КонтактнаяИнформация") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		",
		|	КонтактныеЛица.КонтактнаяИнформация.(
		|		НомерСтроки КАК НомерСтроки,
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей,
		|		Страна КАК Страна,
		|		Регион КАК Регион,
		|		Город КАК Город,
		|		АдресЭП КАК АдресЭП,
		|		ДоменноеИмяСервера КАК ДоменноеИмяСервера,
		|		НомерТелефона КАК НомерТелефона,
		|		НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
		|		Значение КАК Значение
		|	) КАК КонтактнаяИнформация", "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ДополнительныйВыбор.Количество() Тогда
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Контакты = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Контакты.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Контакты;
	
КонецФункции

// Определяет установлена ли связь между контрагентом и контактом.
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагент
//  Контакт		 - СправочникСсылка.КонтактноеЛицо
// 
// Возвращаемое значение:
//   - Булево
//
Функция КонтрагентСвязанСКонтактом(Контрагент, Контакт) Экспорт
	
	Возврат СвязанныеКонтакты(Контрагент).Найти(Контакт) <> Неопределено;
	
КонецФункции

// Добавляет новую связь контрагента и контакта.
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагенты
//  Контакт		 - СправочникСсылка.КонтактныеЛица
//
Процедура ДобавитьСвязьСКонтактом(Контрагент, Контакт) Экспорт
	
	Если КонтрагентСвязанСКонтактом(Контрагент, Контакт) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СвязиКонтрагентКонтакт.НоваяСвязь(Контрагент, Контакт);
	
КонецПроцедуры

// Создает контрагента по переданной структуре
//
// Параметры:
//  - ДанныеЗаполнения - Структура - структура свойств контрагента
//
// Возвращаемое значение:
//  - Ссылка - ссылка на созданный элемент справочника
//
Функция СоздатьКонтрагента(ДанныеЗаполнения) Экспорт
	
	СуществующийКонтрагент = НайтиПоРеквизиту("ИНН", ДанныеЗаполнения.ИНН);
	
	Если СуществующийКонтрагент.Пустая() Тогда
		Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		Контрагент = СуществующийКонтрагент.ПолучитьОбъект();
		Контрагент.Заблокировать();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Контрагент, ДанныеЗаполнения);
	
	Контрагент.Заполнить(ДанныеЗаполнения);
	
	
	Контрагент.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	Контрагент.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
	Контрагент.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
	Контрагент.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
	Контрагент.ВестиРасчетыПоДоговорам = Истина;
	Контрагент.ВестиРасчетыПоДокументам = Истина;
	Контрагент.ВестиРасчетыПоЗаказам = Истина;
	Контрагент.ВестиУчетОплатыПоСчетам = Истина;
	
	Если Константы.ОграничиватьДоступНаУровнеЗаписей.Получить() Тогда
		Контрагент.ГруппаДоступа = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяГруппаДоступаКонтрагентов");
	КонецЕсли;
	
	Контрагент.ВестиУчетОплатыПоСчетам = Истина;
	
	Если Контрагент.ЭтоНовый() Тогда
		Контрагент.Записать();
	КонецЕсли;
	
	КонтрагентСсылка = Контрагент.Ссылка;
	
	// Банковский счет
	Если ДанныеЗаполнения.Свойство("НомерСчета") 
		И ДанныеЗаполнения.Свойство("БИК") 
		И ЗначениеЗаполнено(ДанныеЗаполнения.НомерСчета)
		И ЗначениеЗаполнено(ДанныеЗаполнения.БИК) Тогда
		Контрагент.БанковскийСчетПоУмолчанию = Справочники.БанковскиеСчета.ПолучитьЭлемент(
			КонтрагентСсылка, ДанныеЗаполнения.НомерСчета, ДанныеЗаполнения.БИК);
	КонецЕсли;
	
	// Руководитель
	Если ДанныеЗаполнения.Свойство("Руководитель") 
		И ДанныеЗаполнения.Свойство("ДолжностьРуководителя")
		И ЗначениеЗаполнено(ДанныеЗаполнения.Руководитель)
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДолжностьРуководителя) Тогда
		Контрагент.КонтактноеЛицоПодписант = Справочники.КонтактныеЛица.ПолучитьЭлемент(КонтрагентСсылка, ДанныеЗаполнения.Руководитель);
	КонецЕсли;
	
	Контрагент.Записать();
	Контрагент = Неопределено;
	
	Возврат КонтрагентСсылка;
	
КонецФункции

Функция ПолучателиЭлектронногоПисьма(Контрагент, ВидКонтактнойИнформации = Неопределено) Экспорт
	
	ПолучателиЭлектронногоПисьма = Новый ТаблицаЗначений;
	ПолучателиЭлектронногоПисьма.Колонки.Добавить("Контакт", Метаданные.ОпределяемыеТипы.КонтактСобытия.Тип);
	ПолучателиЭлектронногоПисьма.Колонки.Добавить("КакСвязаться", Новый ОписаниеТипов("Строка"));
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, 
		ВидКонтактнойИнформации, ТекущаяДатаСеанса(), Ложь);
	
	Если ВидКонтактнойИнформации = Неопределено Тогда
		ОтборКонтактнойИнформации = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта.НайтиСтроки(ОтборКонтактнойИнформации);
	Иначе
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта;
	КонецЕсли;
	
	Если СтрокиКонтактнойИнформации.Количество() <> 0 Тогда
		Для каждого Строка Из СтрокиКонтактнойИнформации Цикл
			НовыйПолучатель = ПолучателиЭлектронногоПисьма.Добавить();
			НовыйПолучатель.Контакт = Контрагент;
			НовыйПолучатель.КакСвязаться = Строка.Представление;
		КонецЦикла;
	Иначе
		ОсновнойКонтакт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "КонтактноеЛицо");
		Если ЗначениеЗаполнено(ОсновнойКонтакт) Тогда
			ПолучателиЭлектронногоПисьма = Справочники.КонтактныеЛица.ПолучателиЭлектронногоПисьма(ОсновнойКонтакт);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПолучателиЭлектронногоПисьма;
	
КонецФункции

Функция ПолучателиСообщенияSMS(Контрагент, ВидКонтактнойИнформации = Неопределено) Экспорт
	
	ПолучателиСообщенияSMS = Новый ТаблицаЗначений;
	ПолучателиСообщенияSMS.Колонки.Добавить("Контакт", Метаданные.ОпределяемыеТипы.КонтактСобытия.Тип);
	ПолучателиСообщенияSMS.Колонки.Добавить("КакСвязаться", Новый ОписаниеТипов("Строка"));
	
	КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, 
		ВидКонтактнойИнформации, ТекущаяДатаСеанса(), Ложь);
	
	Если ВидКонтактнойИнформации = Неопределено Тогда
		ОтборКонтактнойИнформации = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта.НайтиСтроки(ОтборКонтактнойИнформации);
	Иначе
		СтрокиКонтактнойИнформации = КонтактнаяИнформацияОбъекта;
	КонецЕсли;
	
	Если СтрокиКонтактнойИнформации.Количество() <> 0 Тогда
		Для каждого Строка Из СтрокиКонтактнойИнформации Цикл
			НовыйПолучатель = ПолучателиСообщенияSMS.Добавить();
			НовыйПолучатель.Контакт = Контрагент;
			НовыйПолучатель.КакСвязаться = Строка.Представление;
		КонецЦикла;
	Иначе
		ОсновнойКонтакт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "КонтактноеЛицо");
		Если ЗначениеЗаполнено(ОсновнойКонтакт) Тогда
			ПолучателиСообщенияSMS = Справочники.КонтактныеЛица.ПолучателиСообщенияSMS(ОсновнойКонтакт);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПолучателиСообщенияSMS;
	
КонецФункции

// Стандартные реквизиты для выбора полей при переводе лида в контрагента
//
// Возвращаемое значение:
//  - Соответствие - список реквизитов, Ключ - Имя реквизита, Значение - представление реквизита
//
Функция СтандартныеРеквизитыДляПереводаВПокупателя() Экспорт
	
	Реквизиты = Новый Соответствие;
	Реквизиты.Вставить("Наименование", НСтр("ru = 'Представление в программе'"));
	Реквизиты.Вставить("Комментарий",  НСтр("ru = 'Дополнительная информация'"));
	Реквизиты.Вставить("НаименованиеПолное", НСтр("ru = 'Юридическое название'"));
	Реквизиты.Вставить("ИсточникПривлеченияПокупателя", НСтр("ru = 'Источник'"));
	Реквизиты.Вставить("ФИО", НСтр("ru = 'ФИО физ лица'"));
	Реквизиты.Вставить("ИНН", НСтр("ru = 'ИНН'"));
	Реквизиты.Вставить("КПП", НСтр("ru = 'КПП'"));
	Реквизиты.Вставить("КодПоОКПО", НСтр("ru = 'ОКПО'"));
	Реквизиты.Вставить("РегистрационныйНомер", НСтр("ru = 'ОГРН'"));
	Реквизиты.Вставить("ВидГосударственногоОргана", НСтр("ru = 'Вид государственного органа'"));
	Реквизиты.Вставить("КодГосударственногоОргана", НСтр("ru = 'Код государственного органа'"));
	Реквизиты.Вставить("СвидетельствоСерияНомер", НСтр("ru = 'Серия и номер свидетельства'"));
	Реквизиты.Вставить("СвидетельствоДатаВыдачи", НСтр("ru = 'Дата выдачи свидетельства'"));
	Реквизиты.Вставить("ДокументУдостоверяющийЛичность", НСтр("ru = 'Документ удостоверяющий личность'"));
	Реквизиты.Вставить("ДатаРождения", НСтр("ru = 'Дата рождения'"));
	
	Возврат Реквизиты;
	
КонецФункции

// Список подразделений головного контрагента для отображения
//
// Параметры:
//  - ТекущийГоловной - СправочникСсылка.Контрагенты - головной контрагент
//  - ТекущийКонтрагент - СправочникСсылка.Контрагенты - текущий контрагент
//
// Возвращаемое значение:
//  - СписокЗначений - список подразделений, Значение - Контрагент, Представление - представление контрагента
//
Функция СписокПодразделенийГоловногоКонтрагента(ТекущийГоловной, ТекущийКонтрагент = Неопределено) Экспорт
		
	Если НЕ ЗначениеЗаполнено(ТекущийГоловной) Тогда
		ТекущийГоловной = ТекущийКонтрагент;
	КонецЕсли;
	
	СписокЗначений = Новый СписокЗначений;
	
	ПодразделенияКонтрагента = РегистрыСведений.СвязиГоловнойКонтрагентПодразделение.ПодразделенияКонтрагента(ТекущийГоловной);
	Для Каждого Подразделение Из ПодразделенияКонтрагента Цикл
		
		Если ПодразделенияКонтрагента.Индекс(Подразделение) = ПодразделенияКонтрагента.Количество() - 1 Тогда
			Картинка = БиблиотекаКартинок.ИерархияГоловнойКонечноеПодразделение;
		Иначе
			Картинка = БиблиотекаКартинок.ИерархияГоловнойПодразделение;
		КонецЕсли;
		
		СписокЗначений.Добавить(Подразделение.Подразделение, 
			Строка(Подразделение.Подразделение),
			ТекущийКонтрагент = Подразделение.Подразделение,
			Картинка);
		
	КонецЦикла;
	
	СписокЗначений.Вставить(0, 
		ТекущийГоловной, 
		СтрШаблон(НСтр("ru = '%1 (головной)'"),Строка(ТекущийГоловной)),
		ТекущийКонтрагент = ТекущийГоловной,
		БиблиотекаКартинок.ИерархияГоловнойКонтрагент);
		
	Возврат СписокЗначений;
	
КонецФункции

#Область ИсторияРеквизитов

// КПП на дату
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагенты	 - Контрагент, для которого нужно получить КПП
//  ДатаСведений - 	Дата - дата, на которую нужно получить значение КПП
// 
// Возвращаемое значение:
//   Строка - значение КПП на дату
//
Функция КППНаДату(Контрагент, ДатаСведений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСведений) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "КПП");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Контрагент", Контрагент);
	Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияКППКонтрагентов.Период) КАК Период,
	|	ИсторияКППКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗначенияКПП
	|ИЗ
	|	Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|ГДЕ
	|	ИсторияКППКонтрагентов.Ссылка = &Контрагент
	|	И ИсторияКППКонтрагентов.Период <= &ДатаСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияКППКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияКППКонтрагентов.КПП КАК КПП
	|ИЗ
	|	ЗначенияКПП КАК ЗначенияКПП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|		ПО ЗначенияКПП.Ссылка = ИсторияКППКонтрагентов.Ссылка
	|			И ЗначенияКПП.Период = ИсторияКППКонтрагентов.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КПП;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "КПП");
	КонецЕсли;
	
КонецФункции

// Наименование на дату
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагенты	 - Контрагент, для которого нужно получить наименование
//  ДатаСведений - Дата - дата, на которую нужно получить значение наименования
// 
// Возвращаемое значение:
//   Строка - значение наименования на дату
//
Функция ПолноеНаименованиеНаДату(Контрагент, ДатаСведений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСведений) Тогда
		Запрос = Новый Запрос();
		Запрос.Параметры.Вставить("Контрагент", Контрагент);
		Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ИсторияНаименованийКонтрагентов.Период) КАК Период,
		|	ИсторияНаименованийКонтрагентов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЗначенияНаименований
		|ИЗ
		|	Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийКонтрагентов
		|ГДЕ
		|	ИсторияНаименованийКонтрагентов.Ссылка = &Контрагент
		|	И ИсторияНаименованийКонтрагентов.Период <= &ДатаСведений
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияНаименованийКонтрагентов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияНаименованийКонтрагентов.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	ЗначенияНаименований КАК ЗначенияНаименований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийКонтрагентов
		|		ПО ЗначенияНаименований.Ссылка = ИсторияНаименованийКонтрагентов.Ссылка
		|			И ЗначенияНаименований.Период = ИсторияНаименованийКонтрагентов.Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.НаименованиеПолное;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "НаименованиеПолное");
	
КонецФункции

// Процедура устанавливает актуальное значение истории КПП
//
// Параметры:
//  КПП			 - Строка	 - текущее значение КПП
//  ИсторияКПП	 - 	ТаблицаЗначений - таблица с историей КПП
//
Процедура УстановитьАктуальноеЗначениеИсторииКПП(КПП, ИсторияКПП) Экспорт
	
	КоличествоЗаписей = ИсторияКПП.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияКПП.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияКПП[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.КПП = КПП;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает актуальное значение истории наименований
//
// Параметры:
//  НаименованиеПолное	 - Строка	 - текущее значение наименования
//  ИсторияНаименований	 - ТаблицаЗначений	 - таблица с историей наименований
//
Процедура УстановитьАктуальноеЗначениеИсторииНаименований(НаименованиеПолное, ИсторияНаименований) Экспорт
	
	КоличествоЗаписей = ИсторияНаименований.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияНаименований.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияНаименований[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.НаименованиеПолное = НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// АПК:142-выкл 4 необязательных параметра

// Формирует строку представления контрагента.
//
// Параметры:
//  КонтрагентПредставление - Строка - представление контрагента.
//  ДоговорПредставление - Строка - представление договора.
//  ДокументПредставление - Строка - представление документа.
//  ЗаказПредставление - Строка - представление заказа.
//  ВидРасчетовПредставление - Строка - представление вида расчетов.
//
// Возвращаемое значение:
//  Строка - строка с представлением контрагента.
Функция Представление(КонтрагентПредставление, ДоговорПредставление = "", ДокументПредставление = "",
	ЗаказПредставление = "", ВидРасчетовПредставление = "") Экспорт
	
	КомпонентыПредставления = Новый Массив;
	КомпонентыПредставления.Добавить(СокрЛП(КонтрагентПредставление));
	
	Если ЗначениеЗаполнено(ДоговорПредставление)Тогда
		КомпонентыПредставления.Добавить(СокрЛП(ДоговорПредставление));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументПредставление)Тогда
		КомпонентыПредставления.Добавить(СокрЛП(ДокументПредставление));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказПредставление)Тогда
		КомпонентыПредставления.Добавить(СокрЛП(ЗаказПредставление));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидРасчетовПредставление)Тогда
		КомпонентыПредставления.Добавить(СокрЛП(ВидРасчетовПредставление));
	КонецЕсли;
	
	Возврат СтрСоединить(КомпонентыПредставления, ", ");
	
КонецФункции

// АПК:142-вкл

// Заполняет список выбора переданных полей формы значениями контактной информации контрагента/контактных лиц.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Владелец КИ.
//  Элементы   - ВсеЭлементыФормы - все элементы формы.
//  ПоляФормыСодержащиеКИ - Соответствие - те поля формы, список выбора которых требуется заполнить значениями
//                                         контактной информации.
//    * Ключ     - ПеречислениеСсылка.ТипыКонтактнойИнформации
//    * Значение - Имя поля формы
// 
// Возвращаемое значение:
//   - Соответствие
//     * Ключ     - ПеречислениеСсылка.ТипыКонтактнойИнформации
//     * Значение - Значение КИ по умолчанию
//
Функция ДанныеКИКонтрагентаДляВыбораНаФорме(Контрагент, Элементы, ПоляФормыСодержащиеКИ) Экспорт

	ТипыКИ = Новый Массив;
	Для Каждого КлючПоляФормыПоТипуКИ Из ПоляФормыСодержащиеКИ Цикл
		Элементы[КлючПоляФормыПоТипуКИ.Значение].СписокВыбора.Очистить();
		ТипыКИ.Добавить(КлючПоляФормыПоТипуКИ.Ключ);
	КонецЦикла;

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвязиКонтрагентКонтактСрезПервых.Контакт КАК Контакт,
	|	СвязиКонтрагентКонтактСрезПервых.Порядок КАК Порядок
	|ПОМЕСТИТЬ втПорядокКонтактовКонтрагента
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПервых(, Контрагент = &Контрагент) КАК СвязиКонтрагентКонтактСрезПервых
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛица.Ссылка КАК Ссылка,
	|	КонтактныеЛица.Наименование КАК Наименование,
	|	втПорядокКонтактовКонтрагента.Порядок КАК РеквизитДопУпорядочивания,
	|	КонтактныеЛица.КонтактнаяИнформация.(
	|		Тип КАК Тип,
	|		Представление КАК Представление,
	|		АдресЭП КАК АдресЭП,
	|		НомерТелефона КАК НомерТелефона
	|	) КАК КонтактнаяИнформация
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Контрагент = &Контрагент) КАК СвязиКонтрагентКонтактСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ПО СвязиКонтрагентКонтактСрезПоследних.Контакт = КонтактныеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокКонтактовКонтрагента КАК втПорядокКонтактовКонтрагента
	|		ПО (втПорядокКонтактовКонтрагента.Контакт = КонтактныеЛица.Ссылка)
	|ГДЕ
	|	КонтактныеЛица.КонтактнаяИнформация.Тип В(&ТипыКИ)
	|	И СвязиКонтрагентКонтактСрезПоследних.СвязьНедействительна = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.КонтактнаяИнформация.(
	|		Тип КАК Тип,
	|		Представление КАК Представление,
	|		АдресЭП КАК АдресЭП,
	|		НомерТелефона КАК НомерТелефона
	|	) КАК КонтактнаяИнформация
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|	И Контрагенты.КонтактнаяИнформация.Тип В(&ТипыКИ)";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТипыКИ", ТипыКИ);

	КонтрагентКонтактноеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "КонтактноеЛицо");
	ЗначенияКИПоУмолчанию = Новый Соответствие;

	Результат = Запрос.ВыполнитьПакет();
	Результат.Удалить(0);

	Для Каждого Выборка Из Результат Цикл
		ВладельцыКИ = Выборка.Выгрузить();
		Для Каждого ВладелецКИ Из ВладельцыКИ Цикл
			ПредставлениеВладельцаКИ = Новый ФорматированнаяСтрока(ВладелецКИ.Наименование, ,
				Метаданные.ЭлементыСтиля.ТекстВторостепеннойНадписи.Значение);

			Для Каждого КлючПоляФормыПоТипуКИ Из ПоляФормыСодержащиеКИ Цикл
				ТипКИ = КлючПоляФормыПоТипуКИ.Ключ;

				СтрокиКИ = ВладелецКИ.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", ТипКИ));
				Если СтрокиКИ.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;

				ПолеФормы = Элементы[КлючПоляФормыПоТипуКИ.Значение];
				ПолеФормы.СписокВыбора.Добавить("", ПредставлениеВладельцаКИ);

				Для Каждого КИ Из СтрокиКИ Цикл
					ПредставлениеКИ = Новый ФорматированнаяСтрока(Новый ФорматированнаяСтрока("• ", ,
						Метаданные.ЭлементыСтиля.ТекстВторостепеннойНадписи.Значение), КИ.Представление);
					Если КИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
						ЗначениеКИ = КИ.АдресЭП;
					ИначеЕсли КИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
						ЗначениеКИ = КИ.НомерТелефона;
						Если СтрНачинаетсяС(ЗначениеКИ, "7") Или СтрНачинаетсяС(ЗначениеКИ, "8") Тогда
							ЗначениеКИ = Сред(ЗначениеКИ, 2);
						КонецЕсли;
					Иначе
						ЗначениеКИ = КИ.Представление;
					КонецЕсли;
					ПолеФормы.СписокВыбора.Добавить(ЗначениеКИ, ПредставлениеКИ);

					Если (ВладелецКИ.Ссылка = Контрагент Или ВладелецКИ.Ссылка = КонтрагентКонтактноеЛицо)
						И ЗначенияКИПоУмолчанию.Получить(ТипКИ) = Неопределено Тогда
						ЗначенияКИПоУмолчанию.Вставить(ТипКИ, ЗначениеКИ);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Возврат ЗначенияКИПоУмолчанию;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

// Определяет, является ли контрагент резидентом государства-члена таможенного союза (ЕАЭС)
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - контрагент, для которого определяется резидентство в ЕАЭС
//
// Возвращаемое значение:
//  Булево - Истина, если переданный контрагент является резидентом ЕАЭС,
//  Ложь - в противном случае.
Функция КонтрагентРезидентТаможенногоСоюза(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СтранаРегистрацииКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "СтранаРегистрации");
		Возврат ПрослеживаемостьУНФ.ГосударствоЧленТаможенногоСоюза(СтранаРегистрацииКонтрагента);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

// Процедура - При определении образцов загрузки данных
//
// Параметры:
//  НастройкиЗагрузкиДанных	 - Структура - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//  УникальныйИдентификатор	 - УникальныйИдентификатор - идентификатор
//
Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

// Поля загрузки данных из внешнего источника.
// 
// Параметры:
//  ТаблицаПолейЗагрузки - см. ЗагрузкаДанныхИзВнешнегоИсточника.СоздатьТаблицуПолейОписанияЗагрузки
//  НастройкиЗагрузкиДанных - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт

	ОписанияТиповПолей = ЗагрузкаДанныхИзВнешнегоИсточника.НовыйОписанияТиповПолейЗагрузки();

	ФиксированныйШаблон = ?(НастройкиЗагрузкиДанных.Свойство("ФиксированныйШаблон"),
		НастройкиЗагрузкиДанных.ФиксированныйШаблон, Ложь);

	Если ФиксированныйШаблон Тогда
		ПредставлениеУИД = НСтр("ru = 'УИД'");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УИД", ПредставлениеУИД,
			ОписанияТиповПолей.ОписаниеТиповСтрока50, ОписанияТиповПолей.ОписаниеТиповСтрока50);
	КонецЕсли;

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ПредставлениеГруппа = НСтр("ru = 'Группа'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель",
		ПредставлениеГруппа, ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка);

	ИмяГруппыПолей = "Контрагент";
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ПредставлениеИНН = НСтр("ru = 'ИНН/КПП или ИНН'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ИНН_КПП", ПредставлениеИНН,
		ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписаниеТиповКолонка, ИмяГруппыПолей, 1, , Истина);

	ПредставлениеКонтрагентНаименование = НСтр("ru = 'Контрагент (наименование)'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КонтрагентНаименование",
		ПредставлениеКонтрагентНаименование, ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписаниеТиповКолонка,
		ИмяГруппыПолей, 3, Истина, Истина);

	ПредставлениеКонтрагентРасчетныйСчет = НСтр("ru = 'Контрагент (расчетный счет)'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "РасчетныйСчет",
		ПредставлениеКонтрагентРасчетныйСчет, ОписанияТиповПолей.ОписаниеТиповСтрока50, ОписаниеТиповКолонка,
		ИмяГруппыПолей, 4, , Истина);

	ПредставлениеЮридическоеНаименование = НСтр("ru = 'Юридическое название'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НаименованиеПолное",
		ПредставлениеЮридическоеНаименование, ОписанияТиповПолей.ОписаниеТиповСтрока1000,
		ОписанияТиповПолей.ОписаниеТиповСтрока1000);

	ПредставлениеКодПоОКПО = НСтр("ru = 'Код по ОКПО'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодПоОКПО",
		ПредставлениеКодПоОКПО, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписанияТиповПолей.ОписаниеТиповСтрока10);

	Если ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаКонтрагентов") Тогда

		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаКонтрагентов");
		ПредставлениеГруппаДоступаКонтрагента = НСтр("ru = 'Группа доступа контрагента'");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ГруппаДоступа",
			ПредставлениеГруппаДоступаКонтрагента, ОписанияТиповПолей.ОписаниеТиповСтрока200, ОписаниеТиповКолонка, , ,
			Истина);

	КонецЕсли;

	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПланСчетовСсылка.Управленческий");
	ПредставлениеСчетУчетаРасчетыСПокупателем = НСтр("ru = 'Счет учета (расчеты с покупателем)'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СчетУчетаРасчетовСПокупателем",
		ПредставлениеСчетУчетаРасчетыСПокупателем, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеСчетУчетаАвансыПокупателя = НСтр("ru = 'Счет учета (авансы покупателя)'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СчетУчетаАвансовПокупателя",
		ПредставлениеСчетУчетаАвансыПокупателя, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеСчетУчетаРасчетыСПоставщиком = НСтр("ru = 'Счет учета (расчеты с поставщиком)'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СчетУчетаРасчетовСПоставщиком",
		ПредставлениеСчетУчетаРасчетыСПоставщиком, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеСчетУчетаАвансыПоставщика = НСтр("ru = 'Счет учета (авансы поставщика)'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СчетУчетаАвансовПоставщику",
		ПредставлениеСчетУчетаАвансыПоставщика, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеКомментарий = НСтр("ru = 'Комментарий'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Комментарий",
		ПредставлениеКомментарий, ОписанияТиповПолей.ОписаниеТиповСтрока200, ОписанияТиповПолей.ОписаниеТиповСтрока200);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("Булево");
	ПредставлениеВестиРасчетыПоДоговорам = НСтр("ru = 'Вести расчеты по договорам'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВестиРасчетыПоДоговорам",
		ПредставлениеВестиРасчетыПоДоговорам, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеВестиРасчетыПоДокументам = НСтр("ru = 'Вести расчеты по документам'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВестиРасчетыПоДокументам",
		ПредставлениеВестиРасчетыПоДокументам, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеВестиРасчетыПоЗаказам = НСтр("ru = 'Вести расчеты по заказам'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВестиРасчетыПоЗаказам",
		ПредставлениеВестиРасчетыПоЗаказам, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеВестиРасчетыПоСчетам = НСтр("ru = 'Вести расчеты по счетам'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВестиУчетОплатыПоСчетам",
		ПредставлениеВестиРасчетыПоСчетам, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеЮридическийАдрес = НСтр("ru = 'Юр. адрес'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЮр",
		ПредставлениеЮридическийАдрес, ОписанияТиповПолей.ОписаниеТиповСтрока1000,
		ОписанияТиповПолей.ОписаниеТиповСтрока1000);

	ПредставлениеФактическийАдрес = НСтр("ru = 'Факт. адрес'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресФакт",
		ПредставлениеФактическийАдрес, ОписанияТиповПолей.ОписаниеТиповСтрока1000,
		ОписанияТиповПолей.ОписаниеТиповСтрока1000);

	ПредставлениеТелефон = НСтр("ru = 'Телефон'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Телефон",
		ПредставлениеТелефон, ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100);

	ПредставлениеПочты = НСтр("ru = 'E-mail'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "АдресЭП", ПредставлениеПочты,
		ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКонтрагентов");
	ПредставлениеВидКонтрагента = НСтр("ru = 'Вид контрагента'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВидКонтрагента",
		ПредставлениеВидКонтрагента, ОписанияТиповПолей.ОписаниеТиповСтрока25, ОписаниеТиповКолонка);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("Булево");
	ПредставлениеПокупатель = НСтр("ru = 'Покупатель'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Покупатель",
		ПредставлениеПокупатель, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеПоставщик = НСтр("ru = 'Поставщик'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Поставщик",
		ПредставлениеПоставщик, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеПрочиеОтношения = НСтр("ru = 'ПрочиеОтношения'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ПрочиеОтношения",
		ПредставлениеПрочиеОтношения, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеФИО = НСтр("ru = 'ФИО'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ФИО", ПредставлениеФИО,
		ОписанияТиповПолей.ОписаниеТиповСтрока100, ОписанияТиповПолей.ОписаниеТиповСтрока100);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица");
	ПредставлениеПолФизическогоЛица = НСтр("ru = 'Пол физ. лица'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Пол",
		ПредставлениеПолФизическогоЛица, ОписанияТиповПолей.ОписаниеТиповСтрока10, ОписаниеТиповКолонка);

	ПредставлениеДатаРожденияФизическогоЛица = НСтр("ru = 'Дата рождения физ. лица'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ДатаРождения",
		ПредставлениеДатаРожденияФизическогоЛица, ОписанияТиповПолей.ОписаниеТиповСтрока25,
		ОписанияТиповПолей.ОписаниеТиповДата);

	ПредставлениеДокументФизическогоЛица = НСтр("ru = 'Документ физ. лица'");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки,
		"ДокументУдостоверяющийЛичность", ПредставлениеДокументФизическогоЛица,
		ОписанияТиповПолей.ОписаниеТиповСтрока200, ОписанияТиповПолей.ОписаниеТиповСтрока200);
	
	// ДополнительныеРеквизиты
	НаборСвойств_Справочник_Контрагенты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты");
	ЗагрузкаДанныхИзВнешнегоИсточника.ПодготовитьСоответствиеПоДополнительнымРеквизитам(НастройкиЗагрузкиДанных,
		НаборСвойств_Справочник_Контрагенты);

	Если НастройкиЗагрузкиДанных.ОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда

		ИмяПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяПоляДобавленияДополнительныхРеквизитов();
		ПредставлениеДополнительныеРеквизиты = НСтр("ru = 'Дополнительные реквизиты'");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, ИмяПоля,
			ПредставлениеДополнительныеРеквизиты, ОписанияТиповПолей.ОписаниеТиповСтрока150,
			ОписанияТиповПолей.ОписаниеТиповСтрока11, , , , , , Истина, НаборСвойств_Справочник_Контрагенты);

	КонецЕсли;

КонецПроцедуры

// Процедура - Сопоставить загружаемые данные из внешнего источника
//
// Параметры:
//  ПараметрыСопоставления	 - Структура - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//  АдресРезультата			 - Строка - адрес результата сопоставления
//
Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата = "") Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ОбновлятьДанные				= НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Контрагент по ИНН, КПП, Наименованию, Расчетному счету
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьКонтрагентаПоУИД(СтрокаТаблицыФормы);
		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Контрагент);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = Справочники.Контрагенты.ПустаяСсылка();
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Контрагент, "Родитель", СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Контрагенты", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// КодПоОКПО
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.КодПоОКПО, СтрокаТаблицыФормы.КодПоОКПО_ВходящиеДанные);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаКонтрагентов") Тогда
			
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьГруппуДоступа(СтрокаТаблицыФормы.ГруппаДоступа, СтрокаТаблицыФормы.ГруппаДоступа_ВходящиеДанные);
			
		КонецЕсли;
		
		// СчетУчетаРасчетовСПокупателем по коду, наименованию
		ЗначениеПоУмолчанию = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Контрагент, "СчетУчетаРасчетовСПокупателем", СтрокаТаблицыФормы.СчетУчетаРасчетовСПокупателем_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСчетУчетаРасчетовСПокупателем(СтрокаТаблицыФормы.СчетУчетаРасчетовСПокупателем, СтрокаТаблицыФормы.СчетУчетаРасчетовСПокупателем_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// СчетУчетаАвансовПокупателя по коду, наименованию
		ЗначениеПоУмолчанию = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Контрагент, "СчетУчетаАвансовПокупателя", СтрокаТаблицыФормы.СчетУчетаАвансовПокупателя_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСчетУчетаАвансовПокупателя(СтрокаТаблицыФормы.СчетУчетаАвансовПокупателя, СтрокаТаблицыФормы.СчетУчетаАвансовПокупателя_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// СчетУчетаРасчетовСПокупателем по коду, наименованию
		ЗначениеПоУмолчанию = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Контрагент, "СчетУчетаРасчетовСПоставщиком", СтрокаТаблицыФормы.СчетУчетаРасчетовСПоставщиком_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСчетУчетаРасчетовСПоставщиком(СтрокаТаблицыФормы.СчетУчетаРасчетовСПоставщиком, СтрокаТаблицыФормы.СчетУчетаРасчетовСПоставщиком_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// СчетУчетаАвансовПоставщику по коду, наименованию
		ЗначениеПоУмолчанию = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
		ПриОпределенииЗначенияПоУмолчанию(СтрокаТаблицыФормы.Контрагент, "СчетУчетаАвансовПоставщику", СтрокаТаблицыФормы.СчетУчетаАвансовПоставщику_ВходящиеДанные, ЭтаСтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСчетУчетаАвансовПоставщику(СтрокаТаблицыФормы.СчетУчетаАвансовПоставщику, СтрокаТаблицыФормы.СчетУчетаАвансовПоставщику_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Комментарий
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Комментарий, СтрокаТаблицыФормы.Комментарий_ВходящиеДанные);
		
		// ВестиРасчетыПоДоговорам
		СтрокаКСопоставлению = ?(ПустаяСтрока(СтрокаТаблицыФормы.ВестиРасчетыПоДоговорам_ВходящиеДанные), "ИСТИНА", СтрокаТаблицыФормы.ВестиРасчетыПоДоговорам_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ВестиРасчетыПоДоговорам, СтрокаКСопоставлению);
		
		// ВестиРасчетыПоДокументам
		СтрокаКСопоставлению = ?(ПустаяСтрока(СтрокаТаблицыФормы.ВестиРасчетыПоДокументам_ВходящиеДанные), "ИСТИНА", СтрокаТаблицыФормы.ВестиРасчетыПоДокументам_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ВестиРасчетыПоДокументам, СтрокаКСопоставлению);
		
		// ВестиРасчетыПоЗаказам
		СтрокаКСопоставлению = ?(ПустаяСтрока(СтрокаТаблицыФормы.ВестиРасчетыПоЗаказам_ВходящиеДанные), "ИСТИНА", СтрокаТаблицыФормы.ВестиРасчетыПоЗаказам_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ВестиРасчетыПоЗаказам, СтрокаКСопоставлению);
		
		// ВестиУчетОплатыПоСчетам
		СтрокаКСопоставлению = ?(ПустаяСтрока(СтрокаТаблицыФормы.ВестиУчетОплатыПоСчетам_ВходящиеДанные), "ИСТИНА", СтрокаТаблицыФормы.ВестиУчетОплатыПоСчетам_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ВестиУчетОплатыПоСчетам, СтрокаКСопоставлению);
		
		// КИ (Юр. адрес, факт. адрес, адрес ЭП, телефон)
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресЮр, СтрокаТаблицыФормы.АдресЮр_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресФакт, СтрокаТаблицыФормы.АдресФакт_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.АдресЭП, СтрокаТаблицыФормы.АдресЭП_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Телефон, СтрокаТаблицыФормы.Телефон_ВходящиеДанные);
		
		// ВидыКонтрагентов
		ЗначениеПоУмолчанию = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьВидыКонтрагентов(СтрокаТаблицыФормы.ВидКонтрагента, СтрокаТаблицыФормы.ВидКонтрагента_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Покупатель, Поставщик, ПрочиеОтношения
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.Покупатель, СтрокаТаблицыФормы.Покупатель_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.Поставщик, СтрокаТаблицыФормы.Поставщик_ВходящиеДанные);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ПрочиеОтношения, СтрокаТаблицыФормы.ПрочиеОтношения_ВходящиеДанные);
		
		Если НЕ СтрокаТаблицыФормы.Покупатель
			И НЕ СтрокаТаблицыФормы.Поставщик
			И НЕ СтрокаТаблицыФормы.ПрочиеОтношения Тогда
			
			СтрокаТаблицыФормы.Покупатель = Истина;
			СтрокаТаблицыФормы.Поставщик = Истина;
			СтрокаТаблицыФормы.ПрочиеОтношения = Истина;
			
		КонецЕсли;
		
		// ФИО
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.ФИО, СтрокаТаблицыФормы.ФИО_ВходящиеДанные);
		
		// Пол
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПолФизическогоЛица(СтрокаТаблицыФормы.Пол, СтрокаТаблицыФормы.Пол_ВходящиеДанные);
		
		// ДатаРождения
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(СтрокаТаблицыФормы.ДатаРождения, СтрокаТаблицыФормы.ДатаРождения_ВходящиеДанные);
		
		// ДокументУдостоверяющийЛичность
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.ДокументУдостоверяющийЛичность, СтрокаТаблицыФормы.ДокументУдостоверяющийЛичность_ВходящиеДанные);
		
		// Доп. реквизиты
		Если НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты.Количество() > 0 Тогда
			
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьДополнительныеРеквизиты(СтрокаТаблицыФормы, НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты);
			
		КонецЕсли;
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// Процедура - Проверить корректность данных в строке таблицы
//
// Параметры:
//  СтрокаТаблицыФормы			 - ДанныеФормыСтруктура - строка
//  ПолноеИмяОбъектаЗаполнения	 - Строка - имя объекта
//
Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	СтрокаТаблицыФормы._СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Контрагент);
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = СтрокаТаблицыФормы._СтрокаСопоставлена
											ИЛИ (НЕ СтрокаТаблицыФормы._СтрокаСопоставлена И НЕ ПустаяСтрока(СтрокаТаблицыФормы.КонтрагентНаименование));
	
КонецПроцедуры

// Процедура - Обработать подготовленные данные
//
// Параметры:
//  СтруктураДанных				 - Структура - см. ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере
//  ФоновоеЗаданиеАдресХранилища - Строка - адрес результата
//
Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	НастройкиЗагрузкиДанных 	= СтруктураДанных.НастройкиЗагрузкиДанных;
	НастройкиОбновленияСвойств	= НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ОбновлятьСуществующие		= НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьЕслиНеСопоставлено = НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ТаблицаСопоставленияДанных	= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции	= 0;
	ТранзакцияОткрыта			= Ложь;
	
	Попытка
		
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			Если НЕ ТранзакцияОткрыта 
				И КоличествоЗаписейТранзакции = 0 Тогда
				
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				
			КонецЕсли;
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьЕслиНеСопоставлено);
			
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
				
				Если СтрокаТаблицы._СтрокаСопоставлена Тогда
					
					ЭлементСправочника = СтрокаТаблицы.Контрагент.ПолучитьОбъект();
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, НастройкиОбновленияСвойств.ИменаПолейОбновляемые);
					
				Иначе
					
					ЭлементСправочника = Справочники.Контрагенты.СоздатьЭлемент();
					
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "УИД") И ЗначениеЗаполнено(СтрокаТаблицы.УИД) Тогда
						НовыйУИД = Новый УникальныйИдентификатор(СтрокаТаблицы.УИД);
						ЭлементСправочника.УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку(НовыйУИД));
					КонецЕсли; 
					
					ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(НастройкиЗагрузкиДанных));
					
					ЭлементСправочника.Родитель = СтрокаТаблицы.Родитель;
					ЭлементСправочника.СтранаРегистрации = Справочники.СтраныМира.Россия;
					
				КонецЕсли;
				
				ЭлементСправочника.Наименование = СтрокаТаблицы.КонтрагентНаименование;
				ЭлементСправочника.НаименованиеПолное = ?(ЗначениеЗаполнено(СтрокаТаблицы.НаименованиеПолное_ВходящиеДанные),
					СтрокаТаблицы.НаименованиеПолное_ВходящиеДанные, СтрокаТаблицы.КонтрагентНаименование);
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "ИНН_КПП")
					И НЕ ПустаяСтрока(СтрокаТаблицы.ИНН_КПП) Тогда
					
					Разделители = Новый Массив;
					Разделители.Добавить("/");
					Разделители.Добавить("\");
					Разделители.Добавить("-");
					Разделители.Добавить("|");
					
					ИНН = "";
					КПП = "";
					
					Для каждого ЗначениеРазделителя Из Разделители Цикл
						
						ПозицияРазделителя = Найти(СтрокаТаблицы.ИНН_КПП, ЗначениеРазделителя);
						Если ПозицияРазделителя = 0 Тогда 
							
							Продолжить;
							
						КонецЕсли;
						
						ИНН = Лев(СтрокаТаблицы.ИНН_КПП, ПозицияРазделителя - 1);
						КПП = Сред(СтрокаТаблицы.ИНН_КПП, ПозицияРазделителя + 1);
						
					КонецЦикла;
					
					Если ПустаяСтрока(ИНН) И ПустаяСтрока(КПП) Тогда
						
						ИНН = СтрокаТаблицы.ИНН_КПП;
						
					КонецЕсли;
					
					ЭлементСправочника.ИНН = ИНН;
					ЭлементСправочника.КПП = КПП;
					
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЮр) Тогда
					
					ДобавитьКИ(ЭлементСправочника, СтрокаТаблицы.АдресЮр, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
					
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресФакт) Тогда
					
					ДобавитьКИ(ЭлементСправочника, СтрокаТаблицы.АдресФакт, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
					
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТаблицы.Телефон) Тогда
					
					ДобавитьКИ(ЭлементСправочника, СтрокаТаблицы.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
					
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТаблицы.АдресЭП) Тогда
					
					ДобавитьКИ(ЭлементСправочника, СтрокаТаблицы.АдресЭП, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
					
				КонецЕсли;
				
				Если НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты.Количество() > 0 Тогда
					
					ЗагрузкаДанныхИзВнешнегоИсточника.ОбработатьВыбранныеДополнительныеРеквизиты(ЭлементСправочника, СтрокаТаблицы._СтрокаСопоставлена, СтрокаТаблицы, НастройкиЗагрузкиДанных.ВыбранныеДополнительныеРеквизиты);
					
				КонецЕсли;
				
				ЭлементСправочника.Записать();
				
			КонецЕсли;
			
			ИндексТекущейСтроки = ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
			ТекстПрогресса      = СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейСтроки, РазмерТаблицыДанных);
			ПроцентВыполнения   = Окр(ИндексТекущейСтроки * 100 / РазмерТаблицыДанных);
			
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, ТекстПрогресса);
			
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТранзакцияОткрыта 
			И КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Контрагенты, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Лиды

// Лид на основании которого был создан контрагент.
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагент
// 
// Возвращаемое значение:
//   - СправочникСсылка.Лиды
//
Функция ЛидОснование(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Справочники.Лиды.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Лиды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лиды КАК Лиды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
	|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
	|ГДЕ
	|	СвязиКонтрагентЛид.Контрагент = &Контрагент";
	
	Запрос.Параметры.Вставить("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

// Возвращает количество завершенных лидов и лидов в работе переданного контрагента
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
// 
// Возвращаемое значение:
//  * Неопределено - контрагент не заполнен
//  * Структура:
//     ** КоличествоЛидовВРаботе - Число
//     ** КоличествоЗавершенныхЛидов - Число
//
Функция КоличествоЗавершенныхЛидовИЛидовВРаботе(Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА Лиды.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантЗавершенияРаботыСЛидом.ПустаяСсылка)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоЛидовВРаботе,
		|	КОЛИЧЕСТВО(Лиды.Ссылка) КАК КоличествоВсехЛидов
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лиды КАК Лиды
		|		ПО СвязиКонтрагентЛид.Лид = Лиды.Ссылка
		|ГДЕ
		|	СвязиКонтрагентЛид.Контрагент = &Контрагент
		|	И НЕ Лиды.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоЛидовВРаботе = Выборка.КоличествоЛидовВРаботе;
		Если Не ЗначениеЗаполнено(КоличествоЛидовВРаботе) Тогда
			КоличествоЛидовВРаботе = 0;
		КонецЕсли;
		КоличествоЗавершенныхЛидов = Выборка.КоличествоВсехЛидов - КоличествоЛидовВРаботе;
	Иначе
		КоличествоЛидовВРаботе = 0;
		КоличествоЗавершенныхЛидов = 0;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоЛидовВРаботе", КоличествоЛидовВРаботе);
	Результат.Вставить("КоличествоЗавершенныхЛидов", КоличествоЗавершенныхЛидов);
	Возврат Результат;
	
КонецФункции

// Возвращает данные по связанным лидам
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
//  Отбор - Неопределено, Структура - позволяет устанавливать дополнительный отбор по лидам:
//   * ПовторноеОбращение - Произвольный
//   * НеПроверятьРЛС - Произвольный
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.Лиды
//
Функция СвязанныеЛиды(Контрагент, Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязиКонтрагентЛид.Лид КАК Лид
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|ГДЕ
		|	СвязиКонтрагентЛид.Контрагент = &Контрагент
		|	И СвязиКонтрагентЛид.Лид.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)";
	
	Если Не Отбор.Свойство("ПовторноеОбращение") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"И СвязиКонтрагентЛид.Лид.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыЛидов.ПовторноеОбращение)", "");
	КонецЕсли;
	
	Если Отбор.Свойство("НеПроверятьРЛС") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Лид);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Позвращает представление команды для перехода к лидам контрагента
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
// 
// Возвращаемое значение:
//  Строка - пустая строка, если у контрагента нет лидов
//
Функция ПредставлениеЛидовКонтрагента(Контрагент) Экспорт
	
	КоличествоЛидовКонтрагента = Справочники.Контрагенты.КоличествоЗавершенныхЛидовИЛидовВРаботе(Контрагент);
	
	Если КоличествоЛидовКонтрагента = Неопределено
		Или (Не КоличествоЛидовКонтрагента.КоличествоЛидовВРаботе
		И Не КоличествоЛидовКонтрагента.КоличествоЗавершенныхЛидов) Тогда
		Возврат "";
	КонецЕсли;
	
	Если КоличествоЛидовКонтрагента.КоличествоЛидовВРаботе Тогда
		
		ЗаголовокПоЛидамВРаботе = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';%1 в работе;;%1 в работе;%1 в работе;%1 в работе'"),
		КоличествоЛидовКонтрагента.КоличествоЛидовВРаботе);
		
	КонецЕсли;
	
	Если КоличествоЛидовКонтрагента.КоличествоЗавершенныхЛидов Тогда
		
		ЗаголовокПоЗавершеннымЛидам = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';%1 завершенный;;%1 завершенных;%1 завершенных;%1 завершенных'"),
		КоличествоЛидовКонтрагента.КоличествоЗавершенныхЛидов);
		
	КонецЕсли;
	
	Если КоличествоЛидовКонтрагента.КоличествоЛидовВРаботе
		И КоличествоЛидовКонтрагента.КоличествоЗавершенныхЛидов Тогда
		
		Возврат СтрШаблон(НСтр("ru = '%1 и %2'"), ЗаголовокПоЛидамВРаботе, ЗаголовокПоЗавершеннымЛидам);
		
	ИначеЕсли КоличествоЛидовКонтрагента.КоличествоЛидовВРаботе Тогда
		
		Возврат ЗаголовокПоЛидамВРаботе;
		
	Иначе
		
		Возврат ЗаголовокПоЗавершеннымЛидам;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает результат запроса по видам контактной информации которые могут использоваться при печати
//
Функция ПолучитьДоступныеДляПечатиВидыКИ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК ВидКИ,
		|	ВидыКонтактнойИнформации.Наименование КАК Наименование,
		|	1 КАК ИндексВладельцаКИ,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Родитель = &КИСправочникКонтрагенты
		|	И ВидыКонтактнойИнформации.ЭтоГруппа = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка,
		|	ВидыКонтактнойИнформации.Наименование,
		|	2,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Родитель = &КИСправочникКонтактныеЛица
		|	И ВидыКонтактнойИнформации.ЭтоГруппа = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка,
		|	ВидыКонтактнойИнформации.Наименование,
		|	3,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Родитель = &КИСправочникФизическиеЛица
		|	И ВидыКонтактнойИнформации.ЭтоГруппа = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
		|	И ВидыКонтактнойИнформации.Тип = &ТипТелефон
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИндексВладельцаКИ,
		|	РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("КИСправочникКонтрагенты", Справочники.ВидыКонтактнойИнформации.СправочникКонтрагенты);	
	Запрос.УстановитьПараметр("КИСправочникКонтактныеЛица", Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица);	
	Запрос.УстановитьПараметр("КИСправочникФизическиеЛица", Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица);	
	Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция задает начальное значение использования вида контактной информации
//
// Параметры:
//  ВидКИ	 - Справочник.ВидыКонтактнойИнформации	 - Проверяемый вид контактной информации
// Возвращаемое значение:
//  Булево - Вид контактной информации печатается по умолчанию
Функция УстановитьПечатьВидаКИПоУмолчанию(ВидКИ) Экспорт
	
	Если ВидКИ = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента 
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагента
		Тогда
			Возврат Ложь;
	КонецЕсли;
	
	Возврат ВидКИ.Предопределенный;
	
КонецФункции

// Функция возвращает строку с последними 10 цифрами номера телефона в обратном порядке
//
// Параметры:
//  НомерТелефона - Строка - Строка с номером телефона
// Возвращаемое значение:
//  Строка - 10 последних цифр номера телефона в обратном порядке
Функция ПолучитьОбратныйНомерТелефонаБезКодаСтраны(НомерТелефона) Экспорт
	
	РезультатФункции = "";
	
	ДлинаОбратногоНомера = 10;
	ДлинаИсходногоНомера = СтрДлина(НомерТелефона);
	ИндексСимвола = 0;
	Пока ИндексСимвола < ДлинаИсходногоНомера И СтрДлина(РезультатФункции) < ДлинаОбратногоНомера Цикл
		ТекущийСимвол = Сред(НомерТелефона, ДлинаИсходногоНомера - ИндексСимвола, 1);
		Если СтрНайти("0123456789", ТекущийСимвол) > 0 Тогда
			РезультатФункции = РезультатФункции + ТекущийСимвол;
		КонецЕсли;
		ИндексСимвола = ИндексСимвола + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// См. АвтоподборКонтактовКлиент.Подключаемый_АвтоПодбор
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Рекурсия") Тогда
		Если Параметры.ВыборГруппИЭлементов <> ИспользованиеГруппИЭлементов.Группы Тогда
			
			Если Не Параметры.Отбор.Свойство("Недействителен") Тогда
				Параметры.Отбор.Вставить("Недействителен", Ложь);
			КонецЕсли;
			
		Иначе
			
			Для Каждого КлючИЗначение Из Параметры.Отбор Цикл
				НайденныйРеквизит = Метаданные.Справочники.Контрагенты.Реквизиты.Найти(КлючИЗначение.Ключ);
				Если НайденныйРеквизит = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если НайденныйРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
					Параметры.Отбор.Удалить(КлючИЗначение.Ключ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Параметры.Вставить("Рекурсия");
		СтандартныйСписок = ПолучитьДанныеВыбора(Параметры);
		ДополнитьДанныеВыбора(СтандартныйСписок, Параметры.СтрокаПоиска);
		ДанныеВыбора = СтандартныйСписок;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюФормуКонтрагентов") И ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаЭлементаБыстрая";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКИ(ЭлементСправочника, ПредставлениеКИ, ВидКИ)
	
	ЗначениеКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ПредставлениеКИ, ВидКИ);
	УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭлементСправочника, ЗначениеКИ, ВидКИ, ВидКИ.Тип);
	
КонецПроцедуры

Процедура ПриОпределенииЗначенияПоУмолчанию(СправочникСсылка, ИмяРеквизита, ВходящиеДанные, СтрокаСопоставлена, ОбновлятьДанные, ЗначениеПоУмолчанию)
	
	Если СтрокаСопоставлена 
		И НЕ ЗначениеЗаполнено(ВходящиеДанные) Тогда
		
		ЗначениеПоУмолчанию = СправочникСсылка[ИмяРеквизита];
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает текст запроса для печати прайс-листа (ценовая группа)
//
Функция ПолучитьТекстЗапросаДляПечатиПрайсЛистаЦеноваяГруппа()
	
	Возврат 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ВыводитьКод = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.Код
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул
	|	КОНЕЦ КАК АртикулКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьПолноеНаименование = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование
	|	КОНЕЦ КАК ПредставлениеНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			Актуальность
	|				И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование,
	|	Характеристика,
	|	АртикулКод
	|ИТОГИ ПО
	|	ЦеноваяГруппа";
	
КонецФункции // ПолучитьТекстЗапросаДляПечатиПрайсЛиста()

// Возвращает текст запроса для печати прайс-листа (иерархия номенклатуры)
//
Функция ПолучитьТекстЗапросаДляПечатиПрайсЛистаИерархияНоменклатуры()
	
	Возврат 
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ВыводитьКод = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|			ТОГДА СправочникНоменклатура.Код
	|		ИНАЧЕ СправочникНоменклатура.Артикул
	|	КОНЕЦ КАК АртикулКод,
	|	ВЫБОР
	|		КОГДА &ВыводитьПолноеНаименование = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|			ТОГДА СправочникНоменклатура.НаименованиеПолное
	|		ИНАЧЕ СправочникНоменклатура.Наименование
	|	КОНЕЦ КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.Родитель КАК Родитель,
	|	СправочникНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				Актуальность
	|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СправочникНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	СправочникНоменклатура.Ссылка ИЕРАРХИЯ,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование,
	|	Характеристика,
	|	АртикулКод";
	
КонецФункции // ПолучитьТекстЗапросаДляПечатиПрайсЛиста()

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("ГруппаДоступа");
	РедактируемыеРеквизиты.Добавить("ДатаСоздания");
	РедактируемыеРеквизиты.Добавить("Недействителен");
	РедактируемыеРеквизиты.Добавить("Покупатель");
	РедактируемыеРеквизиты.Добавить("Поставщик");
	РедактируемыеРеквизиты.Добавить("Пол");
	РедактируемыеРеквизиты.Добавить("ПрочиеОтношения");
	РедактируемыеРеквизиты.Добавить("СтранаРегистрации");
	РедактируемыеРеквизиты.Добавить("Ответственный");
	РедактируемыеРеквизиты.Добавить("ИсточникПривлеченияПокупателя");
	РедактируемыеРеквизиты.Добавить("СчетУчетаРасчетовСПокупателем");
	РедактируемыеРеквизиты.Добавить("СчетУчетаАвансовПокупателя");
	РедактируемыеРеквизиты.Добавить("СчетУчетаРасчетовСПоставщиком");
	РедактируемыеРеквизиты.Добавить("СчетУчетаАвансовПоставщику");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Процедура добавляет к списку выбора контрагентов, найденных по номерам телефона и адресамЭП,
// связанных с контрагентом контактов
// Процедура добавляет к списку выбора контрагентов, найденных по номерам телефона и адресамЭП,
// связанных с контрагентом контактов
Процедура ДополнитьДанныеВыбора(ДанныеВыбора, СтрокаПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязиКонтрагентКонтакт.Контрагент КАК Контрагент,
	|	СвязиКонтрагентКонтакт.Контакт КАК Контакт
	|ПОМЕСТИТЬ ВТ_СвязиКонтрагентКонтакт
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних КАК СвязиКонтрагентКонтакт
	|ГДЕ
	|	СвязиКонтрагентКонтакт.СвязьНедействительна = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
	|	ВТ_СвязиКонтрагентКонтакт.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_СвязиКонтрагентКонтакт.Контрагент) КАК Представление,
	|	"""" КАК НомерТелефонаДляПоиска,
	|	КонтактныеЛица.АдресЭПДляПоиска КАК АдресЭПДляПоиска
	|ИЗ
	|	ВТ_СвязиКонтрагентКонтакт КАК ВТ_СвязиКонтрагентКонтакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ПО ВТ_СвязиКонтрагентКонтакт.Контакт = КонтактныеЛица.Ссылка
	|ГДЕ
	|	КонтактныеЛица.АдресЭПДляПоиска ПОДОБНО &СтрокаПоиска
	|	И КонтактныеЛица.Недействителен = ЛОЖЬ";
	
	Если НЕ ЗапрещенныеСимволыВНомереТелефона(СтрокаПоиска) Тогда
		Запрос.Текст = Запрос.Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
		Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		|	ВТ_СвязиКонтрагентКонтакт.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_СвязиКонтрагентКонтакт.Контрагент) КАК КонтрагентПредставление,
		|	КонтактныеЛица.НомерТелефонаДляПоиска КАК НомерТелефонаДляПоиска,
		|	"""" КАК АдресЭПДляПоиска
		|ИЗ
		|	ВТ_СвязиКонтрагентКонтакт КАК ВТ_СвязиКонтрагентКонтакт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
		|		ПО ВТ_СвязиКонтрагентКонтакт.Контакт = КонтактныеЛица.Ссылка
		|ГДЕ
		|	(КонтактныеЛица.НомерТелефонаДляПоиска ПОДОБНО &СтрокаПоиска
		|			ИЛИ КонтактныеЛица.НомерТелефонаДляПоиска ПОДОБНО &ТелефонДляПоиска)
		|	И КонтактныеЛица.Недействителен = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		|	Контрагенты.Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(Контрагенты.Ссылка),
		|	Контрагенты.НомерТелефонаДляПоиска,
		|	""""
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.НомерТелефонаДляПоиска ПОДОБНО &ТелефонДляПоиска
		|	И Контрагенты.Недействителен = ЛОЖЬ";
		
	КонецЕсли; 
	
	СтрокаПоискаДляЗапроса = "%"+СтрокаПоиска+"%";
	ТелефонДляПоиска = КонтактнаяИнформацияУНФ.ПреобразоватьНомерДляКонтактнойИнформации(СтрокаПоиска);
	ТелефонДляПоиска = СтрЗаменить(ТелефонДляПоиска, "+", "");
	Если СтрНачинаетсяС(ТелефонДляПоиска, "7") Тогда
		ТелефонДляПоиска = Сред(ТелефонДляПоиска, 2, СтрДлина(ТелефонДляПоиска) - 1);
	КонецЕсли;
	ТелефонДляПоискаДляЗапроса = "%"+ТелефонДляПоиска+"%";
	
	Запрос.УстановитьПараметр("ТелефонДляПоиска", ТелефонДляПоискаДляЗапроса);
	Запрос.УстановитьПараметр("СтрокаПоиска",     СтрокаПоискаДляЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ДанныеВыбора <> Неопределено И ДанныеВыбора.НайтиПоЗначению(Выборка.Контрагент) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Представление = "";
		
		СтрокаДляЗамены = СтрокаПоиска;
		Позиция = Найти(НРег(Выборка.НомерТелефонаДляПоиска), НРег(СтрокаПоиска));
		
		Если Позиция = 0 Тогда
			Позиция = Найти(НРег(Выборка.НомерТелефонаДляПоиска), НРег(ТелефонДляПоиска));
			СтрокаДляЗамены = ТелефонДляПоиска;
		КонецЕсли;
		
		Если Позиция = 0 Тогда
			Позиция = Найти(НРег(Выборка.НомерТелефонаДляПоиска), НРег(СтрокаПоискаДляЗапроса));
			СтрокаДляЗамены = СтрокаПоискаДляЗапроса;
		КонецЕсли;
		
		Если Позиция>0 Тогда
			ТекстДо = Лев(Выборка.НомерТелефонаДляПоиска, Позиция-1);
			ТекстЦентр = Сред(Выборка.НомерТелефонаДляПоиска, Позиция, СтрДлина(СтрокаДляЗамены));
			ТекстПосле = Сред(Выборка.НомерТелефонаДляПоиска, Позиция+СтрДлина(СтрокаДляЗамены));
			ВыделенныйТекст = Новый ФорматированнаяСтрока(ТекстЦентр, Новый Шрифт(Новый Шрифт,,, Истина), WebЦвета.ЗеленыйЛес);
			Представление = Новый ФорматированнаяСтрока(ТекстДо, ВыделенныйТекст, ТекстПосле);
		Иначе
			Позиция = Найти(НРег(Выборка.АдресЭПДляПоиска), НРег(СтрокаПоиска));
			ТекстДо = Лев(Выборка.АдресЭПДляПоиска, Позиция-1);
			ТекстЦентр = Сред(Выборка.АдресЭПДляПоиска, Позиция, СтрДлина(СтрокаПоиска));
			ТекстПосле = Сред(Выборка.АдресЭПДляПоиска, Позиция+СтрДлина(СтрокаПоиска));
			ВыделенныйТекст = Новый ФорматированнаяСтрока(ТекстЦентр, Новый Шрифт(Новый Шрифт,,, Истина), WebЦвета.ЗеленыйЛес);
			Представление = Новый ФорматированнаяСтрока(ТекстДо, ВыделенныйТекст, ТекстПосле);
		КонецЕсли;
		
		Представление = Новый ФорматированнаяСтрока(Представление, " (",Выборка.Представление,")");
		ДанныеВыбора.Добавить(Выборка.Контрагент, Представление);
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапрещенныеСимволыВНомереТелефона(СтрокаПоиска)
	
	РазрешенныеСимволыВНомереТелефона = "0123456789+-() ";
	Для НомерСимвола = 1 По СтрДлина(СтрокаПоиска) Цикл
		Если СтрНайти(РазрешенныеСимволыВНомереТелефона, Сред(СтрокаПоиска, НомерСимвола, 1)) = 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Возврат;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ПроверкаДублей

// Функция определяет наличие дублей у контрагента.
// ИНН - ИНН проверяемого контрагента, Тип - Строка(12)
// КПП - КПП проверяемого контрагента, Тип - Строка(9)
// Ссылка - Сам проверяемый контрагент, Тип - СправочникСсылка.Контрагенты
Функция ПроверитьДублиСправочникаКонтрагентыПоИННКПП(Знач ИНН, Знач КПП, ИсключаяСсылку = Неопределено, ПроверкаПриЗаписи = Ложь) Экспорт
	
	Дубли = Новый Массив;
	
	Запрос = Новый Запрос;
	// Если записываем элемент, то сначала проверим наличие дублей
	// в регистре. Операция выполняется только при событии объекта ПередЗаписью
	// В интерактивной проверке дублей не применяется, 
	// т.к. на регистр устанавливаются исключительные блокировки.
	Если ПроверкаПриЗаписи Тогда
		Дубли = ЕстьЗаписиВРегистреДублей(ИНН, КПП, ИсключаяСсылку);
	КонецЕсли;
	
	// Если при записи элемента ничего не нашлось в регистре дублей, 
	// или при интерактивной проверке выполним поиск дублей по справочнику Контрагенты
	Если Дубли.Количество() = 0 Тогда
		
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	Контрагенты.Ссылка
		               	|ИЗ
		               	|	Справочник.Контрагенты КАК Контрагенты
		               	|ГДЕ
		               	|	НЕ Контрагенты.ЭтоГруппа
		               	|	И НЕ Контрагенты.Ссылка = &Ссылка
		               	|	И Контрагенты.ИНН = &ИНН
		               	|	И Контрагенты.КПП = &КПП";
		
		Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
		Запрос.УстановитьПараметр("КПП", СокрЛП(КПП));
		Запрос.УстановитьПараметр("Ссылка", ИсключаяСсылку);
		
		УстановитьПривилегированныйРежим(Истина);
		ВыборкаДублей = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Пока ВыборкаДублей.Следующий() Цикл
			Дубли.Добавить(ВыборкаДублей.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Дубли;
	
КонецФункции

// Процедура возвращает массив дублей по записям в регистре Наличие дублей контрагентов
// На вход получает ИНН, КПП и ссылку на контрагента
Функция ЕстьЗаписиВРегистреДублей(ИНН, КПП, ИсключаяСсылку = Неопределено) Экспорт
	
	Дубли = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ИсключаяСсылку);
	Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
	Запрос.УстановитьПараметр("КПП", СокрЛП(КПП));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаличиеДублейУКонтрагентов.Контрагент КАК Ссылка
	|ИЗ
	|	РегистрСведений.НаличиеДублейУКонтрагентов КАК НаличиеДублейУКонтрагентов
	|ГДЕ
	|	НЕ НаличиеДублейУКонтрагентов.Контрагент = &Ссылка
	|	И НаличиеДублейУКонтрагентов.КПП = &КПП
	|	И НаличиеДублейУКонтрагентов.ИНН = &ИНН";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДублей = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДублей.Следующий() Цикл
		Дубли.Добавить(ВыборкаДублей.Ссылка);
	КонецЦикла;
	
	Возврат Дубли;
	
КонецФункции

// Процедура делает движения в регистре дублей
// Ссылка - ссылка на элемент справочника Контрагенты
// ИНН - ИНН записываемого контрагента
// КПП - КПП записываемого контрагента
// НужноУдалить:
//				Истина - удалить запись по переданному контрагенту
//				Ложь   - сделать запись по переданному контрагенту
Процедура ВыполнитьДвиженияПоРегиструДублей(Ссылка, ИНН = "", КПП = "", НужноУдалить) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НаличиеДублейУКонтрагентов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Контрагент = Ссылка;
	МенеджерЗаписи.ИНН        = ИНН;
	МенеджерЗаписи.КПП        = КПП;
	
	МенеджерЗаписи.Прочитать();
	
	ЗаписьСуществует = МенеджерЗаписи.Выбран();
	
	Если НужноУдалить И ЗаписьСуществует Тогда
		МенеджерЗаписи.Удалить();
	ИначеЕсли Не НужноУдалить И НЕ ЗаписьСуществует Тогда
		
		МенеджерЗаписи.Контрагент = Ссылка;
		МенеджерЗаписи.ИНН        = ИНН;
		МенеджерЗаписи.КПП        = КПП;
		
		МенеджерЗаписи.Активность = Истина;
		МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсПечати

Процедура ЗаполнитьПараметрыОбласти(ИмяОбласти, ЗначенияПараметров, СтруктураПечати, ВыводитьЛоготип = Ложь)
	
	Перем ОбластьНоменклатура, ОбластьХарактеристика, ОбластьЦена;
	
	СтруктураПечати.СтруктураОбластей.Свойство("Область" + ИмяОбласти + "Номенклатура",		ОбластьНоменклатура);
	СтруктураПечати.СтруктураОбластей.Свойство("Область" + ИмяОбласти + "Характеристика",	ОбластьХарактеристика);
	СтруктураПечати.СтруктураОбластей.Свойство("Область" + ИмяОбласти + "Цена",				ОбластьЦена);
	
	ОбластьНоменклатура.Параметры.Заполнить(ЗначенияПараметров);
	
	Если ВыводитьЛоготип Тогда
		
		ПечатьДокументовУНФ.УстановитьКартинкуБезопасно(ОбластьНоменклатура.Рисунки, "Логотип", ЗначенияПараметров.Картинка);
		
	КонецЕсли;
	
	СтруктураПечати.ТабличныйДокумент.Вывести(ОбластьНоменклатура);
	
	Если СтруктураПечати.ИспользоватьХарактеристики Тогда
		
		ОбластьХарактеристика.Параметры.Заполнить(ЗначенияПараметров);
		СтруктураПечати.ТабличныйДокумент.Присоединить(ОбластьХарактеристика);
		
	КонецЕсли;
	
	ОбластьЦена.Параметры.Заполнить(ЗначенияПараметров);
	СтруктураПечати.ТабличныйДокумент.Присоединить(ОбластьЦена);
	
КонецПроцедуры

Процедура ЗаполнитьЗаголовокПрайсЛиста(ИмяОбласти, СтруктураПечати)
	
	ЗначенияПараметров = Новый Структура;
	ЗначенияПараметров.Вставить("Заголовок", "Прайс-лист");
	
	ЗаполнитьПараметрыОбласти(ИмяОбласти, ЗначенияПараметров, СтруктураПечати);
	
КонецПроцедуры

Процедура ЗаполнитьОтправителяПрайсЛиста(СтруктураПечати)
	
	ОрганизацияПоУмолчанию = ПолучитьОрганизациюПоУмолчанию(СтруктураПечати.Контрагент);
	
	СведенияООтправителе = ПечатьДокументовУНФ.СведенияОЮрФизЛице(ОрганизацияПоУмолчанию, ТекущаяДатаСеанса());
	
	ЗначенияПараметров = 
		Новый Структура("Отправитель, ОтправительАдрес, ОтправительТелефон, ОтправительФакс, ОтправительEmail",
			СведенияООтправителе.Представление,
			СведенияООтправителе.ФактическийАдрес,
			СведенияООтправителе.Телефоны,
			СведенияООтправителе.Факс,
			СведенияООтправителе.ЭлектроннаяПочта);
			
	ВыводитьЛоготип = Ложь;
	ИмяОбласти 		= "ОтправительБезЛоготипа";
	
	Если ЗначениеЗаполнено(ОрганизацияПоУмолчанию.ФайлЛоготип) Тогда
		
		ДанныеКартинки = РаботаСФайлами.ДвоичныеДанныеФайла(ОрганизацияПоУмолчанию.ФайлЛоготип);
		Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
			
			ВыводитьЛоготип = Истина;
			ИмяОбласти		= "ОтправительСЛоготипом";
			ЗначенияПараметров.Вставить("Картинка", Новый Картинка(ДанныеКартинки));
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьПараметрыОбласти(ИмяОбласти, ЗначенияПараметров, СтруктураПечати, ВыводитьЛоготип);
	
КонецПроцедуры

Процедура ЗаполнитьСформированоПрайсЛиста(ИмяОбласти, СтруктураПечати)
	
	ПредставлениеДатыФормирования = Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
	ТекстСформировано = СтрШаблон(НСтр("ru = 'Сформировано %1'"), ПредставлениеДатыФормирования);
	ЗначенияПараметров = Новый Структура("Сформировано", ТекстСформировано);
	ЗаполнитьПараметрыОбласти(ИмяОбласти, ЗначенияПараметров, СтруктураПечати);
	
КонецПроцедуры

Процедура ЗаполнитьШапкуПрайсЛиста(ИмяОбласти, СтруктураПечати)
	
	ВидЦен = ПолучитьВидЦенПоУмолчанию(СтруктураПечати.Контрагент);
	
	ЗначенияПараметров = 
		Новый Структура("АртикулКод, ВидЦен, Цена",
			?(Константы.ПрайсЛистВыводитьКод.Получить() = Перечисления.ДаНет.Да, "Код", "Артикул"),
			ВидЦен,
			"Цена (" + ВидЦен.ВалютаЦены + ")");
	
	ЗаполнитьПараметрыОбласти(ИмяОбласти, ЗначенияПараметров, СтруктураПечати);
	
КонецПроцедуры

Процедура ЗаполнитьДеталиПрайсЛистаЦеноваяГруппа(СтруктураПечати)
	
	Запрос = Новый Запрос(ПолучитьТекстЗапросаДляПечатиПрайсЛистаЦеноваяГруппа());
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦен", ПолучитьВидЦенПоУмолчанию(СтруктураПечати.Контрагент));
	Запрос.УстановитьПараметр("ВыводитьКод", Константы.ПрайсЛистВыводитьКод.Получить());
	Запрос.УстановитьПараметр("ВыводитьПолноеНаименование", Константы.ПрайсЛистВыводитьПолноеНаименование.Получить());
	
	ЗначенияПараметров = 
		Новый Структура("ЦеноваяГруппа, АртикулКод, ПредставлениеНоменклатуры, Номенклатура, Характеристика, ЕдиницаИзмерения, Цена");
	
	ВыборкаЦеновыеГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаЦеновыеГруппы.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ЗначенияПараметров, ВыборкаЦеновыеГруппы);
		ЗаполнитьПараметрыОбласти("ЦеноваяГруппа", ЗначенияПараметров, СтруктураПечати);
		
		ВыборкаДетали = ВыборкаЦеновыеГруппы.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ЗначенияПараметров, ВыборкаДетали);
			ЗаполнитьПараметрыОбласти("Детали", ЗначенияПараметров, СтруктураПечати);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеталиПрайсЛистаИерархияНоменклатуры(СтруктураПечати, Выборка, ВывестиНоменклатуруБезРодителя = Ложь)
	
	ЗначенияПараметров = 
		Новый Структура("ЦеноваяГруппа, АртикулКод, ПредставлениеНоменклатуры, Номенклатура, Характеристика, ЕдиницаИзмерения, Цена");
	
	Если ВывестиНоменклатуруБезРодителя Тогда
		
		ЗначенияПараметров.ЦеноваяГруппа = НСтр("ru = '<...>'");
		ЗаполнитьПараметрыОбласти("ЦеноваяГруппа", ЗначенияПараметров, СтруктураПечати);
		СтруктураПечати.ТабличныйДокумент.НачатьГруппуСтрок();
		
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		// Сложные условия в операторе "Если" необходимы, для того, что бы номенклатура без родителя выводилась первой в прайс-листе
		Если Выборка.ЭтоГруппа 
			И НЕ ВывестиНоменклатуруБезРодителя Тогда
			
			ЗначенияПараметров.ЦеноваяГруппа = Выборка.Номенклатура;
			ЗаполнитьПараметрыОбласти("ЦеноваяГруппа", ЗначенияПараметров, СтруктураПечати);
			
			СтруктураПечати.ТабличныйДокумент.НачатьГруппуСтрок();
			ЗаполнитьДеталиПрайсЛистаИерархияНоменклатуры(СтруктураПечати, Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией));
			СтруктураПечати.ТабличныйДокумент.ЗакончитьГруппуСтрок();
			
		ИначеЕсли НЕ Выборка.ЭтоГруппа 
			И (ВывестиНоменклатуруБезРодителя 
				ИЛИ ЗначениеЗаполнено(Выборка.Родитель)) Тогда
			
			ЗаполнитьЗначенияСвойств(ЗначенияПараметров, Выборка);
			ЗаполнитьПараметрыОбласти("Детали", ЗначенияПараметров, СтруктураПечати);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВывестиНоменклатуруБезРодителя Тогда
		
		СтруктураПечати.ТабличныйДокумент.ЗакончитьГруппуСтрок();
		Выборка.Сбросить();
		ЗаполнитьДеталиПрайсЛистаИерархияНоменклатуры(СтруктураПечати, Выборка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьДанныеПрайсЛистаИерархияНоменклатуры(СтруктураПечати)
	
	Запрос = Новый Запрос(ПолучитьТекстЗапросаДляПечатиПрайсЛистаИерархияНоменклатуры());
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦен", ПолучитьВидЦенПоУмолчанию(СтруктураПечати.Контрагент));
	Запрос.УстановитьПараметр("ВыводитьКод", Константы.ПрайсЛистВыводитьКод.Получить());
	Запрос.УстановитьПараметр("ВыводитьПолноеНаименование", Константы.ПрайсЛистВыводитьПолноеНаименование.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ЗаполнитьДеталиПрайсЛистаИерархияНоменклатуры(СтруктураПечати, РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает структуру областей макета для формирования прайс-листа
//
Функция ЗаполнитьСтруктуруОбластейМакета(Макет)
	
	СтруктураОбластей = Новый Структура;
	
	СтруктураОбластей.Вставить("ОбластьОтступНоменклатура",			Макет.ПолучитьОбласть("Отступ|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьОтступХарактеристика",		Макет.ПолучитьОбласть("Отступ|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьОтступЦена",					Макет.ПолучитьОбласть("Отступ|Цена"));
	
	СтруктураОбластей.Вставить("ОбластьЗаголовокНоменклатура",		Макет.ПолучитьОбласть("Заголовок|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьЗаголовокХарактеристика",	Макет.ПолучитьОбласть("Заголовок|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьЗаголовокЦена",				Макет.ПолучитьОбласть("Заголовок|Цена"));
	
	СтруктураОбластей.Вставить("ОбластьОтправительБезЛоготипаНоменклатура",		Макет.ПолучитьОбласть("ОтправительБезЛоготипа|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьОтправительБезЛоготипаХарактеристика",	Макет.ПолучитьОбласть("ОтправительБезЛоготипа|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьОтправительБезЛоготипаЦена",				Макет.ПолучитьОбласть("ОтправительБезЛоготипа|Цена"));
	
	СтруктураОбластей.Вставить("ОбластьОтправительСЛоготипомНоменклатура",		Макет.ПолучитьОбласть("ОтправительСЛоготипом|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьОтправительСЛоготипомХарактеристика",	Макет.ПолучитьОбласть("ОтправительСЛоготипом|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьОтправительСЛоготипомЦена",				Макет.ПолучитьОбласть("ОтправительСЛоготипом|Цена"));
	
	СтруктураОбластей.Вставить("ОбластьСформированоНоменклатура",	Макет.ПолучитьОбласть("Сформировано|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьСформированоХарактеристика",	Макет.ПолучитьОбласть("Сформировано|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьСформированоЦена",			Макет.ПолучитьОбласть("Сформировано|Цена"));
	
	СтруктураОбластей.Вставить("ОбластьШапкаТаблицыНоменклатура",	Макет.ПолучитьОбласть("ШапкаТаблицы|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьШапкаТаблицыХарактеристика",	Макет.ПолучитьОбласть("ШапкаТаблицы|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьШапкаТаблицыЦена",			Макет.ПолучитьОбласть("ШапкаТаблицы|Цена"));
	
	СтруктураОбластей.Вставить("ОбластьЦеноваяГруппаНоменклатура",	Макет.ПолучитьОбласть("ЦеноваяГруппа|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьЦеноваяГруппаХарактеристика",Макет.ПолучитьОбласть("ЦеноваяГруппа|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьЦеноваяГруппаЦена",			Макет.ПолучитьОбласть("ЦеноваяГруппа|Цена"));
	
	СтруктураОбластей.Вставить("ОбластьДеталиНоменклатура",			Макет.ПолучитьОбласть("Детали|Номенклатура"));
	СтруктураОбластей.Вставить("ОбластьДеталиХарактеристика",		Макет.ПолучитьОбласть("Детали|Характеристика"));
	СтруктураОбластей.Вставить("ОбластьДеталиЦена",					Макет.ПолучитьОбласть("Детали|Цена"));
	
	Возврат СтруктураОбластей;
	
КонецФункции //ЗаполнитьСтруктуруОбластейМакета()

// Процедура формирования прайс-листа
//
Функция СформироватьПрайсЛист(МассивОбъектов, ОбъектыПечати)
	
	ИспользоватьИерархиюНоменклатуры = Константы.ПрайсЛистИспользоватьИерархиюНоменклатуры.Получить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПрайсЛист";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПрайсЛист";
	
	СтруктураОбластей = ЗаполнитьСтруктуруОбластейМакета(УправлениеПечатью.МакетПечатнойФормы("Справочник.Контрагенты.ПФ_MXL_ПрайсЛист"));
	
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	СтруктураПечати =
		Новый Структура("ТабличныйДокумент, СтруктураОбластей, Контрагент, ИспользоватьХарактеристики",
			ТабличныйДокумент,
			СтруктураОбластей,
			МассивОбъектов,
			ИспользоватьХарактеристики);
			
	// Заполним прайс-лист по секциям
	ЗаполнитьЗаголовокПрайсЛиста("Заголовок", СтруктураПечати);
	ЗаполнитьОтправителяПрайсЛиста(СтруктураПечати); // секция определяется динамически
	ЗаполнитьСформированоПрайсЛиста("Сформировано", СтруктураПечати);
	ЗаполнитьШапкуПрайсЛиста("ШапкаТаблицы", СтруктураПечати);
	
	Если ИспользоватьИерархиюНоменклатуры Тогда
		
		ВыбратьДанныеПрайсЛистаИерархияНоменклатуры(СтруктураПечати); // Вывод областей "Группа номенклатуры" и "Детали"
		
	Иначе
		
		ЗаполнитьДеталиПрайсЛистаЦеноваяГруппа(СтруктураПечати); // Вывод областей "ЦеноваяГруппа" и "Детали"
		
	КонецЕсли;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, МассивОбъектов.Ссылка);
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПрайсЛист()

// Функция вызывает процедуру печати прайс-листа для контрагента
// 
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	Возврат СформироватьПрайсЛист(МассивОбъектов[0], ОбъектыПечати);
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//	ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//	МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//	ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//	КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//	ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПрайсЛист") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПрайсЛист", НСтр("ru = 'Прайс-лист'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	// Заполним получателей прайс-листа
	Получатели = Новый СписокЗначений;
	Получатели.Добавить(МассивОбъектов[0]);
	
	МассивПолучателей = Новый Массив;
	МассивПолучателей.Добавить(МассивОбъектов[0]);
	
	ПараметрыВывода.ПараметрыОтправки.Получатель = Получатели;
	ПараметрыВывода.ПараметрыОтправки.Тема = "Прайс-лист """ + ПолучитьОрганизациюПоУмолчанию(МассивОбъектов[0]).Наименование + """ от " + ТекущаяДатаСеанса() + ". Сформировал " + Пользователи.АвторизованныйПользователь() + ".";
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивПолучателей, 
		КоллекцияПечатныхФорм);
	
	ПечатьПоШаблонуПечатиОфисногоДокумента(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры // Печать()

Процедура ПечатьПоШаблонуПечатиОфисногоДокумента(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если ПараметрыПечати.Свойство("ШаблонПечатиОфисныхДокументов") И ЗначениеЗаполнено(ПараметрыПечати.ШаблонПечатиОфисныхДокументов) Тогда
		Для каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
			Если СтрНачинаетсяС(ПечатнаяФорма.ИмяВРЕГ, ВРег("ПечатьПоШаблонуОфисногоДокумента")) Тогда
				ПечатнаяФорма.ОфисныеДокументы = СформироватьОфисныеДокументыПоШаблонуПечатиОфисныхДокументов(МассивОбъектов, ПараметрыПечати.ШаблонПечатиОфисныхДокументов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьОфисныеДокументыПоШаблонуПечатиОфисныхДокументов(МассивОбъектов, ШаблонПечати)
	
	ОфисныеДокументы = Новый Соответствие;
	
	Для каждого ОбъектПечати Из МассивОбъектов Цикл
		ДанныеФайла = ШаблоныПечатиОфисныхДокументов.СФормироватьДокумент(ОбъектПечати, ШаблонПечати, Новый УникальныйИдентификатор);
		ОфисныеДокументы.Вставить(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ДанныеФайла.ИмяФайла);
	КонецЦикла;
	
	Возврат ОфисныеДокументы;
	
КонецФункции

// Заполняет список команд печати Заказа покупателя
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КонтактнаяИнформация";
	КомандаПечати.Представление = НСтр("ru = 'Контактная информация'");
	КомандаПечати.Порядок = 1;
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьКонтактнойИнформации";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Конверт";
	КомандаПечати.Представление = НСтр("ru = 'Конверт'");
	КомандаПечати.Обработчик = "ПечатьДокументовУНФКлиент.ПечатьКонверта";
	КомандаПечати.Порядок = 4;
	
	ШаблоныПечатиОфисныхДокументов.ДобавитьКомандыПечати(
	Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента,
	КомандыПечати, "ФормаЭлемента,ФормаСписка", "КомандыПечатиДоговорКонтрагента", 99);
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.//
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	Возврат;
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электронной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область КонтактнаяИнформацияУНФ

Процедура ЗаполнитьДанныеПанелиКонтактнаяИнформация(ВладелецКИ, ДанныеПанелиКонтактнойИнформации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	МАКСИМУМ(КонтактнаяИнформация.ДействуетС) КАК ДействуетС
	|ПОМЕСТИТЬ ВТ_АктуальнаяКИ
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтактнаяИнформация.Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Значение КАК Значение,
	|	КонтактнаяИнформация.ДействуетС КАК ДействуетС
	|ИЗ
	|	ВТ_АктуальнаяКИ КАК ВТ_АктуальнаяКИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ВТ_АктуальнаяКИ.Вид = КонтактнаяИнформация.Вид
	|			И ВТ_АктуальнаяКИ.ДействуетС = КонтактнаяИнформация.ДействуетС
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", ВладелецКИ);
	ДанныеКИ = Запрос.Выполнить().Выбрать();
	
	Пока ДанныеКИ.Следующий() Цикл
		НоваяСтрока = Новый Структура;
		Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(ДанныеКИ.Значение);
		НоваяСтрока.Вставить("Отображение", Строка(ДанныеКИ.Вид) + ": " + ДанныеКИ.Представление + ?(ПустаяСтрока(Комментарий), "", ", " + Комментарий));
		НоваяСтрока.Вставить("ИндексПиктограммы", КонтактнаяИнформацияПанельУНФ.ИндексПиктограммыПоТипу(ДанныеКИ.Тип));
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "ЗначениеКИ");
		НоваяСтрока.Вставить("ВладелецКИ", ВладелецКИ);
		НоваяСтрока.Вставить("ПредставлениеКИ", ДанныеКИ.Представление);
		НоваяСтрока.Вставить("ТипКИ", ДанныеКИ.Тип);
		ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокТиповКИ.Тип КАК Тип,
		|	ПорядокТиповКИ.Порядок КАК Порядок
		|ПОМЕСТИТЬ втПорядокТиповКИ
		|ИЗ
		|	&ПорядокТиповКИ КАК ПорядокТиповКИ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязиКонтрагентКонтакт.Контакт КАК Контакт,
		|	СвязиКонтрагентКонтакт.Должность КАК Должность
		|ПОМЕСТИТЬ ВТ_СвязиКонтактКонтрагент
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Контрагент = &Владелец) КАК СвязиКонтрагентКонтакт
		|ГДЕ
		|	СвязиКонтрагентКонтакт.СвязьНедействительна = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Ссылка КАК КонтактноеЛицо,
		|	КонтактныеЛица.Наименование КАК Наименование,
		|	СвязиКонтрагентКонтакт.Должность КАК Должность,
		|	ВЫБОР
		|		КОГДА КонтактныеЛица.Ссылка = &ОсновноеКонтактноеЛицо
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПорядокКонтактов
		|ПОМЕСТИТЬ втКонтакты
		|ИЗ
		|	ВТ_СвязиКонтактКонтрагент КАК СвязиКонтрагентКонтакт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
		|		ПО СвязиКонтрагентКонтакт.Контакт = КонтактныеЛица.Ссылка
		|ГДЕ
		|	КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
		|	И КонтактныеЛица.Недействителен = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтакты.КонтактноеЛицо КАК КонтактноеЛицо,
		|	втКонтакты.Наименование КАК Наименование,
		|	втКонтакты.Должность КАК Должность
		|ИЗ
		|	втКонтакты КАК втКонтакты
		|
		|УПОРЯДОЧИТЬ ПО
		|	втКонтакты.ПорядокКонтактов,
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК КонтактноеЛицо,
		|	КонтактныеЛицаКонтактнаяИнформация.Тип КАК Тип,
		|	КонтактныеЛицаКонтактнаяИнформация.Вид КАК Вид,
		|	КонтактныеЛицаКонтактнаяИнформация.Представление КАК Представление,
		|	КонтактныеЛицаКонтактнаяИнформация.Значение КАК Значение,
		|	ПРЕДСТАВЛЕНИЕ(КонтактныеЛицаКонтактнаяИнформация.Вид) КАК ПредставлениеВидаКИ
		|ИЗ
		|	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТиповКИ КАК втПорядокТиповКИ
		|		ПО КонтактныеЛицаКонтактнаяИнформация.Тип = втПорядокТиповКИ.Тип
		|ГДЕ
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				втКонтакты.КонтактноеЛицо
		|			ИЗ
		|				втКонтакты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	втПорядокТиповКИ.Порядок,
		|	КонтактныеЛицаКонтактнаяИнформация.Вид.Наименование";
	
	Запрос.УстановитьПараметр("Владелец", ВладелецКИ);
	Запрос.УстановитьПараметр("ОсновноеКонтактноеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКИ, "КонтактноеЛицо"));
	Запрос.УстановитьПараметр("ПорядокТиповКИ", КонтактнаяИнформацияУНФ.ПорядокТиповКИ());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаКонтакты = МассивРезультатов[3].Выбрать();
	ВыборкаКонтактнаяИнформация = МассивРезультатов[4].Выбрать();
	ОтборКИ = Новый Структура("КонтактноеЛицо");
	
	Пока ВыборкаКонтакты.Следующий() Цикл
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Отображение", Строка(ВыборкаКонтакты.КонтактноеЛицо));
		НоваяСтрока.Вставить("ИндексПиктограммы", -1);
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "КонтактноеЛицо");
		НоваяСтрока.Вставить("ВладелецКИ", ВыборкаКонтакты.КонтактноеЛицо);
		ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
		
		ВыборкаКонтактнаяИнформация.Сбросить();
		ОтборКИ.КонтактноеЛицо = ВыборкаКонтакты.КонтактноеЛицо;
		
		Пока ВыборкаКонтактнаяИнформация.НайтиСледующий(ОтборКИ) Цикл
			
			НоваяСтрока = Новый Структура;
			Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(ВыборкаКонтактнаяИнформация.Значение);
			НоваяСтрока.Вставить("Отображение", Строка(ВыборкаКонтактнаяИнформация.Вид) + ": " +ВыборкаКонтактнаяИнформация.Представление + ?(ПустаяСтрока(Комментарий), "", ", " + Комментарий));
			НоваяСтрока.Вставить("ИндексПиктограммы", КонтактнаяИнформацияПанельУНФ.ИндексПиктограммыПоТипу(ВыборкаКонтактнаяИнформация.Тип));
			НоваяСтрока.Вставить("ТипОтображаемыхДанных", "ЗначениеКИ");
			НоваяСтрока.Вставить("ВладелецКИ", ВыборкаКонтакты.КонтактноеЛицо);
			НоваяСтрока.Вставить("ПредставлениеКИ", ВыборкаКонтактнаяИнформация.Представление);
			НоваяСтрока.Вставить("ТипКИ", ВыборкаКонтактнаяИнформация.Тип);
			ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Головной = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКИ, "ГоловнойКонтрагент");
	Если НЕ ЗначениеЗаполнено(Головной) Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Новый Структура;
	НоваяСтрока.Вставить("Отображение", СтрШаблон(НСтр("ru = 'Головной: %1'"), Строка(Головной)));
	НоваяСтрока.Вставить("ИндексПиктограммы", 0);
	НоваяСтрока.Вставить("ТипОтображаемыхДанных", "ГоловнойКонтрагент");
	НоваяСтрока.Вставить("ВладелецКИ", Головной);
	НоваяСтрока.Вставить("СписокПодразделенийГоловногоКонтрагента", СписокПодразделенийГоловногоКонтрагента(Головной, ВладелецКИ));
	ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Значение КАК Значение
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Головной";
	
	Запрос.УстановитьПараметр("Головной", Головной);
	ДанныеКИ = Запрос.Выполнить().Выбрать();
	
	Пока ДанныеКИ.Следующий() Цикл
		НоваяСтрока = Новый Структура;
		Комментарий = УправлениеКонтактнойИнформацией.КомментарийКонтактнойИнформации(ДанныеКИ.Значение);
		НоваяСтрока.Вставить("Отображение", Строка(ДанныеКИ.Вид) + ": " + ДанныеКИ.Представление + ?(ПустаяСтрока(Комментарий), "", ", " + Комментарий));
		НоваяСтрока.Вставить("ИндексПиктограммы", КонтактнаяИнформацияПанельУНФ.ИндексПиктограммыПоТипу(ДанныеКИ.Тип));
		НоваяСтрока.Вставить("ТипОтображаемыхДанных", "ЗначениеКИ");
		НоваяСтрока.Вставить("ВладелецКИ", Головной);
		НоваяСтрока.Вставить("ПредставлениеКИ", ДанныеКИ.Представление);
		НоваяСтрока.Вставить("ТипКИ", ДанныеКИ.Тип);
		ДанныеПанелиКонтактнойИнформации.Добавить(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли