export const readIntegrationServiceYAML = `Синоним: Синоним
Комментарий: Комментарий
АдресВнешнегоСервисаИнтеграции: https://example-service.com
Каналы:
  КаналСервисаИнтеграцииВсеСвойства:
    Синоним: Синоним
    Комментарий: Комментарий
    ИмяКаналаВнешнегоСервисаИнтеграции: ИмяКанала
    НаправлениеСообщения: Получение
    ОбработкаПолученияСообщения: КаналСервисаИнтеграцииВсеСвойстваОбработкаПолученияСообщения
    Транзакционный: Ложь
  КаналСервисаИнтеграцииПоУмолчанию:
    Синоним: Канал сервиса интеграции по умолчанию`
