export const readSubsystemYAML = `Синоним: Синоним
Комментарий: Комментарий
ВключатьСправкуВСодержание: Ложь
ВключатьВКомандныйИнтерфейс: Ложь
ИспользоватьОднуКоманду: Истина
Пояснение: Пояснение
Картинка: КонструкторЗапросаЗаменитьТаблицу
Состав:
  - Документ.ДокументВсеСвойства
  - Документ.ДокументПоУмолчанию
  - НумераторДокументов.НумераторДокументовВсеСвойства
  - Документ.ДокументДругойДляЖурнала
  - ЖурналДокументов.ЖурналДокументовПоУмолчанию
  - РегистрСведений.РегистрСведенийПоУмолчанию
  - ПланВидовХарактеристик.ПланВидовХарактеристикПоУмолчанию
  - ПланВидовХарактеристик.ПланВидовХарактеристикВсеСвойства
  - Справочник.ЗначенияХарактеристик
Подсистемы:
  - ПодчиненнаяПодсистема
`
