export const readEnumerationYAML = `Синоним: Синоним
Комментарий: Комментарий
ИспользоватьСтандартныеКоманды: Истина
СтандартныеРеквизиты:
  Порядок:
    Синоним: Другой синоним порядок
  Ссылка:
    Синоним: Другой синоним
Характеристики:
  - ВидыХарактеристик: ChartOfCharacteristicTypes.ХарактеристикиОбъектов
    ЗначенияХарактеристик: Catalog.СправочникПолный
    ПолеКлюча: ChartOfCharacteristicTypes.ХарактеристикиОбъектов.StandardAttribute.Ref
    ПолеОбъекта: Catalog.СправочникПолный.Attribute.Реквизит1
    ПолеВида: Catalog.СправочникПолный.Attribute.Реквизит1
    ПолеПутиКДанным: ChartOfCharacteristicTypes.ХарактеристикиОбъектов.StandardAttribute.Ref
БыстрыйВыбор: Ложь
ОсновнаяФормаСписка: Enum.ПеречислениеВсеСвойства.Form.ФормаСписка
ОсновнаяФормаДляВыбора: Enum.ПеречислениеВсеСвойства.Form.ФормаВыбора
ПредставлениеСписка: Представление списка
РасширенноеПредставлениеСписка: Расширенное представление списка
Пояснение: |
  Пояснение
ИсторияВыбораПриВводе: НеИспользовать
Значения:
  ЗначениеПеречисления1:
    Синоним: Синоним
    Комментарий: Комментарий
  ЗначениеПеречисления2:
    Синоним: Синоним 2
    Комментарий: Комментарий 2
Команды:
  Команда1:
    Группа: ПанельНавигацииВажное
    Синоним: Синоним команды
`
