export const readConstantYAML = `Синоним: Синоним
Комментарий: Комментарий
Тип: Строка(10)
ИспользоватьСтандартныеКоманды: Ложь
ОсновнаяФорма: CommonForm.КонстантаВсеСвойства
РасширенноеПредставление: Расширенное представление
Пояснение: Пояснение
РежимПароля: Истина
Формат: ЧЦ=15; ЧДЦ=2
ФорматРедактирования: ЧЦ=15; ЧДЦ=2
Подсказка: Подсказка
ВыделятьОтрицательные: Истина
Маска: Маска
МногострочныйРежим: Истина
РасширенноеРедактирование: Истина
МинимальноеЗначение: 5
МаксимальноеЗначение: 90
ПроверкаЗаполнения: ВыдаватьОшибку
СвязьПоТипу: Константа.КонстантаБулево
ИсторияВыбораПриВводе: НеИспользовать
РежимУправленияБлокировкойДанных: Автоматический
ИсторияДанных: Использовать
ОбновлятьИсториюДанныхСразуПослеЗаписи: Истина
ВыполнятьОбработкуПослеЗаписиВерсииИсторииДанных: Истина`
