
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("КонтрагентыНачальноеЗначение", ПараметрКоманды);
	Если ПараметрКоманды.Количество() > 0 Тогда
		КлючУникальности = Строка(ПараметрКоманды[0]);
	Иначе
		КлючУникальности = ПараметрыВыполненияКоманды.Уникальность;
	КонецЕсли;
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаКонтактнойИнформации", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, КлючУникальности, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
