
#Область ОписаниеПеременных

#Область ПеременныеМодуля

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткрытаИзБыстрогоСоздания = Параметры.Свойство("БыстроеСоздание");
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ПараметрыКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ПараметрыКонтактнойИнформации.ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	
	ПараметрыКонтактнойИнформации.РазрешитьДобавлениеПолей = Ложь;
	
	ВидыКоторыеНужноОставить = Новый Массив;
	
	ВидыКоторыеНужноОставить.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	ВидыКоторыеНужноОставить.Добавить(Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
	ВидыКоторыеНужноОставить.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	
	ПараметрыКонтактнойИнформации.СкрываемыеВиды = УправлениеКонтактнойИнформациейУНФ.СкрываемыеВидыКонтактнойИнформацииДляПростойФормыКонтрагента(ВидыКоторыеНужноОставить);
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ПараметрыКонтактнойИнформации);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	ЗаполнитьКонтактнуюИнформацию();
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереКонтрагент(ЭтотОбъект, Параметры);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	ТекущийЭлемент = Элементы.НаименованиеПолное;
	
	Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Банки");
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.ЗначенияЗаполнения.Свойство("ИНН") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ИНН) Тогда
			ЗаполнитьРеквизитыПоИНННаСервере(Параметры.ЗначенияЗаполнения.ИНН);
		КонецЕсли;
		
		Объект.Наименование = Объект.НаименованиеПолное;
		Если Параметры.ЗначенияЗаполнения.Свойство("ВидКонтрагента") Тогда
			Объект.ВидКонтрагента = Параметры.ЗначенияЗаполнения.ВидКонтрагента;
		Иначе
			Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
				Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
			КонецЕсли;
		КонецЕсли;
		
		Параметры.ЗначенияЗаполнения.Свойство("ВидОперацииДокумента", ВидОперацииДокумента);
				
		// Этот фрагмент должен быть до ПриСозданииПриЧтенииНаСервере
		// Создание из документа с установленным признаком вид операции.
		Если Параметры.ДополнительныеПараметры.Свойство("ВидОперации") Тогда
			
			Если Параметры.ДополнительныеПараметры.Свойство("ВыплатыСамозанятым") Тогда
				
				Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
				Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
				Объект.Самозанятый = Истина;
				Объект.ПрочиеОтношения = Истина;
				
			ИначеЕсли Не ТипЗнч(Параметры.ДополнительныеПараметры.ВидОперации) = Тип("Строка") Тогда
				Отношения = КлассификацияКонтактов.ТипОтношенийСКонтрагентомПоВидуОперации(Параметры.ДополнительныеПараметры.ВидОперации);
				ЗаполнитьЗначенияСвойств(Объект, Отношения, "Покупатель,Поставщик,ПрочиеОтношения");
			КонецЕсли;
			
			ВидОперацииДокумента = Параметры.ДополнительныеПараметры.ВидОперации;
			
		ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("ЧекККМ") Тогда
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
			Объект.Покупатель = Истина;
		ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("ВыплатыСамозанятым") Тогда
			Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
			Объект.Самозанятый = Истина;
			Объект.ПрочиеОтношения = Истина;
		КонецЕсли;
		// Этот фрагмент должен быть до ПриСозданииПриЧтенииНаСервере
		
		ПриСозданииПриЧтенииНаСервере();
		
		Если Не ПустаяСтрока(Параметры.ТекстЗаполнения) Тогда
			ЗаполнитьРеквизитыПоТекстуЗаполнения(Параметры.ТекстЗаполнения);
		КонецЕсли;
		
		Если Параметры.Свойство("ЭтоКомиссия") Тогда
			ВидОперацииКомиссия = Истина;
			Объект.Покупатель = Истина;
			Объект.Наименование = Параметры.Наименование;
		КонецЕсли;
		
		// Взаиморасчеты
		Если Параметры.ЗначениеКопирования.Пустая() Тогда
			ЗначениеРеквизитовПоУмолчаниюДляНовогоКонтрагента = РасчетыРаботаСФормамиВызовСервера.
				ПолучитьЗначенияРеквизитовПоУмолчаниюДляНовогоКонтрагента();
			ЗаполнитьЗначенияСвойств(Объект, ЗначениеРеквизитовПоУмолчаниюДляНовогоКонтрагента);
		КонецЕсли;
		
		// Форма открыта для создания нового элемента, ссылку на который планируется использовать в дальнейшем, после записи, в вызывающей форме.
		Параметры.Свойство("НеобходимоОповеститьОЗаписиНового", НеобходимоОповеститьОЗаписиНового);
		
	КонецЕсли;
	
	ЦветТекстаНекорректногоКонтрагента = ЦветаСтиля.ЦветТекстаНекорректногоКонтрагента;
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылки;
	
	Если Параметры.Свойство("ПоказыватьБанковскийСчет") Тогда
		Элементы.ГруппаБанковскиеРеквизиты.Видимость = Параметры.ПоказыватьБанковскийСчет;
	Иначе
		Элементы.ГруппаБанковскиеРеквизиты.Видимость = Ложь;
	КонецЕсли;
	
	// Настройка видимости элементов при открытии из формы списка
	Элементы.КолонкаСправа.Видимость = НЕ ОткрытаИзБыстрогоСоздания;
	Элементы.ВидПолеВыбора.Видимость = НЕ ОткрытаИзБыстрогоСоздания;
	Элементы.ФормаЗаписать.Видимость = НЕ ОткрытаИзБыстрогоСоздания;
	Элементы.Подменю1СПАРКРиски.Видимость = НЕ ОткрытаИзБыстрогоСоздания;
	Элементы.ГруппаИндексыСПАРКРиски.Видимость = НЕ ОткрытаИзБыстрогоСоздания;
	Элементы.Комментарий.Видимость = НЕ ОткрытаИзБыстрогоСоздания;
	Элементы.ДекорацияПоказатьВсеРеквизиты.Видимость = ОткрытаИзБыстрогоСоздания 
							И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюФормуКонтрагентов");
	Элементы.Вид.Видимость = ОткрытаИзБыстрогоСоздания;
	
	ВыполнитьВсеПроверки(ЭтотОбъект);
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	
	СПАРКРискиПриСозданииНаСервере();
	
	УстановитьНастройкиКонтроляДублей();
	
	Если ОткрытаИзБыстрогоСоздания Тогда
		УдалитьЭлементыКомандКонтактнойИнформации(Элементы.КонтактнаяИнформация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		СПАРКРискиКлиент.ПриОткрытии(ЭтотОбъект, Объект);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	КонецСтроки = СтрДлина(Объект.НаименованиеПолное) + 1;
	Элементы.НаименованиеПолное.УстановитьГраницыВыделения(КонецСтроки, КонецСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если КонтрагентЗамененНаДубль ИЛИ НеобходимоОповеститьОЗаписиНового Тогда
		ОповеститьОЗаписиНового(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		СПАРКРискиКлиент.ОбработкаОповещения(ЭтотОбъект, Объект, ИмяСобытия, Параметр, Источник);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, ИмяЭлементаДляРазмещения);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииПриЧтенииНаСервере();
	ЗаполнитьДополнительныеРеквизитыВзаиморасчетов();
	ПрочитатьБанковскийСчетПоУмолчанию(ТекущийОбъект.БанковскийСчетПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Элементы.ДублиНаименованиеПолное.Видимость Тогда
		ПоказатьПредупреждениеОДублях();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ОценкаПроизводительности
	ОценкаПроизводительностиКлиент.ЗамерВремени("СправочникКонтрагентыЗапись");
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// Заполним основной банковский счет
	УстановитьБанковскийСчетПоУмолчанию(ТекущийОбъект);
	
	Если ПроигнорированоСообщениеОДублях Тогда 
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоЗаписьДубля");
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СообщениеОДублированииИнформации", СообщениеОДублированииИнформации);
	КонецЕсли;
	
	ПроигнорированоСообщениеОДублях = Ложь;
	СообщениеОДублированииИнформации = "";

	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	// Конец Обсуждения

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзФормыЭлементаКонтрагента", Истина);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВидОперацииКомиссия", ВидОперацииКомиссия);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВидОперации", ВидОперацииДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИзменилиБанковскийСчет Тогда
		ЗаписатьБанковскийСчетПоУмолчанию(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		СПАРКРиски.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	УстановитьЗаголовокФормы(ЭтотОбъект);
	Оповестить("Запись_Контрагент", Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	ИзменилиБанковскийСчет = Истина;
	ЯвляетсяБанкомРФ = ЯвляетсяБанкомРФ(ОсновнойСчет_Банк);
	УстановитьМаскуНомераСчета();
	ДинамическиеПараметры = Новый Массив;
	Если ЗначениеЗаполнено(ОсновнойСчет_Номер) Тогда
		ДинамическиеПараметры.Добавить(СтрШаблон(НСтр("ru = '%1  в %2 (основной)'"), ОсновнойСчет_Номер, ОсновнойСчет_Банк));
	Иначе
		ДинамическиеПараметры.Добавить(СтрШаблон(НСтр("ru = '<номер счета> в %2 (основной)'"), 
			ОсновнойСчет_Номер, 
			ОсновнойСчет_Банк));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БанкНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Банки.ФормаВыбора", , Элемент);

КонецПроцедуры

&НаКлиенте
Процедура БанкОчистка(Элемент, СтандартнаяОбработка)

	Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Банки");

КонецПроцедуры

&НаКлиенте
Процедура БанкСоздание(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Банки.ФормаОбъекта", , Элемент);

КонецПроцедуры

&НаКлиенте
Процедура БанкОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранноеЗначение = "ЗагрузитьКлассификатор" Тогда
		СтандартнаяОбработка = Ложь;
		РаботаСБанкамиКлиент.ОткрытьФормуЗагрузкиКлассификатора();
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.КлассификаторБанков") Тогда
		Возврат;
	КонецЕсли;

	НайденныйБанк = БанкиУНФВызовСервера.СсылкаНаБанкИзКлассификатора(ВыбранноеЗначение);
	Если ЗначениеЗаполнено(НайденныйБанк) Тогда
		ВыбранноеЗначение = НайденныйБанк;
	Иначе
		Элементы.Банк.ОграничениеТипа = Новый ОписаниеТипов;
	КонецЕсли;
	ИзменилиБанковскийСчет = Истина;

КонецПроцедуры

&НаКлиенте
Процедура БанкАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	ДанныеВыбора = БанкиУНФВызовСервера.БанкАвтоПодборДанныеВыбора(Текст);

КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	ИзменилиБанковскийСчет = Истина;
	ДинамическиеПараметры = Новый Массив;
	ДинамическиеПараметры.Добавить(СтрШаблон(НСтр("ru = '%1  в %2 (основной)'"), ОсновнойСчет_Номер, ОсновнойСчет_Банк));
КонецПроцедуры

&НаКлиенте
Процедура КППНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТекущийКПП, ИсторияКПП, ТолькоПросмотр", 
					Объект.КПП, Объект.ИсторияКПП, ТолькоПросмотр);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.РедактированиеИсторииКПП", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПроверкиДанныхОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "ПоказатьДубли") > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИНН", СокрЛП(Объект.ИНН));
		ПараметрыФормы.Вставить("КПП", СокрЛП(Объект.КПП));
		ПараметрыФормы.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
		ПараметрыФормы.Вставить("ИсключаяКонтакты", Новый Массив);
		ПараметрыФормы.Вставить("ЭтоЮрЛицо", ЭтоЮрЛицо(Объект.ВидКонтрагента));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыФормы, Элемент,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТекущееНаименованиеПолное, ИсторияНаименований, ТолькоПросмотр", 
					Объект.НаименованиеПолное, Объект.ИсторияНаименований, ТолькоПросмотр);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.РедактированиеИсторииНаименований", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	
	Объект.НаименованиеПолное = СтрЗаменить(Объект.НаименованиеПолное, Символы.ПС, " ");
	ПриИзмененииНаименованияКонтрагента();
		
	ОпределитьВидКонтрагента(ЭтотОбъект);
	УправлениеФормой();
	
	Если НЕ ПроверятьЮрНазваниеНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.НаименованиеПолное)) Тогда
		Элементы.ДублиНаименованиеПолное.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ПроверитьНаДубли("НаименованиеПолное");

КонецПроцедуры
&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	СформироватьПредставлениеПроверкиИНН(ЭтотОбъект);
	
	Если Объект.ИННВведенКорректно И ПустаяСтрока(Объект.КПП) И Элементы.КПП.Видимость Тогда
		РаботаСКонтрагентамиУНФКлиент.ЗаполнитьКПППоИНН(Объект.ИНН, Объект.КПП);
	КонецЕсли;
	
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
	Если Не ПустаяСтрока(Объект.ИНН) И Объект.ИННВведенКорректно И Не КлючевыеРеквизитыЗаполнены(ЭтотОбъект) Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН(Объект.ИНН);
	КонецЕсли;
	
	Если ИспользоватьСпаркРиски Тогда
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		ЭтотОбъект.ИндексыСПАРКРиски = Неопределено;
		ОбновитьОтображениеИндексыСПАРК();
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура КПППриИзменении(Элемент)
	
	СформироватьПредставлениеПроверкиКПП(ЭтотОбъект);
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ДублиПоПолномуНаименованиюНажатие(Элемент)
	
	ПараметрыДублей = Новый Структура;	
	МассивКонтактов = Новый Массив;
	
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("НаименованиеПолное", НаименованиеПолноеДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИндексыСПАРКРискиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент,
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПолеВыбораПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГР(Команда)
	
	Если Не ПустаяСтрока(Объект.ИНН) И Объект.ИННВведенКорректно Тогда
	// Выполняем заполнение по ИНН без открытия вспомогательной формы
		
		Если КлючевыеРеквизитыЗаполнены(ЭтотОбъект) Тогда
			ТекстВопроса = НСтр("ru='Перезаполнить текущие реквизиты?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПерезаполнитьРеквизитыПоИННЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполнитьЗаполнениеРеквизитовПоИНН(Объект.ИНН);
		КонецЕсли;
		
	Иначе
	// Открываем форму заполнения реквизитов
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СтрокаПоиска", ?(ПустаяСтрока(Объект.НаименованиеПолное), Объект.ИНН, Объект.НаименованиеПолное));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнениеРеквизитовКонтрагентВыбран", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ЗаполнениеРеквизитовКонтрагента", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрагентаНаДубли(Команда)
	
	Состояние(НСтр("ru='Проверка контрагента на дубли'"), 49);
	ПроверитьКонтрагентаНаДублиСервер();
	Состояние(НСтр("ru='Проверка контрагента на дубли'"), 100);
	
	ПоказатьСообщениеОДублях();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиБиблиотек

// ИнтернетПоддержкаПользователей.СПАРКРиски
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеИндексыСПАРК()
	ОбновитьОтображениеИндексыСПАРК();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИндексыСПАРК()
	ПараметрыОтображения = Новый Структура("ВариантОтображения", "Многострочный");
	ВидКонтрагентаСПАРКРиски = СПАРКРискиКлиентСерверУНФ.ВидКонтрагентаСПАРКРиски(Объект.ВидКонтрагента);
	СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
		ЭтотОбъект.ИндексыСПАРКРиски,
		Объект,
		Объект.ИНН,
		ВидКонтрагентаСПАРКРиски,
		ЭтотОбъект,
		ПараметрыОтображения);
КонецПроцедуры

&НаСервере
Процедура СПАРКРискиПриСозданииНаСервере()
	
	ИспользоватьСпаркРиски = ПолучитьФункциональнуюОпцию("ИспользоватьСервисСПАРКРиски");
	Элементы.ГруппаИндексыСПАРКРиски.Видимость = ИспользоватьСпаркРиски;
	
	Если ИспользоватьСпаркРиски Тогда
		
		// ИнтернетПоддержкаПользователей.СПАРКРиски
		ПараметрыПроцедуры = Новый Структура("ВариантОтображения", "Многострочный");
		ВидКонтрагентаСПАРКРиски = СПАРКРискиКлиентСерверУНФ.ВидКонтрагентаСПАРКРиски(Объект.ВидКонтрагента);
		СПАРКРиски.ПриСозданииНаСервере(
			ЭтотОбъект,
			Объект,
			Объект.Ссылка,
			ВидКонтрагентаСПАРКРиски,
			ПараметрыПроцедуры);
		// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
		
		// Команды1СПАРКРиски
		СПАРКРиски.ДобавитьПодключаемыеКомандыКонтрагента(ЭтотОбъект, Объект, Элементы.Подменю1СПАРКРиски);
		// Конец Команды1СПАРКРиски
		
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

// Команды1СПАРКРиски
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду1СПАРКРиски(Команда)
	СПАРКРискиКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец Команды1СПАРКРиски

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
&НаКлиенте
Процедура ПроверитьКонтрагента(Команда)
	УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
	ПроверкаКонтрагентовКлиент.ПроверитьКонтрагентаПоКнопке(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВСправочнике(ЭтотОбъект);
КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры
&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	Если Результат.Свойство("ИмяЭлементаДляРазмещения") Тогда
		ИмяЭлементаДляРазмещения = Результат.ИмяЭлементаДляРазмещения;
	Иначе
		ОписаниеКИ = УправлениеКонтактнойИнформациейУНФКлиентСервер.ОписаниеРеквизитаКонтактнойИнформации(ЭтотОбъект, Результат.ИмяРеквизита);
		ИмяЭлементаДляРазмещения = ОписаниеКИ.ИмяЭлементаДляРазмещения;
	КонецЕсли;
	Результат.Вставить("ПостфиксИмяРеквизита", ИмяЭлементаДляРазмещения);
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	УправлениеКонтактнойИнформациейУНФ.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, НастройкиПереопределенияКонтактнойИнформации(), Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти

#Область КонтактнаяИнформацияУНФ

&НаСервере
Функция НастройкиПереопределенияКонтактнойИнформации()
	
	НастройкиПереопределения = УправлениеКонтактнойИнформациейУНФ.НастройкиПереопределения();
	НастройкиПереопределения.ИспользоватьСтандартнуюШирину = Ложь;
	Возврат НастройкиПереопределения;
	
КонецФункции

&НаСервере
Процедура ПеренестиКонтактнуюИнформациюИзРеквизитов()
	
	КонтактнаяИнформация = НоваяКонтактнаяИнформация();
	
	ГруппаВидовКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации["СправочникКонтрагенты"];
	
	Для Каждого СтрокаТаблицы Из УправлениеКонтактнойИнформациейКлиентСервер.ОписаниеКонтактнойИнформацииНаФорме(ЭтотОбъект) Цикл
		
		ИмяРеквизита  = СтрокаТаблицы.ИмяРеквизита;
		
		Элемент = Элементы.Найти(ИмяРеквизита);
		Если Элемент <> Неопределено Тогда
			Если Элемент.Вид = ВидПоляФормы.ПолеНадписи И Элемент.Гиперссылка Тогда
				Если ПустаяСтрока(СтрокаТаблицы.Представление)
					ИЛИ СтрокаТаблицы.Представление = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки() Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		УправлениеКонтактнойИнформацией.ВосстановитьПустыеЗначениеПредставление(СтрокаТаблицы);
		
		Если СтрокаТаблицы.Вид.Родитель <> ГруппаВидовКонтактнойИнформации Тогда
			Продолжить;
		КонецЕсли;
		
		ПеренестиЗаписьКонтактнойИнформацииИзФормыВТаблицу(КонтактнаяИнформация, СтрокаТаблицы, СтрокаТаблицы.Значение);
		
	КонецЦикла;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(Объект, КонтактнаяИнформация);
	
КонецПроцедуры

&НаСервере
Функция НоваяКонтактнаяИнформация()
	
	КонтактнаяИнформация = Новый ТаблицаЗначений;
	ОписаниеТиповСтрока1500 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1500));
	
	КонтактнаяИнформация.Колонки.Добавить("Представление",                     ОписаниеТиповСтрока1500);
	КонтактнаяИнформация.Колонки.Добавить("ЗначенияПолей",                     Новый ОписаниеТипов("Строка"));
	КонтактнаяИнформация.Колонки.Добавить("Значение",                          Новый ОписаниеТипов("Строка"));
	КонтактнаяИнформация.Колонки.Добавить("Вид",                               Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"));
	КонтактнаяИнформация.Колонки.Добавить("Тип",                               Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"));
	КонтактнаяИнформация.Колонки.Добавить("Дата",                              Новый ОписаниеТипов("Дата"));
	КонтактнаяИнформация.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("Число"));
	
	Возврат КонтактнаяИнформация;
	
КонецФункции

&НаСервере
Процедура ПеренестиЗаписьКонтактнойИнформацииИзФормыВТаблицу(КонтактнаяИнформация, СтрокаТаблицы, Знач Значение)
	
	Если ПустаяСтрока(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(Значение) Тогда
		ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(Значение, СтрокаТаблицы.Тип);
	Иначе
		ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(Значение, СтрокаТаблицы.Тип);
	КонецЕсли;
	
	Если Не УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияЗаполнена(ОбъектКИ) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаКонтактнойИнформации = КонтактнаяИнформация.Добавить();
	
	ДействуетС = ?(СтрокаТаблицы.Свойство("ДействуетС"), СтрокаТаблицы.ДействуетС, Неопределено);
	ЗаполнитьЗначенияСвойств(СтрокаКонтактнойИнформации, СтрокаТаблицы, "Вид,Тип");
	
	СтрокаКонтактнойИнформации.Представление = ОбъектКИ.Value;
	СтрокаКонтактнойИнформации.Значение      = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ОбъектКИ);
	
	Если УправлениеКонтактнойИнформациейСлужебныйПовтИсп.ДоступенМодульЛокализации() Тогда
		МодульУправлениеКонтактнойИнформациейЛокализация = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформациейЛокализация");
		МодульУправлениеКонтактнойИнформациейЛокализация.ПриКонвертированииКонтактнуюИнформациюИзJSONВXML(ОбъектКИ, СтрокаКонтактнойИнформации.ЗначенияПолей, СтрокаТаблицы.Тип);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДействуетС) Тогда
		СтрокаКонтактнойИнформации.Дата    = ДействуетС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьЭлементыКомандКонтактнойИнформации(ГруппаКонтактнаяИнформация)
	
	Для Каждого ЭлементГруппы Из ГруппаКонтактнаяИнформация.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ЭлементГруппы) = Тип("ГруппаФормы") Тогда
			УдалитьЭлементыКомандКонтактнойИнформации(ЭлементГруппы);
		КонецЕсли;
		
		Если ТипЗнч(ЭлементГруппы) = Тип("КнопкаФормы") Тогда
			ЭлементГруппы.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область БанковскийСчетПоУмолчанию

&НаСервере
Процедура ПрочитатьБанковскийСчетПоУмолчанию(БанковскийСчетПоУмолчанию)

	Если ЗначениеЗаполнено(БанковскийСчетПоУмолчанию) Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БанковскийСчетПоУмолчанию, "Банк, НомерСчета");
		ОсновнойСчет_Банк = ЗначенияРеквизитов.Банк;
		ОсновнойСчет_Номер = ЗначенияРеквизитов.НомерСчета;
		ЯвляетсяБанкомРФ = ЯвляетсяБанкомРФ(ЗначенияРеквизитов.Банк);
		ИзменилиБанковскийСчет = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьБанковскийСчетПоУмолчанию(ТекущийОбъект)

	Если Не ЗначениеЗаполнено(ОсновнойСчет_Банк) Или ПустаяСтрока(ОсновнойСчет_Номер) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ОсновнойСчет_Банк) = Тип("СправочникСсылка.КлассификаторБанков") Тогда
		ОсновнойСчет_Банк = БанкиУНФ.БанкИзКлассификатора(ОсновнойСчет_Банк);
	КонецЕсли;

	Если ТекущийОбъект.ЭтоНовый() Тогда
	// Если организация новая, банковский счет надо создавать новый
		НадоСоздаватьНовый = Истина;
	Иначе
	// Для существующего контрагента, надо проверять наличие банковского счета с такими же ключевыми полями

		Запрос = Новый Запрос;
		Запрос.Текст = "
					   |ВЫБРАТЬ ПЕРВЫЕ 1
					   |	БанковскиеСчета.Ссылка
					   |ИЗ
					   |	Справочник.БанковскиеСчета КАК БанковскиеСчета
					   |ГДЕ
					   |	БанковскиеСчета.Владелец = &Владелец
					   |	И БанковскиеСчета.Банк = &Банк
					   |	И БанковскиеСчета.НомерСчета = &НомерСчета";

		Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("Банк", ОсновнойСчет_Банк);
		Запрос.УстановитьПараметр("НомерСчета", ОсновнойСчет_Номер);

		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);

		Если РезультатЗапроса.Пустой() Тогда
			// Нет банковского счета с такими ключевыми полями
			Если ЗначениеЗаполнено(ТекущийОбъект.БанковскийСчетПоУмолчанию) Тогда
				// Модифицируется существующий основной счет
				НадоСоздаватьНовый = Ложь;
			Иначе
				// Создается новый
				НадоСоздаватьНовый = Истина;
			КонецЕсли;
		Иначе
			// Банковский счет есть, устанавливаем его в качестве основного
			НадоСоздаватьНовый = Ложь;

			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ТекущийОбъект.БанковскийСчетПоУмолчанию = Выборка.Ссылка;
		КонецЕсли;

	КонецЕсли;

	Если НадоСоздаватьНовый Тогда
		ТекущийОбъект.БанковскийСчетПоУмолчанию = Справочники.БанковскиеСчета.ПолучитьСсылку();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьБанковскийСчетПоУмолчанию(ТекущийОбъект)

	Если Не ЗначениеЗаполнено(ОсновнойСчет_Банк) Или ПустаяСтрока(ОсновнойСчет_Номер) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	БанковскийСчетОбъект = ТекущийОбъект.БанковскийСчетПоУмолчанию.ПолучитьОбъект();

	Если БанковскийСчетОбъект = Неопределено Тогда
		
		// Создание
		БанковскийСчетОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
		БанковскийСчетОбъект.УстановитьСсылкуНового(ТекущийОбъект.БанковскийСчетПоУмолчанию);
		БанковскийСчетОбъект.Заполнить(ТекущийОбъект.Ссылка);

	Иначе

		БанковскийСчетОбъект.Заблокировать();

	КонецЕсли;
	
	// Внесение изменений
	БанковскийСчетОбъект.Банк = ОсновнойСчет_Банк;
	БанковскийСчетОбъект.НомерСчета = ОсновнойСчет_Номер;
	БанковскийСчетОбъект.СформироватьНаименование();
	
	// Запись объекта
	БанковскийСчетОбъект.Записать();

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

#Если Не ВебКлиент Тогда

	ТекущийТекстНомераСчета = СтрЗаменить(Текст, " ", "");

	Если ЯвляетсяБанкомРФ И ТекущийТекстНомераСчета <> Неопределено Тогда

		ДлинаСчетаРФ = 20;
		КоличествоЦифрВСчете = СтрДлина(ТекущийТекстНомераСчета);

		Если ДлинаСчетаРФ <> КоличествоЦифрВСчете Тогда
			ТекстСообщения = НСтр("ru = 'Осталось ввести %1'");
			СклоняемыйТекст = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
							НСтр("ru = ';%1 цифру;;%1 цифры;%1 цифр;%1 цифры'"), ДлинаСчетаРФ - КоличествоЦифрВСчете);

			ПодсказкаНомераСчета = СтрШаблон(ТекстСообщения, СклоняемыйТекст);
		Иначе
			ПодсказкаНомераСчета = "";
		КонецЕсли;

	Иначе
		ПодсказкаНомераСчета = "";
	КонецЕсли;

#КонецЕсли

	ИзменилиБанковскийСчет = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПоказатьВсеРеквизитыНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",     Истина);
	ПараметрыФормы.Вставить("ПереходИзБыстройФормы", Истина);
	
	ПеренестиКонтактнуюИнформациюИзРеквизитов();
	
	ПараметрыФормы.Вставить("КонтактнаяИнформация", Объект.КонтактнаяИнформация);
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("НаименованиеПолное", Объект.НаименованиеПолное);
	СтруктураЗаполнения.Вставить("Наименование", Объект.Наименование);
	СтруктураЗаполнения.Вставить("ИНН", Объект.ИНН);
	СтруктураЗаполнения.Вставить("КПП", Объект.КПП);
	СтруктураЗаполнения.Вставить("ВидКонтрагента", Объект.ВидКонтрагента);
	СтруктураЗаполнения.Вставить("Покупатель", Объект.Покупатель);
	СтруктураЗаполнения.Вставить("Поставщик", Объект.Поставщик);
	СтруктураЗаполнения.Вставить("ПрочиеОтношения", Объект.ПрочиеОтношения);
	
	СтруктураЗаполнения.Вставить("ОсновнойСчет_Банк", ОсновнойСчет_Банк);
	СтруктураЗаполнения.Вставить("ОсновнойСчет_Номер", ОсновнойСчет_Номер);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
		
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЯвляетсяБанкомРФ(Банк)
	
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Страна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Страна");
	Возврат (Страна = Справочники.СтраныМира.Россия);

КонецФункции

&НаКлиенте
Процедура УстановитьМаскуНомераСчета()

	Если ЯвляетсяБанкомРФ Тогда
		Элементы.НомерСчета.Маска 	= "99999999999999999999";
	Иначе
		Элементы.НомерСчета.Маска 	= "";
		ПодсказкаНомераСчета 		= "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	// 1. Инициализация реквизитов формы
	
	КлассификаторОПФ.Загрузить(РегламентированныеДанныеПовтИсп.КлассификаторОрганизационноПравовыхФорм());
	
	// Заполним список возможных кратких наименований и определим флаг автоматической смены краткого наименования
	
	ФормироватьНаименованиеАвтоматически = Истина;
	
	ЗаполнитьВидКонтрагента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидКонтрагента()

	Если Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		Если Объект.Самозанятый Тогда 
			Вид = "Самозанятый";
		Иначе
			Вид = "Физическое лицо";
		КонецЕсли;
	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель Тогда
		Вид = "Индивидуальный предприниматель";
	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган Тогда
		Вид = "Государственный орган";
	Иначе
		Вид = "Юридическое лицо";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	ЭтоЮридическоеЛицо = (Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо"));
	
	// Изменяем видимость реквизитов формы в зависимости от вида контрагента
	Если ЭтоЮридическоеЛицо Тогда
		Элементы.ИНН.Видимость								= Истина;
		Элементы.КПП.Видимость								= Истина;
		
		Элементы.ВидГосударственногоОргана.Видимость		= Ложь;
		Элементы.КодГосударственногоОргана.Видимость		= Ложь;
		
		Элементы.ИНН.ПодсказкаВвода							= НСтр("ru = '10 цифр'");
		Элементы.ИНН.ОграничениеТипа						= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
		Элементы.НаименованиеПолное.ПодсказкаВвода			= НСтр("ru = 'Юридическое название'");
		
		Элементы.ИНН.Подсказка							= НСтр("ru = 'Идентификационный номер налогоплательщика'");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИНН", "Доступность", НЕ ЗначениеЗаполнено(Объект.ГоловнойКонтрагент));
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель") Тогда
		
		Элементы.ИНН.Видимость								= Истина;
		Элементы.КПП.Видимость								= Ложь;
		Элементы.НаименованиеПолное.ПодсказкаВвода			= НСтр("ru = 'Юридическое название'");
		Элементы.ИНН.ПодсказкаВвода							= НСтр("ru = '12 цифр'");
		Элементы.ИНН.ОграничениеТипа						= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12));
		
		Элементы.ВидГосударственногоОргана.Видимость		= Ложь;
		Элементы.КодГосударственногоОргана.Видимость		= Ложь;
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо") Тогда
		
		Элементы.ИНН.Видимость								= Истина;
		Элементы.КПП.Видимость								= Ложь;
		Элементы.ИНН.ПодсказкаВвода					= НСтр("ru = '12 цифр'");
		Элементы.ИНН.ОграничениеТипа				= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(12));
		Элементы.НаименованиеПолное.ПодсказкаВвода	= НСтр("ru = 'Фамилия Имя Отчество'");
		
		Элементы.ВидГосударственногоОргана.Видимость		= Ложь;
		Элементы.КодГосударственногоОргана.Видимость		= Ложь;
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган") Тогда
		
		Элементы.ИНН.Видимость								= Истина;
		Элементы.КПП.Видимость								= Истина;
		Элементы.ИНН.ПодсказкаВвода					= НСтр("ru = '10 цифр'");
		Элементы.ИНН.ОграничениеТипа				= Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
		Элементы.НаименованиеПолное.ПодсказкаВвода	= НСтр("ru = 'Юридическое название'");
		
		Элементы.ВидГосударственногоОргана.Видимость		= Истина;
		Элементы.КодГосударственногоОргана.Видимость		= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокФормы(Форма)
	
	Объект = Форма.Объект;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Форма.Автозаголовок = Истина;
		Возврат;
	КонецЕсли;
	
	Форма.Автозаголовок = Ложь;
	ВидыОтношений = Новый Массив;
	
	Если Объект.Покупатель Тогда
		ВидыОтношений.Добавить(НСтр("ru='Покупатель'"));
	КонецЕсли;
	
	Если Объект.Поставщик Тогда
		ВидыОтношений.Добавить(НСтр("ru='Поставщик'"));
	КонецЕсли;
	
	Если Объект.ПрочиеОтношения Тогда
		ВидыОтношений.Добавить(НСтр("ru='Прочие отношения'"));
	КонецЕсли;
	
	Заголовок = Объект.Наименование + " (" + НСтр("ru='Контрагент'");
	
	Если ВидыОтношений.Количество() > 0 Тогда
		Заголовок = Заголовок + ": ";
		Для Каждого Вид Из ВидыОтношений Цикл
			Заголовок = Заголовок + Вид + ", ";
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Заголовок, 2);
	КонецЕсли;
	
	Заголовок = Заголовок + ")";
	
	Форма.Заголовок = Заголовок;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьВидКонтрагента(Форма)
	
	Если ТипЗнч(Форма.ОрганизационноПравоваяФорма) <> Тип("Структура") 
		Или Не Форма.ОрганизационноПравоваяФорма.Свойство("ПолнаяФорма") Тогда
		
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ОрганизационноПравоваяФорма.ПолнаяФорма = "Индивидуальный предприниматель" Тогда
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель");
	ИначеЕсли Не ПустаяСтрока(Форма.ОрганизационноПравоваяФорма.ПолнаяФорма) Тогда
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоТекстуЗаполнения(Знач ТекстЗаполнения)
	
	Если (СтрДлина(ТекстЗаполнения) = 10 ИЛИ СтрДлина(ТекстЗаполнения) = 12)
		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТекстЗаполнения) Тогда
		
		Объект.Наименование = "";
		Объект.ИНН = ТекстЗаполнения;
		Объект.ВидКонтрагента = ?(СтрДлина(ТекстЗаполнения) = 10,
			Перечисления.ВидыКонтрагентов.ЮридическоеЛицо,
			Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель);
		ТекстЗаполнения = Неопределено;
		
		ОписаниеОшибкиЗаполнения = "";
		ЗаполнитьРеквизитыПоИНННаСервере(Объект.ИНН);
		
	Иначе
		
		Объект.НаименованиеПолное = ТекстЗаполнения;
		ТекущийЭлемент = Элементы.НаименованиеПолное;
		
		ФормироватьНаименованиеАвтоматически = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформацию()
	
	Если Не Параметры.Свойство("ДобавитьКонтактнуюИнформацию") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ДобавитьКонтактнуюИнформацию) = Тип("Структура") Тогда
		ДобавляемаяКИ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.ДобавитьКонтактнуюИнформацию);
	ИначеЕсли ТипЗнч(Параметры.ДобавитьКонтактнуюИнформацию) = Тип("Массив") Тогда
		ДобавляемаяКИ = Параметры.ДобавитьКонтактнуюИнформацию;
	Иначе
		Возврат;
	КонецЕсли;
	
	Для каждого ОписаниеКИ Из ДобавляемаяКИ Цикл
		ДанныеКИ = Новый Структура("ИмяЭлементаДляРазмещения,Вид,Представление,Значение");
		ЗаполнитьЗначенияСвойств(ДанныеКИ, ОписаниеКИ);
		Если ОписаниеКИ.Свойство("ВидКИ") Тогда
			// Для совместимости.
			ДанныеКИ.Вид = ОписаниеКИ.ВидКИ;
		КонецЕсли;
		ДанныеКИ.ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
		УправлениеКонтактнойИнформациейУНФ.ДобавитьКонтактнуюИнформациюНаФорму(ЭтотОбъект, Объект, ДанныеКИ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыВзаиморасчетов()
	
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВалютаРасчетовПоУмолчанию = НациональнаяВалюта;
	КонецЕсли;
	
	Если Объект.СпособЗачетаПредоплатыПоУмолчанию.Пустая() Тогда
		Объект.СпособЗачетаПредоплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособЗачетаПредоплатыПоУмолчанию();
	КонецЕсли;
	Если Объект.СпособРазнесенияОплатыПоУмолчанию.Пустая() Тогда
		Объект.СпособРазнесенияОплатыПоУмолчанию = РасчетыРаботаСФормамиВызовСервера.ПолучитьСпособРазнесенияОплатыПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНаименованияКонтрагента()
	
	ОбновитьНаименованиеКонтрагента();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименованиеКонтрагента()
	
	Если НЕ ФормироватьНаименованиеАвтоматически Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = Объект.НаименованиеПолное;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкиКонтрагента

&НаКлиентеНаСервереБезКонтекста
Процедура ВыполнитьВсеПроверки(Форма)
	
	СформироватьПредставлениеПроверкиИНН(Форма);
	СформироватьПредставлениеПроверкиКПП(Форма);
	СформироватьПредставлениеПроверкиДублей(Форма);
	
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиИНН(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	Если ПустаяСтрока(Объект.ИНН) Тогда
		Объект.ИННВведенКорректно = Истина;
	Иначе
		Объект.ИННВведенКорректно = РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Объект.ИНН, ЭтоЮрЛицо(Объект.ВидКонтрагента), ОписаниеОшибки);
	КонецЕсли;
	Форма.ПредставлениеПроверкиИНН = Новый ФорматированнаяСтрока(ОписаниеОшибки, , Форма.ЦветТекстаНекорректногоКонтрагента);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиКПП(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	Если ПустаяСтрока(Объект.КПП) Тогда
		Объект.КППВведенКорректно = Истина;
	Иначе
		Объект.КППВведенКорректно = РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(Объект.КПП, ОписаниеОшибки);
	КонецЕсли;
	Форма.ПредставлениеПроверкиКПП = Новый ФорматированнаяСтрока(ОписаниеОшибки, , Форма.ЦветТекстаНекорректногоКонтрагента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиДублей(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	
	Если ИННиКППКорректны(Форма) И Не ПустаяСтрока(Объект.ИНН) Тогда
		
		
		МассивДублей = ПолучитьДублиКонтрагентаСервер(СокрЛП(Объект.ИНН), СокрЛП(Объект.КПП), Объект.Ссылка);
		
		КоличествоДублей = МассивДублей.Количество();
		
		Если КоличествоДублей > 0 Тогда
			
			СтруктураПараметровСообщенияОДублях = Новый Структура;
			СтруктураПараметровСообщенияОДублях.Вставить("ИННиКПП", ?(ЭтоЮрЛицо(Объект.ВидКонтрагента), НСтр("ru = 'ИНН и КПП'"), НСтр("ru = 'ИНН'")));
			
			Если КоличествоДублей = 1 Тогда
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", НСтр("ru = 'один'"));
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагент'"));
			ИначеЕсли КоличествоДублей < 5 Тогда
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", КоличествоДублей);
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагента'"));
			Иначе
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", КоличествоДублей);
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагентов'"));
			КонецЕсли;
			
			ОписаниеОшибки = НСтр("ru = 'С таким [ИННиКПП] есть [КоличествоДублей] [СклонениеКонтрагентов]'");
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ОписаниеОшибки, СтруктураПараметровСообщенияОДублях);
			
		КонецЕсли;
	КонецЕсли;
	
	Форма.ПредставлениеПроверкиДублей = Новый ФорматированнаяСтрока(ОписаниеОшибки, , Форма.ЦветТекстаНекорректногоКонтрагента, , "ПоказатьДубли");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДублиКонтрагентаСервер(ИНН, КПП, ИсключаяСсылку)
	
	Возврат Справочники.Контрагенты.ПроверитьДублиСправочникаКонтрагентыПоИННКПП(ИНН, КПП, ИсключаяСсылку);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИННиКППКорректны(Форма)
	
	Объект = Форма.Объект;
	ЭтоЮрЛицо = ЭтоЮрЛицо(Объект.ВидКонтрагента);
	
	Если ЭтоЮрЛицо Тогда
		Результат = Объект.ИННВведенКорректно И (Объект.КППВведенКорректно Или ПустаяСтрока(Объект.КПП));
	Иначе
		Результат = Объект.ИННВведенКорректно;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЮрЛицо(ВидКонтрагента)
	
	Возврат ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо")
		Или ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРеквизитыПроверкиКонтрагентов(Форма)
	
	Объект = Форма.Объект;
	
	Форма.РеквизитыПроверкиКонтрагентов.ЭтоИностранныйКонтрагент =
		(Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо")
		И Объект.СтранаРегистрации <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
	
	Форма.РеквизитыПроверкиКонтрагентов.ЭтоЮридическоеЛицо 		 =
		(Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо")
		Или Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ГосударственныйОрган"));
	
	Форма.РеквизитыПроверкиКонтрагентов.ОтключитьПроверкуФНС 	 = Форма.РеквизитыПроверкиКонтрагентов.ЭтоИностранныйКонтрагент;
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеЕГР

&НаКлиенте
Процедура ВыполнитьЗаполнениеРеквизитовПоИНН(знач ИНН)
	
	ОписаниеОшибкиЗаполнения = "";
	ЗаполнитьРеквизитыПоИНННаСервере(ИНН);
	УправлениеФормой();
	
	Если Не ПустаяСтрока(ОписаниеОшибкиЗаполнения) Тогда
		ОбработчикЗавершенияОбработкиОшибки = Новый ОписаниеОповещения(
		"ОбработатьОшибкуЗаполнитьРеквизитыПоИННЗавершение",
		ЭтотОбъект,
		ИНН);
		РаботаСКонтрагентамиКлиент.ОбработатьОшибку(ОписаниеОшибкиЗаполнения, ОбработчикЗавершенияОбработкиОшибки);
	Иначе
		Если ИспользоватьСпаркРиски Тогда
			// ИнтернетПоддержкаПользователей.СПАРКРиски
			ЭтотОбъект.ИндексыСПАРКРиски = Неопределено;
			ОбновитьОтображениеИндексыСПАРК();
			// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
		КонецЕсли;
		
		// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
		УстановитьРеквизитыПроверкиКонтрагентов(ЭтотОбъект);
		ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
		// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	КонецЕсли;
	
	УдалитьЭлементыКомандКонтактнойИнформации(Элементы.КонтактнаяИнформация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоИНННаСервере(ИНН)
	
	Если СтрДлина(ИНН) = 12 Тогда
		ЭтоЮрЛицо = Ложь;
	Иначе
		ЭтоЮрЛицо = Истина;
	КонецЕсли;
	
	ЭтоГосударственныйОрган = Ложь;
	КодОКВЭД = "";
	
	Если ЭтоЮрЛицо Тогда
		РеквизитыКонтрагента = РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН(ИНН);
		
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
			ОписаниеОшибкиЗаполнения = РеквизитыКонтрагента.ОписаниеОшибки;
			Возврат;
		КонецЕсли;
		
		Если РеквизитыКонтрагента.ЕГРЮЛ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Наименование         = РеквизитыКонтрагента.ЕГРЮЛ.Наименование;
		Объект.НаименованиеПолное   = РеквизитыКонтрагента.ЕГРЮЛ.НаименованиеСокращенное;
		Объект.ИНН                  = РеквизитыКонтрагента.ИНН;
		Объект.КПП                  = РеквизитыКонтрагента.ЕГРЮЛ.КПП;
		Объект.РегистрационныйНомер = РеквизитыКонтрагента.ЕГРЮЛ.РегистрационныйНомер;
		РеквизитыКонтрагента.ЕГРЮЛ.Свойство("КодОКВЭД", КодОКВЭД);
		
		ЗаполнитьКонтактнуюИнформациюКонтрагентаПоДаннымЕГРЮЛ(РеквизитыКонтрагента);
		

		Руководители = РеквизитыКонтрагента.ЕГРЮЛ.ДанныеРуководителей.Руководители;
		
		Если Руководители.Количество() <> 0 Тогда
			ДанныеРуководителяПоИНН = Руководители[0];
			ФИОРуководителя = Новый Массив;
			Если ЗначениеЗаполнено(ДанныеРуководителяПоИНН.Фамилия) Тогда
				ФИОРуководителя.Добавить(ДанныеРуководителяПоИНН.Фамилия);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеРуководителяПоИНН.Имя) Тогда
				ФИОРуководителя.Добавить(ДанныеРуководителяПоИНН.Имя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеРуководителяПоИНН.Отчество) Тогда
				ФИОРуководителя.Добавить(ДанныеРуководителяПоИНН.Отчество);
			КонецЕсли;
		КонецЕсли;
		
		НаименованиеПолное = РеквизитыКонтрагента.ЕГРЮЛ.НаименованиеПолное;
		
	Иначе
		
		РеквизитыПредпринимателя = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(ИНН);
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.ОписаниеОшибки) Тогда
			ОписаниеОшибкиЗаполнения = РеквизитыПредпринимателя.ОписаниеОшибки;
			Возврат;
		КонецЕсли;
		
		Объект.Наименование			= РеквизитыПредпринимателя.Наименование;
		Объект.НаименованиеПолное	= РеквизитыПредпринимателя.НаименованиеСокращенное;
		Объект.ИНН					= РеквизитыПредпринимателя.ИНН;
		Объект.РегистрационныйНомер	= РеквизитыПредпринимателя.РегистрационныйНомер;
		РеквизитыПредпринимателя.Свойство("КодОКВЭД", КодОКВЭД);
		
		Если РеквизитыПредпринимателя.СвидетельствоОРегистрации <> Неопределено Тогда
			Объект.СвидетельствоСерияНомер = "" + РеквизитыПредпринимателя.СвидетельствоОРегистрации.Серия + " " + РеквизитыПредпринимателя.СвидетельствоОРегистрации.Номер;
			Объект.СвидетельствоДатаВыдачи = РеквизитыПредпринимателя.СвидетельствоОРегистрации.Дата;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.Фамилия) Тогда
			Объект.ФИО = РеквизитыПредпринимателя.Фамилия
				+ ?(ПустаяСтрока(РеквизитыПредпринимателя.Имя), "", " " + РеквизитыПредпринимателя.Имя)
				+ ?(ПустаяСтрока(РеквизитыПредпринимателя.Отчество), "", " " + РеквизитыПредпринимателя.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.Пол) Тогда
			Объект.Пол = ?(РеквизитыПредпринимателя.Пол = "1", Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский);
		КонецЕсли;
		
		НаименованиеПолное = РеквизитыПредпринимателя.НаименованиеПолное;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
		
		Элементы.НаименованиеПолное.СписокВыбора.Очистить();
		Элементы.НаименованиеПолное.СписокВыбора.Добавить(Объект.НаименованиеПолное);
		Элементы.НаименованиеПолное.СписокВыбора.Добавить(НаименованиеПолное);
		Элементы.НаименованиеПолное.КнопкаВыпадающегоСписка = Истина;
		
	КонецЕсли;
	
	Если СтрНачинаетсяС(КодОКВЭД, "84.") Тогда
		ЭтоГосударственныйОрган = Истина;
	КонецЕсли;

	Если ЭтоГосударственныйОрган Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
	ИначеЕсли СтрДлина(ИНН) = 10 Тогда
		Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда
		
		Если ТипЗнч(ОрганизационноПравоваяФорма) = Тип("Структура")
			И ОрганизационноПравоваяФорма.Свойство("ПолнаяФорма")
			И ВРег(ОрганизационноПравоваяФорма.ПолнаяФорма) = ВРег("Индивидуальный предприниматель") Тогда
				
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
		Иначе
			Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьВидКонтрагента();
	ВыполнитьВсеПроверки(ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформациюКонтрагентаПоДаннымЕГРЮЛ(СведенияОЮридическомЛицеПоИНН)
	
	НоваяКонтактнаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	
	Если СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	КонецЕсли;
	
	Если СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Свойство("Телефон")
		И СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(Объект, НоваяКонтактнаяИнформация);
	ИмяЭлементаДляРазмещения = Элементы.КонтактнаяИнформация.Имя;
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, Объект, ИмяЭлементаДляРазмещения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючевыеРеквизитыЗаполнены(Форма)
	
	Результат = Ложь;
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Наименование)
		Или Объект.КонтактнаяИнформация.Количество() > 0 Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОшибкуЗаполнитьРеквизитыПоИННЗавершение(Результат, СтрокаИНН) Экспорт
	
	Если Результат.ПовторитьДействие Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН(СтрокаИНН);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеРеквизитовКонтрагентВыбран(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) 
		ИЛИ ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИНН = Результат;
	ВыполнитьЗаполнениеРеквизитовПоИНН(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПерезаполнитьРеквизитыПоИННЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН(Объект.ИНН);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область КонтрольДублей

&НаСервере
Процедура УстановитьНастройкиКонтроляДублей()
	
	Элементы.ДублиНаименованиеПолное.Видимость = Ложь;

	НастройкиКонтроляДублейКонтрагенты = Константы.НастройкиКонтроляДублейКонтрагенты.Получить().Получить();
	
	Если НастройкиКонтроляДублейКонтрагенты <> Неопределено Тогда
		ПроверятьЮрНазваниеНаДубли    = НастройкиКонтроляДублейКонтрагенты.Получить("ПроверятьЮрНазвание");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаДубли(Реквизит)
	
	Если Реквизит = "НаименованиеПолное" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
			Возврат;
		КонецЕсли;
		НаименованиеПолноеДляПоискаДублей = Объект.НаименованиеПолное;
	КонецЕсли;
	
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.Ссылка = &Ссылка
	|	И (Контрагенты.Наименование ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &Наименование)";
	
	
	ЗапросКонтрагенты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
	ЗапросКонтрагенты.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = ЗапросКонтрагенты.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Элементы["Дубли"+Реквизит].Видимость = НЕ Результат.Пустой();

КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборДублей(ВыбранныйКонтрагент)
	
	ЗакрыватьПриВыборе = Ложь;
	ЗначениеВРеквизитФормы(ВыбранныйКонтрагент.ПолучитьОбъект(), "Объект");
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеОДублях()
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыПредупреждениеДублей",ЭтотОбъект);
	ТекстПредупреждения = ТекстПредупрежденияПоДублям();

	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Проигнорировать и записать'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстПредупреждения, СписокКнопок,,КодВозвратаДиалога.Отмена, "Контроль дублей");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыПредупреждениеДублей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПроигнорированоСообщениеОДублях = Истина;
	СозданКопированием = Ложь;
	СообщениеОДублированииИнформации = ТекстПредупрежденияПоДублям(Истина);
	
	Элементы.ДублиНаименованиеПолное.Видимость = Ложь;
	
	Записать();
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтрагентаНаДублиСервер()
	
	Если ПроверятьЮрНазваниеНаДубли Тогда
		ПроверитьНаДубли("НаименованиеПолное");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТекстПредупрежденияПоДублям(СообщениеПриЗаписи = Ложь)
	
	МассивСтрок = Новый Массив;
	
	Если Элементы.ДублиНаименованиеПолное.Видимость Тогда
		МассивСтрок.Добавить(НСтр("ru = 'юр. названию'"));
	КонецЕсли;
	
	Если СообщениеПриЗаписи Тогда
		Возврат НСтр("ru = 'Проигнорировано сообщение о дублировании информации по '") + СтрСоединить(МассивСтрок,", ");
	КонецЕсли;
	
	ТекстПредупреждения = НСтр("ru = 'Найдены дубли по '") + СтрСоединить(МассивСтрок,", ");
	Возврат ТекстПредупреждения;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСообщениеОДублях()
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупрежденияПоДублям());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСпискаДублей(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено И РезультатЗакрытия.Свойство("ВыбранДубльКонтрагента") Тогда
		
		ОбработатьВыборДублей(РезультатЗакрытия.ВыбранныйКонтрагент);
		Элементы.ДублиНаименованиеПолное.Видимость = Ложь;
		КонтрагентЗамененНаДубль = Истина;
		Возврат;
		
	КонецЕсли;
	
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
