export const tableMetadataObjects = [
  ["CatalogRef.КакойТоСправочник", "Справочник.КакойТоСправочник"],
  ["CatalogObject.КакойТоСправочник", "СправочникОбъект.КакойТоСправочник"],
  ["DocumentRef.ЗаказПоставщику", "Документ.ЗаказПоставщику"],
  ["DocumentObject.ЗаказПоставщику", "ДокументОбъект.ЗаказПоставщику"],
  ["EnumRef.КакоеТоПеречисление", "Перечисление.КакоеТоПеречисление"],
  ["TaskRef.ЗадачаИсполнителя", "Задача.ЗадачаИсполнителя"],
  ["TaskObject.ЗадачаИсполнителя", "ЗадачаОбъект.ЗадачаИсполнителя"],
  [
    "ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения",
    "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения",
  ],
  [
    "ChartOfCharacteristicTypesObject.ДополнительныеРеквизитыИСведения",
    "ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения",
  ],
  ["BusinessProcessRef.КакойТоБизнесПроцесс", "БизнесПроцесс.КакойТоБизнесПроцесс"],
  ["BusinessProcessObject.КакойТоБизнесПроцесс", "БизнесПроцессОбъект.КакойТоБизнесПроцесс"],
]
