export const tableMetadataObjects = [
  ["CatalogRef", "Справочник"],
  ["CatalogObject", "СправочникОбъект"],
  ["DocumentRef", "Документ"],
  ["DocumentObject", "ДокументОбъект"],
  ["EnumRef", "Перечисление"],
  ["TaskRef", "Задача"],
  ["TaskObject", "ЗадачаОбъект"],
  ["ChartOfCharacteristicTypesRef", "ПланВидовХарактеристик"],
  ["ChartOfCharacteristicTypesObject", "ПланВидовХарактеристикОбъект"],
  ["CatalogRef.КакойТоСправочник", "Справочник.КакойТоСправочник"],
  ["CatalogObject.КакойТоСправочник", "СправочникОбъект.КакойТоСправочник"],
  ["DocumentRef.ЗаказПоставщику", "Документ.ЗаказПоставщику"],
  ["DocumentObject.ЗаказПоставщику", "ДокументОбъект.ЗаказПоставщику"],
  ["EnumRef.КакоеТоПеречисление", "Перечисление.КакоеТоПеречисление"],
  ["TaskRef.ЗадачаИсполнителя", "Задача.ЗадачаИсполнителя"],
  ["TaskObject.ЗадачаИсполнителя", "ЗадачаОбъект.ЗадачаИсполнителя"],
  [
    "ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения",
    "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения",
  ],
  [
    "ChartOfCharacteristicTypesObject.ДополнительныеРеквизитыИСведения",
    "ПланВидовХарактеристикОбъект.ДополнительныеРеквизитыИСведения",
  ],
  ["BusinessProcessRef.КакойТоБизнесПроцесс", "БизнесПроцесс.КакойТоБизнесПроцесс"],
  ["BusinessProcessObject.КакойТоБизнесПроцесс", "БизнесПроцессОбъект.КакойТоБизнесПроцесс"],
  // ["InformationRegister.НормативныйГрафикЭтаповПроизводства", "РегистрСведений.НормативныйГрафикЭтаповПроизводства"],
]

export const tableMetadataFields = [
  ["Catalog.КакойТоСправочник.Attribute.КакойТоРеквизит", "Справочник.КакойТоСправочник.Реквизит.КакойТоРеквизит"],
  [
    "Catalog.КакойТоСправочник.TabularSection.КакаяТоТаблица.Attribute.КакойТоРеквизит",
    "Справочник.КакойТоСправочник.ТабличнаяЧасть.КакаяТоТаблица.Реквизит.КакойТоРеквизит",
  ],
  ["Catalog.КакойТоСправочник.StandardAttribute.Owner", "Справочник.КакойТоСправочник.СтандартныйРеквизит.Владелец"],
  [
    "Catalog.КакойТоСправочник.TabularSection.КакаяТоТаблица.StandardAttribute.LineNumber",
    "Справочник.КакойТоСправочник.ТабличнаяЧасть.КакаяТоТаблица.СтандартныйРеквизит.НомерСтроки",
  ],
  [
    "ExchangePlan.СинхронизацияДанныхЧерезУниверсальныйФормат.Attribute.РежимВыгрузкиПриНеобходимости",
    "ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Реквизит.РежимВыгрузкиПриНеобходимости",
  ],
  [
    "InformationRegister.ДополнительныеСведения.Dimension.Объект",
    "РегистрСведений.ДополнительныеСведения.Измерение.Объект",
  ],
  [
    "InformationRegister.ДополнительныеСведения.Resource.Значение",
    "РегистрСведений.ДополнительныеСведения.Ресурс.Значение",
  ],
  [
    "InformationRegister.ДополнительныеСведения.Attribute.Информация",
    "РегистрСведений.ДополнительныеСведения.Реквизит.Информация",
  ],
  [
    "InformationRegister.КакойТоРегистрСведений.StandardAttribute.Active",
    "РегистрСведений.КакойТоРегистрСведений.СтандартныйРеквизит.Активность",
  ],
  [
    "InformationRegister.КакойТоРегистрСведений.StandardAttribute.LineNumber",
    "РегистрСведений.КакойТоРегистрСведений.СтандартныйРеквизит.НомерСтроки",
  ],
  [
    "InformationRegister.КакойТоРегистрСведений.StandardAttribute.Recorder",
    "РегистрСведений.КакойТоРегистрСведений.СтандартныйРеквизит.Регистратор",
  ],
  [
    "InformationRegister.КакойТоРегистрСведений.StandardAttribute.Period",
    "РегистрСведений.КакойТоРегистрСведений.СтандартныйРеквизит.Период",
  ],
]
