#Область СлужебныйПрограммныйИнтерфейс

Процедура Инициализировать() Экспорт
	// Ничего не делаем
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьЗначенияДобавляемыхРеквизитов(ДобавляемыеРеквизиты) Экспорт
	Результат = Новый Массив;
	Для Каждого ДобавляемыйРеквизит Из ДобавляемыеРеквизиты Цикл
		ЗначениеРеквизита = ПолучитьЗначениеРеквизита(ДобавляемыйРеквизит);
		Результат.Добавить(ЗначениеРеквизита);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ЗаполнитьЗначенияИзменяемыхРеквизитов(ИзменяемыеРеквизиты) Экспорт
	Результат = Новый Массив;
	Для Каждого ИзменяемыйРеквизит Из ИзменяемыеРеквизиты Цикл
		ЗначениеРеквизита = ПолучитьЗначениеРеквизита(ИзменяемыйРеквизит);
		Результат.Добавить(ЗначениеРеквизита);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ЗаполнитьЗначенияИзменяемыхЭлементов(ИзменяемыеЭлементы) Экспорт
	Результат = Новый Структура();
	Для Каждого КлючЗначение Из ИзменяемыеЭлементы Цикл
		ИмяЭлемента = КлючЗначение.Ключ;
		ОписаниеЭлемента = КлючЗначение.Значение;
		
		ЗначениеЭлемента = ПолучитьЗначениеЭлемента(ОписаниеЭлемента);
		Результат.Вставить(ИмяЭлемента, ЗначениеЭлемента);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьЗначениеРеквизита(ОписаниеРеквизита)
	Результат = Новый Структура;
	Для Каждого КлючЗначение Из ОписаниеРеквизита Цикл
		ИмяРеквизита = КлючЗначение.Ключ;
		ЗначениеРеквизита = КлючЗначение.Значение;
		
		Если ИмяРеквизита = "Type" Тогда
			ЗначениеРеквизита = ПолучитьОписаниеТипов(ЗначениеРеквизита);
		КонецЕсли;
		
		Результат.Вставить(ИмяРеквизита, ЗначениеРеквизита);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеЭлемента(ОписаниеЭлемента)
	Результат = Новый Структура;
	Для Каждого КлючЗначение Из ОписаниеЭлемента Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		ОписаниеСвойства = КлючЗначение.Значение;
		
		ЗначениеСвойства = ПолучитьЗначениеСвойства(ОписаниеСвойства);
		
		Результат.Вставить(ИмяСвойства, ЗначениеСвойства);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеСвойства(ЗначениеСвойства)
	Если ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	
	Если НЕ ЗначениеСвойства.Свойство("Value") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Результат = Вычислить(ЗначениеСвойства.Value);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#Область ОписаниеТипов

&НаКлиенте
Функция ПолучитьОписаниеТипов(СоотвОписаниеТипов)
	КвалификаторыЧисла = ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов);
	КвалификаторыДаты = ПолучитьКвалификаторыДаты(СоотвОписаниеТипов);
	КвалификаторыСтроки = ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов);
	
	Типы = Новый Массив;
	Для Каждого ТекТип Из СоотвОписаниеТипов.Type Цикл
		Типы.Добавить(ТекТип);
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(
		СтрСоединить(Типы, ","),
		КвалификаторыЧисла,
		КвалификаторыСтроки,
		КвалификаторыДаты);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("number") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДлинаЧисла = ?(НЕ СоотвОписаниеТипов.Свойство("Digits"), 0, СоотвОписаниеТипов.Digits);
	ТочностьЧисла = ?(НЕ СоотвОписаниеТипов.Свойство("FractionDigits"), 0, СоотвОписаниеТипов.FractionDigits);
	ЗначениеДопустимыйЗнак = ?(НЕ СоотвОписаниеТипов.Свойство("AllowedSign") ИЛИ СоотвОписаниеТипов.AllowedSign = "Any",
			ДопустимыйЗнак.Любой,
			ДопустимыйЗнак.Неотрицательный);
	
	Возврат Новый КвалификаторыЧисла(ДлинаЧисла, ТочностьЧисла, ЗначениеДопустимыйЗнак);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыДаты(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("dataTime") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекЧастиДаты = ?(
			СоотвОписаниеТипов.ЧастиДаты = Неопределено,
			ЧастиДаты.ДатаВремя,
			ПолучитьЗначениеСвойства(Новый Структура("Тип,Значение", "ЧастиДаты", СоотвОписаниеТипов.ЧастиДаты)));
	
	Возврат Новый КвалификаторыДаты(ТекЧастиДаты);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("string") = Неопределено
		ИЛИ СоотвОписаниеТипов.ДлинаСтроки <> Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДлинаСтроки = ?(СоотвОписаниеТипов.ДлинаСтроки = Неопределено, 0, СоотвОписаниеТипов.ДлинаСтроки);
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки);
КонецФункции

#КонецОбласти

#КонецОбласти