#Область СлужебныйПрограммныйИнтерфейс

Процедура Инициализировать() Экспорт
	// Ничего не делаем
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьЗначенияДобавляемыхРеквизитов(ДобавляемыеРеквизиты) Экспорт
	Результат = Новый Массив;
	Для Каждого ДобавляемыйРеквизит Из ДобавляемыеРеквизиты Цикл
		ЗначениеРеквизита = ПолучитьЗначениеРеквизита(ДобавляемыйРеквизит);
		Результат.Добавить(ЗначениеРеквизита);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ЗаполнитьЗначенияИзменяемыхРеквизитов(ИзменяемыеРеквизиты) Экспорт
	Результат = Новый Массив;
	Для Каждого ИзменяемыйРеквизит Из ИзменяемыеРеквизиты Цикл
		ЗначениеРеквизита = ПолучитьЗначениеРеквизита(ИзменяемыйРеквизит);
		Результат.Добавить(ЗначениеРеквизита);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ЗаполнитьЗначенияИзменяемыхЭлементов(ИзменяемыеЭлементы) Экспорт
	Результат = Новый Структура();
	Для Каждого КлючЗначение Из ИзменяемыеЭлементы Цикл
		ИмяЭлемента = КлючЗначение.Ключ;
		ОписаниеЭлемента = КлючЗначение.Значение;
		
		ЗначениеЭлемента = ПолучитьЗначениеЭлемента(ОписаниеЭлемента);
		Результат.Вставить(ИмяЭлемента, ЗначениеЭлемента);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьЗначениеРеквизита(ОписаниеРеквизита)
	Результат = Новый Структура;
	Для Каждого КлючЗначение Из ОписаниеРеквизита Цикл
		ИмяРеквизита = КлючЗначение.Ключ;
		ЗначениеРеквизита = КлючЗначение.Значение;
		
		Если ИмяРеквизита = "Type" Тогда
			ЗначениеРеквизита = ПолучитьОписаниеТипов(ЗначениеРеквизита);
		КонецЕсли;
		
		Результат.Вставить(ИмяРеквизита, ЗначениеРеквизита);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеЭлемента(ОписаниеЭлемента)
	Результат = Новый Структура;
	Для Каждого КлючЗначение Из ОписаниеЭлемента Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		ОписаниеСвойства = КлючЗначение.Значение;
		
		ЗначениеСвойства = ПолучитьЗначениеСвойства(ОписаниеСвойства);
		
		Результат.Вставить(ИмяСвойства, ЗначениеСвойства);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьЗначениеСвойства(ЗначениеСвойства)
	Если ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	
	Если НЕ ЗначениеСвойства.Свойство("Value") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Результат = Вычислить(ЗначениеСвойства.Value);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#Область ОписаниеТипов

&НаКлиенте
Функция ПолучитьОписаниеТипов(СоотвОписаниеТипов)
	КвалификаторыЧисла = ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов);
	КвалификаторыДаты = ПолучитьКвалификаторыДаты(СоотвОписаниеТипов);
	КвалификаторыСтроки = ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов);
	
	Типы = Новый Массив;
	Для Каждого ТекТип Из СоотвОписаниеТипов.Type Цикл
		Типы.Добавить(ТекТип);
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(
		СтрСоединить(Типы, ","),
		КвалификаторыЧисла,
		КвалификаторыСтроки,
		КвалификаторыДаты);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("number") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЧислоРазрядов = 0;
	Если СоотвОписаниеТипов.Digits <> Неопределено Тогда
		ЧислоРазрядов = СоотвОписаниеТипов.Digits;
	КонецЕсли;
	
	ЧислоРазрядовДробнойЧасти = 0;
	Если СоотвОписаниеТипов.Свойство("FractionDigits") <> Неопределено Тогда
		ЧислоРазрядовДробнойЧасти = СоотвОписаниеТипов.FractionDigits;
	КонецЕсли;
	
	ДопустимыйЗнак = ДопустимыйЗнак.Любой;
	Если СоотвОписаниеТипов.Свойство("AllowedSign") <> Неопределено Тогда
		ДопустимыйЗнак = ?(СоотвОписаниеТипов.AllowedSign = "Any", ДопустимыйЗнак.Любой, ДопустимыйЗнак.Неотрицательный);
	КонецЕсли;
	
	Возврат Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, ДопустимыйЗнак);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыДаты(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("dataTime") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекЧастиДаты = ЧастиДаты.ДатаВремя;
	Если СоотвОписаниеТипов.Свойство("DateFractions") Тогда
		Если СоотвОписаниеТипов.DateFractions = "Date" Тогда
			ТекЧастиДаты = ЧастиДаты.Дата;
		ИначеЕсли СоотвОписаниеТипов.DateFractions = "Time" Тогда
			ТекЧастиДаты = ЧастиДаты.Время;
		Иначе
			ТекЧастиДаты = ЧастиДаты.ДатаВремя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый КвалификаторыДаты(ТекЧастиДаты);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("string") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДлинаСтроки = 0;
	Если СоотвОписаниеТипов.Свойство("Length") Тогда
		ДлинаСтроки = СоотвОписаниеТипов.Length;
	КонецЕсли;
	
	ДопустимаяДлинаСтроки = ДопустимаяДлина.Переменная;
	Если СоотвОписаниеТипов.Свойство("AllowedLength") Тогда
		ДопустимаяДлинаСтроки = ДопустимаяДлинаСтроки.AllowedLength;
	КонецЕсли;
	
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлинаСтроки);
КонецФункции

#КонецОбласти

#КонецОбласти