
&НаКлиенте
Процедура ОбновитьСвойстваЭлементов(ПараметрыИзмененияФормы)
	ИзменяемыеЭлементы = ПараметрыИзмененияФормы.ИзменяемыеЭлементы;
	Для Каждого СвойстваЭлемента Из ИзменяемыеЭлементы Цикл
		ЭлементФормы = ПолучитьЭлементФормыПоИмени(СвойстваЭлемента.Name);
		ОбновитьСвойстваЭлемента(ЭлементФормы, СвойстваЭлемента);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвойстваЭлемента(ЭлементФормы, СвойстваЭлемента)
	Для Каждого КлючЗначение Из СвойстваЭлемента Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		ЗначениеСвойства = ПолучитьЗначениеСвойства(КлючЗначение.Значение);
		ЭлементФормы[ИмяСвойства] = ЗначениеСвойства;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначениеСвойства(ЗначениеСвойства)
	Если ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	
	Если НЕ ЗначениеСвойства.Свойство("Value") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Результат = Вычислить(ЗначениеСвойства.Value);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьЭлементФормыПоИмени(ИмяЭлемента)
	Возврат Элементы[ИмяЭлемента];
КонецФункции


#Область ОписаниеТипов

&НаКлиенте
Функция ПолучитьОписаниеТипов(СоотвОписаниеТипов)
	КвалификаторыЧисла = ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов);
	КвалификаторыДаты = ПолучитьКвалификаторыДаты(СоотвОписаниеТипов);
	КвалификаторыСтроки = ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов);
	
	Типы = Новый Массив;
	Для Каждого ТекТип Из СоотвОписаниеТипов.Type Цикл
		Типы.Добавить(ТекТип);
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(
		СтрСоединить(Типы, ","),
		КвалификаторыЧисла,
		КвалификаторыСтроки,
		КвалификаторыДаты);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("number") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДлинаЧисла = ?(НЕ СоотвОписаниеТипов.Свойство("Digits"), 0, СоотвОписаниеТипов.Digits);
	ТочностьЧисла = ?(НЕ СоотвОписаниеТипов.Свойство("FractionDigits"), 0, СоотвОписаниеТипов.FractionDigits);
	ЗначениеДопустимыйЗнак = ?(НЕ СоотвОписаниеТипов.Свойство("AllowedSign") ИЛИ СоотвОписаниеТипов.AllowedSign = "Any",
			ДопустимыйЗнак.Любой,
			ДопустимыйЗнак.Неотрицательный);
	
	Возврат Новый КвалификаторыЧисла(ДлинаЧисла, ТочностьЧисла, ЗначениеДопустимыйЗнак);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыДаты(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("dataTime") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекЧастиДаты = ?(
			СоотвОписаниеТипов.ЧастиДаты = Неопределено,
			ЧастиДаты.ДатаВремя,
			ПолучитьЗначениеСвойства(Новый Структура("Тип,Значение", "ЧастиДаты", СоотвОписаниеТипов.ЧастиДаты)));
	
	Возврат Новый КвалификаторыДаты(ТекЧастиДаты);
КонецФункции

&НаКлиенте
Функция ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Типы.Найти("Строка") = Неопределено
		ИЛИ СоотвОписаниеТипов.ДлинаСтроки <> Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДлинаСтроки = ?(СоотвОписаниеТипов.ДлинаСтроки = Неопределено, 0, СоотвОписаниеТипов.ДлинаСтроки);
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки);
КонецФункции

#КонецОбласти

