
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = СтруктураПараметров(ПараметрКоманды);
	ОткрытьФорму("ЖурналДокументов.СогласияНаОбработкуПерсональныхДанных.ФормаСписка", 
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция СтруктураПараметров(ПараметрКоманды)
	
	Результат = Новый Структура;
	Результат.Вставить("Отбор", Новый Структура("Субъект", ПараметрКоманды.Ссылка));
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти