
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	//Вставить содержимое обработчика.
	//СтандартнаяОбработка = Ложь;
	//Поля.Добавить("Номер");
	//Поля.Добавить("Дата");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	//Вставить содержимое обработчика.
	//СтандартнаяОбработка = Ложь;
	//Представление = Метаданные.ВнешниеИсточникиДанных.ВнешнийИсточникДанныхВсеСвойства.Таблицы.ТаблицаВсеСвойства.Представление()
	//	+ " " + Строка(Данные.Номер) + НСтр("ru=' от '") + Формат(Данные.Дата, "ДЛФ=Д");
КонецПроцедуры
