#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция Построить(Форма, СтраницыРодитель, ГруппаЭталоны, ПараметрыИзмененияФормы) Экспорт
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Успешно", Истина);
	РезультатВыполнения.Вставить("Сообщения", "");
	
	СтраницаКонтейнер = СоздатьПолучитьСтраницуКонтейнер(
			Форма,
			СтраницыРодитель,
			"Контейнер_" + ПараметрыИзмененияФормы.Префикс);
	
	Контекст = Новый Структура;
	Контекст.Вставить("Форма", Форма);
	Контекст.Вставить("ГруппаКонтейнер", СтраницаКонтейнер);
	Контекст.Вставить("ГруппаЭталоны", ГруппаЭталоны);
	
	Попытка
		ДобавитьУдалитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы);
		
		ИзменитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы);
		
		УдалитьЭлементыФормы(Форма, ПараметрыИзмененияФормы);

		ДобавитьЭлементыФормы(Контекст, ПараметрыИзмененияФормы);
		
		ПереместитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, СтраницыРодитель);
				
		ИзменитьСвойстваЭлементов(Контекст, ПараметрыИзмененияФормы);
		
	Исключение
		РезультатВыполнения.Успешно = Ложь;
		РезультатВыполнения.Сообщения = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат РезультатВыполнения;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОписаниеТипов

Функция ПолучитьОписаниеТипов(СоотвОписаниеТипов)
	КвалификаторыЧисла = ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов);
	КвалификаторыДаты = ПолучитьКвалификаторыДаты(СоотвОписаниеТипов);
	КвалификаторыСтроки = ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов);
	
	Типы = Новый Массив;
	Для Каждого ТекТип Из СоотвОписаниеТипов.Type Цикл
		Типы.Добавить(ТекТип);
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(
		СтрСоединить(Типы, ","),
		КвалификаторыЧисла,
		КвалификаторыСтроки,
		КвалификаторыДаты);
КонецФункции

Функция ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("number") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЧислоРазрядов = 0;
	Если СоотвОписаниеТипов.Свойство("Digits") Тогда
		ЧислоРазрядов = СоотвОписаниеТипов.Digits;
	КонецЕсли;
	
	ЧислоРазрядовДробнойЧасти = 0;
	Если СоотвОписаниеТипов.Свойство("FractionDigits") Тогда
		ЧислоРазрядовДробнойЧасти = СоотвОписаниеТипов.FractionDigits;
	КонецЕсли;
	
	ТекДопустимыйЗнак = ДопустимыйЗнак.Любой;
	Если СоотвОписаниеТипов.Свойство("AllowedSign") Тогда
		ТекДопустимыйЗнак = ?(СоотвОписаниеТипов.AllowedSign = "Any", ДопустимыйЗнак.Любой, ДопустимыйЗнак.Неотрицательный);
	КонецЕсли;
	
	Возврат Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, ТекДопустимыйЗнак);
КонецФункции

Функция ПолучитьКвалификаторыДаты(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("dataTime") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекЧастиДаты = ЧастиДаты.ДатаВремя;
	Если СоотвОписаниеТипов.Свойство("DateFractions") Тогда
		Если СоотвОписаниеТипов.DateFractions = "Date" Тогда
			ТекЧастиДаты = ЧастиДаты.Дата;
		ИначеЕсли СоотвОписаниеТипов.DateFractions = "Time" Тогда
			ТекЧастиДаты = ЧастиДаты.Время;
		Иначе
			ТекЧастиДаты = ЧастиДаты.ДатаВремя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый КвалификаторыДаты(ТекЧастиДаты);
КонецФункции

Функция ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("string") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДлинаСтроки = 0;
	Если СоотвОписаниеТипов.Свойство("Length") Тогда
		ДлинаСтроки = СоотвОписаниеТипов.Length;
	КонецЕсли;
	
	ДопустимаяДлинаСтроки = ДопустимаяДлина.Переменная;
	Если СоотвОписаниеТипов.Свойство("AllowedLength") Тогда
		ДопустимаяДлинаСтроки = ДопустимаяДлинаСтроки.AllowedLength;
	КонецЕсли;
	
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлинаСтроки);
КонецФункции

#КонецОбласти

Функция СоздатьПолучитьСтраницуКонтейнер(Форма, СтраницыРодитель, ИмяСтраницы)
	Страница = СтраницыРодитель.ПодчиненныеЭлементы.Найти(ИмяСтраницы);
	Если Страница = Неопределено Тогда
		Страница = Форма.Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), СтраницыРодитель);
		Страница.Вид = ВидГруппыФормы.Страница;
	КонецЕсли;
	
	СтраницыРодитель.ТекущаяСтраница = Страница;
	Возврат Страница;
КонецФункции

Функция ПолучитьПутьРеквизита(Реквизит)
	Если Реквизит.Свойство("Path") И Реквизит.Path <> "" Тогда
		Возврат Реквизит.Path + "." + Реквизит.Name;
	КонецЕсли;
	Возврат Реквизит.Name;
КонецФункции

#Область ДобавлениеИУдалениеРеквизитов

Процедура ДобавитьУдалитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы)
	МассивУдаляемых = Новый Массив;
	Для Каждого УдаляемыйРеквизит Из ПараметрыИзмененияФормы.УдаляемыеРеквизиты Цикл
		ПутьРеквизита = ПолучитьПутьРеквизита(УдаляемыйРеквизит);
		МассивУдаляемых.Добавить(ПутьРеквизита);
	КонецЦикла;
	
	МассивДобавляемых = ПолучитьМассивДобавляемыхРеквизитов(ПараметрыИзмененияФормы);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемых, МассивУдаляемых);
КонецПроцедуры

Функция ПолучитьМассивДобавляемыхРеквизитов(ПараметрыИзмененияФормы)
	МассивДобавляемых = Новый Массив;
	Для Каждого ДобавляемыйРеквизит Из ПараметрыИзмененияФормы.ДобавляемыеРеквизиты Цикл
		Путь = "";
		Если ДобавляемыйРеквизит.Свойство("Path") Тогда
			Путь = ДобавляемыйРеквизит.Path;
		КонецЕсли;
		
		Заголовок = Неопределено;
		Если ДобавляемыйРеквизит.Свойство("Title") Тогда
			Заголовок = ДобавляемыйРеквизит.Title;
		КонецЕсли;
		
		ОписаниеТипа = ПолучитьОписаниеТипов(ДобавляемыйРеквизит.Type);
		
		НовыйРеквизит = Новый РеквизитФормы(ДобавляемыйРеквизит.Name, ОписаниеТипа, Путь, Заголовок);
		МассивДобавляемых.Добавить(НовыйРеквизит);
		
	КонецЦикла;
	
	Возврат МассивДобавляемых;
КонецФункции

#КонецОбласти

#Область ИзменениеРеквизитов

Процедура ИзменитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы)
	Для Каждого ИзменяемыйРеквизит Из ПараметрыИзмененияФормы.ИзменяемыеРеквизиты Цикл
		Если ИзменяемыйРеквизит.Свойство("Path") Тогда
			Реквизиты = Форма.ПолучитьРеквизиты(ИзменяемыйРеквизит.Path);  
		Иначе
			Реквизиты = Форма.ПолучитьРеквизиты();			
		КонецЕсли;
		Реквизит = Неопределено;
		Для Каждого ТекРеквизит Из Реквизиты Цикл
			Если ТекРеквизит.Имя = ИзменяемыйРеквизит.Name Тогда  
				Реквизит = ТекРеквизит;
			КонецЕсли;
		КонецЦикла; 
		
		Если Реквизит = Неопределено Тогда
			// TODO Это ошибка нужен обработчик
			Продолжить;
		КонецЕсли;
		
		Если ИзменяемыйРеквизит.Свойство("Type") Тогда
			Реквизит.Тип = ПолучитьОписаниеТипов(ИзменяемыйРеквизит.Type);
		КонецЕсли;
		
		Если ИзменяемыйРеквизит.Свойство("Title") Тогда
			Реквизит.Заголовок = ИзменяемыйРеквизит.Title;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеЭлементов

Процедура ДобавитьЭлементыФормы(Контекст, ПараметрыИзмененияФормы)
	Элементы = ПараметрыИзмененияФормы.ДобавляемыеЭлементы;
	Для Каждого ДобавляемыйЭлемент Из Элементы Цикл
		ДобавитьЭлементФормы(Контекст, ДобавляемыйЭлемент);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьЭлементФормы(Контекст, ДобавляемыйЭлемент)
	
	Родитель = ?(ДобавляемыйЭлемент.Свойство("ParentName"),
			Контекст.Форма.Элементы[ДобавляемыйЭлемент.ParentName],
			Контекст.ГруппаКонтейнер);
	
	ТипЭлемента = Тип(ДобавляемыйЭлемент.ElementType);
	
	НовыйЭлемент = Контекст.Форма.Элементы.Добавить(ДобавляемыйЭлемент.Name, ТипЭлемента, Родитель);
	ОбновитьСвойстваЭлемента(Контекст, НовыйЭлемент, ДобавляемыйЭлемент);
КонецПроцедуры

#КонецОбласти

#Область УдалениеЭлементов

Процедура УдалитьЭлементыФормы(Форма, ПараметрыИзмененияФормы)
	Элементы = ПараметрыИзмененияФормы.УдаляемыеЭлементы;
	Для Каждого ИмяЭлемента Из Элементы Цикл
		Элемент = ПолучитьЭлементФормыПоИмени(Форма, ИмяЭлемента);
		Форма.Элементы.Удалить(Элемент);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПеремещениеЭлементов

Процедура ПереместитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, ГруппаКонтейнер)
	Элементы = ПараметрыИзмененияФормы.ПеремещаемыеЭлементы;
	Для Каждого ОписаниеПеремещения Из Элементы Цикл
		Элемент = ПолучитьЭлементФормыПоИмени(Форма, ОписаниеПеремещения.Name);
		Родитель = ?(ОписаниеПеремещения.Свойство("ParentName"),
				ПолучитьЭлементФормыПоИмени(Форма, ОписаниеПеремещения.ParentName),
				ГруппаКонтейнер);
		Перед = ?(ОписаниеПеремещения.Свойство("Before"),
				ПолучитьЭлементФормыПоИмени(Форма, ОписаниеПеремещения.Before),
				Неопределено);
		
		Форма.Элементы.Переместить(Элемент, Родитель, Перед);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ИзменениеЭлементов

Процедура ИзменитьСвойстваЭлементов(Контекст, ПараметрыИзмененияФормы)
	ИзменяемыеЭлементы = ПараметрыИзмененияФормы.ИзменяемыеЭлементы;
	Для Каждого КлючИЗначение Из ИзменяемыеЭлементы Цикл
		ЭлементФормы = ПолучитьЭлементФормыПоИмени(Контекст.Форма, КлючИЗначение.Ключ);
		ОбновитьСвойстваЭлемента(Контекст, ЭлементФормы, КлючИЗначение.Значение);
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьСвойстваЭлемента(Контекст, ЭлементФормы, СвойстваЭлемента)
	ИмяСвойстваType = "Type";
	Если СвойстваЭлемента.Свойство(ИмяСвойстваType) Тогда
		ЗначениеСвойства = ПолучитьЗначениеСвойства(СвойстваЭлемента.Type);
		ЭлементФормы.Type = ЗначениеСвойства;
	КонецЕсли;
	Для Каждого КлючЗначение Из СвойстваЭлемента Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		Если ИмяСвойства = "ElementType" Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяСвойства = "Name" Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяСвойства = "ParentName" Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяСвойства = "ChildItems" Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяСвойства = ИмяСвойстваType Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеСвойства = КлючЗначение.Значение;
		
		ЗначениеСвойства = ПолучитьЗначениеСвойства(ОписаниеСвойства);
		
		ЗначениеСвойства = ПолучитьСвойствоЭлементаИлиПоУмолчанию(Контекст, ЭлементФормы, ИмяСвойства, ЗначениеСвойства);
		
		Попытка
			ЭлементФормы[ИмяСвойства] = ЗначениеСвойства;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСвойствоЭлементаИлиПоУмолчанию(Контекст, ЭлементФормы, ИмяСвойства, Значение)
	Если Значение <> Неопределено Тогда
		Возврат Значение;
	КонецЕсли;
	
	// Так как мы не знаем какое значение свойства по-умолчанию,
	// то создаем эталонный элемент и получаем значение свойства из него
	ЭталонныйЭлемент = СоздатьПолучитьЭталонныйЭлементФормы(Контекст, ЭлементФормы);
	Возврат ЭталонныйЭлемент[ИмяСвойства];
КонецФункции

Функция СоздатьПолучитьЭталонныйЭлементФормы(Контекст, ЭлементФормы)
	ЭтоТаблица = ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы");
	Если ЭтоТаблица Тогда
		ИмяЭлемента = "ЭталонТаблицаФормы";
	Иначе
		ИмяЭлемента = "Эталон" + СтрЗаменить(ЭлементФормы.Вид, " ", "");
	КонецЕсли;
	
	ЭталонныйЭлемент = Контекст.Форма.Элементы.Найти(ИмяЭлемента);
	Если ЭталонныйЭлемент = Неопределено Тогда
		ЭталонныйЭлемент = Контекст.Форма.Элементы.Добавить(ИмяЭлемента, ТипЗнч(ЭлементФормы), Контекст.ГруппаЭталоны);
		Если НЕ ЭтоТаблица Тогда
			ЭталонныйЭлемент.Вид = ЭлементФормы.Вид;
		КонецЕсли;
	КонецЕсли;
	Возврат ЭталонныйЭлемент;
КонецФункции

Функция ПолучитьЭлементФормыПоИмени(Форма, ИмяЭлемента)
	Возврат Форма.Элементы[ИмяЭлемента];
КонецФункции

Функция ПолучитьЗначениеСвойства(ЗначениеСвойства)
	Если ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	
	Если НЕ ЗначениеСвойства.Свойство("Value") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Вычислить(ЗначениеСвойства.Value);
	
	Возврат Результат;
КонецФункции
#КонецОбласти

Процедура СкопироватьСписокЗначений(Источник, Приемник)
	Для Каждого ЭлементСписка Из Источник Цикл
		Приемник.Добавить(
			ЭлементСписка.Значение,
			ЭлементСписка.Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли