// MIT License

// Copyright (c) 2026 Zherebtsov Nikita <nikita@crimsongold.ru>

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура Построить(Форма, ГруппаРодитель, ТекстДанные, Кэш) Экспорт   
	ДанныеГенератора = JSONВСтруктуру(ТекстДанные);	
	
	Если Кэш.Свойство(ДанныеГенератора.Prefix) Тогда    
		КэшПоПрефиксу = Кэш[ДанныеГенератора.Prefix];  
	Иначе
		КэшПоПрефиксу = Новый Структура("Реквизиты", Новый Соответствие); 
		Кэш.Вставить(ДанныеГенератора.Prefix, КэшПоПрефиксу);
	КонецЕсли;

	
	ИзменитьРеквизитыФормы(Форма, ДанныеГенератора.Attributes, КэшПоПрефиксу);
	
	ГруппаКонтейнер = ПересоздатьГруппуКонтейнер(ГруппаРодитель, Форма);
	
	ДобавитьЭлементыФормы(Форма, ДанныеГенератора.ChildItems, ГруппаКонтейнер);
КонецПроцедуры

Функция ПолучитьОписаниеТипов(СоотвОписаниеТипов)
	КвалификаторыЧисла = ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов);
	//КвалификаторыДаты = ПолучитьКвалификаторыДаты(СоотвОписаниеТипов);
	//КвалификаторыСтроки = ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов);
	
	Типы = Новый Массив;
	Для Каждого ТекТип Из СоотвОписаниеТипов.Type Цикл
		Типы.Добавить(ТекТип);
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(
		СтрСоединить(Типы, ","),
		КвалификаторыЧисла);
		//КвалификаторыСтроки,
		//КвалификаторыДаты);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


// Преобразует JSON строку в структуру.
// 
// Параметры:
//  СтрокаJSON - Строка - JSON строка для преобразования
// 
// Возвращаемое значение:
// Структура - Преобразованная структура или пустая структура при ошибке
Функция JSONВСтруктуру(СтрокаJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка 
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ru = 'Ошибка парсинга: '") + ОписаниеОшибки();
		//Сообщение.Сообщить(); 
		//Возврат Новый Структура;
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();	
	Возврат Результат;
КонецФункции

Функция ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("number") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДлинаЧисла = ?(НЕ СоотвОписаниеТипов.Свойство("Digits"), 0, СоотвОписаниеТипов.Digits);
	ТочностьЧисла = ?(НЕ СоотвОписаниеТипов.Свойство("FractionDigits"), 0, СоотвОписаниеТипов.FractionDigits); 
	ЗначениеДопустимыйЗнак = ?(НЕ СоотвОписаниеТипов.Свойство("AllowedSign") ИЛИ СоотвОписаниеТипов.AllowedSign = "Any",
		ДопустимыйЗнак.Любой, 
		ДопустимыйЗнак.Неотрицательный);
	
	Возврат Новый КвалификаторыЧисла(ДлинаЧисла, ТочностьЧисла, ЗначениеДопустимыйЗнак);
КонецФункции

Функция ПолучитьКвалификаторыДаты(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("dataTime") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекЧастиДаты = ?(
			СоотвОписаниеТипов.ЧастиДаты = Неопределено,
			ЧастиДаты.ДатаВремя,
			ПолучитьЗначениеСвойства(Новый Структура("Тип,Значение", "ЧастиДаты", СоотвОписаниеТипов.ЧастиДаты)));
	
	Возврат Новый КвалификаторыДаты(ТекЧастиДаты);
КонецФункции

Функция ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Типы.Найти("Строка") = Неопределено
		ИЛИ СоотвОписаниеТипов.ДлинаСтроки <> Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ДлинаСтроки = ?(СоотвОписаниеТипов.ДлинаСтроки = Неопределено, 0, СоотвОписаниеТипов.ДлинаСтроки);
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки);
КонецФункции

Функция ПересоздатьГруппуКонтейнер(ГруппаРодитель, Знач Форма)
	ГруппаКонтейнер = Форма.Элементы.Найти("ГруппаКонтейнер");
	Если ГруппаКонтейнер <> Неопределено Тогда
		Форма.Элементы.Удалить(ГруппаКонтейнер);
	КонецЕсли;
	
	ГруппаКонтейнер = Форма.Элементы.Добавить("ГруппаКонтейнер", Тип("ГруппаФормы"), ГруппаРодитель);
	ГруппаКонтейнер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКонтейнер.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКонтейнер.ОтображатьЗаголовок = Ложь;
	ГруппаКонтейнер.РастягиватьПоГоризонтали = Истина;
	ГруппаКонтейнер.РастягиватьПоВертикали = Истина;
	ГруппаКонтейнер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Возврат ГруппаКонтейнер;
КонецФункции

Процедура ЗаполнитьДанныеФормы(Форма, Данные)
	Для Каждого КлючЗначение Из Данные Цикл
		ИмяРеквизита = КлючЗначение.Ключ;
		ДанныеРеквизита = КлючЗначение.Значение;
		
		Если ДанныеРеквизита.Тип = "Таблица" Тогда
			Таблица = Форма[ИмяРеквизита];
			Таблица.Очистить();
			ДобавитьДеревоСтроки(Таблица, ДанныеРеквизита.Строки, Ложь);
			Продолжить;
		КонецЕсли;
		
		Если ДанныеРеквизита.Тип = "Дерево" Тогда
			ЭлементыДерева = Форма[ИмяРеквизита].ПолучитьЭлементы();
			ЭлементыДерева.Очистить();
			ДобавитьДеревоСтроки(ЭлементыДерева, ДанныеРеквизита.Строки, Истина);
			Продолжить;
		КонецЕсли;
		
		Форма[ИмяРеквизита] = ДанныеРеквизита.Значение;
	КонецЦикла;
КонецПроцедуры

Процедура ИзменитьРеквизитыФормы(Форма, ОписанияРеквизитов, Кэш)
	МассивУдаляемых = Новый Массив;	
	Для Каждого КлючЗначение Из Кэш.Реквизиты Цикл  
		МассивУдаляемых.Добавить(КлючЗначение.Ключ);
	КонецЦикла; 
	
	Кэш.Реквизиты = Новый Соответствие;
	
	МассивРеквизитов = Новый Массив;
	ЗаполнитьМассивРеквизитов(Кэш, ОписанияРеквизитов, МассивРеквизитов, Неопределено);
	
	Форма.ИзменитьРеквизиты(МассивРеквизитов, МассивУдаляемых);
КонецПроцедуры

Процедура ЗаполнитьМассивРеквизитов(Кэш, ОписанияРеквизитов, МассивРеквизитов, СтрокиДерева, ИмяВладельца = Неопределено)
	Для Каждого СтрокаРеквизит Из ОписанияРеквизитов Цикл
		ОписаниеТипа = ПолучитьОписаниеТипов(СтрокаРеквизит.Type);
		
		ДобавляемыйРеквизит = Новый РеквизитФормы(СтрокаРеквизит.Name, ОписаниеТипа, ИмяВладельца);
		МассивРеквизитов.Добавить(ДобавляемыйРеквизит);    
		
		ПолноеИмя = ?(СтрокаРеквизит.Свойство("Path"), СтрокаРеквизит.Path + ".", "") + СтрокаРеквизит.Name; 
		                                                           
		Кэш.Реквизиты.Вставить(ПолноеИмя, Неопределено);
				
		//ЗаполнитьМассивРеквизитов(СтрокаРеквизит.Подчиненные, МассивРеквизитов, СтрокаРеквизит.Имя);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьЭлементыФормы(Форма, Элементы, Группа)
	Для Каждого Элемент Из Элементы Цикл
		ДобавитьЭлементФормы(Форма, Элемент, Группа);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьЭлементФормы(Форма, СхемаЭлемента, Родитель)
	НовыйЭлементФормы = Форма.Элементы.Добавить(СхемаЭлемента.Name, Тип(СхемаЭлемента.ElementType), Родитель);
	ДобавитьНаборСвойствЭлементаФормы(СхемаЭлемента, НовыйЭлементФормы);
	
	//Для Каждого Подчиненный Из СхемаЭлемента.ПодчиненныеЭлементы Цикл
	//	ДобавитьЭлементФормы(Форма, Подчиненный, НовыйЭлементФормы);
	//КонецЦикла;
КонецПроцедуры

Процедура ДобавитьНаборСвойствЭлементаФормы(СхемаЭлемента, НовыйЭлементФормы) 
	Результат = Новый Структура;
	Для Каждого КлючЗначение Из СхемаЭлемента Цикл
		ИмяСвойства = КлючЗначение.Ключ;     
		Если ИмяСвойства = "ElementType" ИЛИ ИмяСвойства = "Name" Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеСвойства = ПолучитьЗначениеСвойства(КлючЗначение.Значение);
		
		Результат.Вставить(ИмяСвойства, ЗначениеСвойства); 
	КонецЦикла;  
	Попытка
		ЗаполнитьЗначенияСвойств(НовыйЭлементФормы, Результат); 
	Исключение     
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ru = 'Ошибка при установке значений: '") + ОписаниеОшибки();
		//Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры

Процедура СкопироватьСписокЗначений(Источник, Приемник)
	Для Каждого ЭлементСписка Из Источник Цикл
		Приемник.Добавить(
			ЭлементСписка.Значение,
			ЭлементСписка.Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьЗначениеСвойства(ЗначениеСвойства)     
	Если ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда
		Возврат ЗначениеСвойства; 
	КонецЕсли; 
	
	Если НЕ ЗначениеСвойства.Свойство("Value") Тогда 
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ru = 'Ошибка при получении значения, нет свойства Value'");
		//Сообщение.Сообщить(); 
		Возврат Неопределено;
	КонецЕсли;
 	
	Попытка
		Результат = Вычислить(ЗначениеСвойства.Value);
	Исключение
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ru = 'Ошибка при получении значения: '") + ЗначениеСвойства.Value;
		//Сообщение.Сообщить(); 
		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьДеревоСтроки(ЭлементыДерева, Строки, ЭтоДерево)
	Для Каждого Строка Из Строки Цикл
		СтрокаДерева = ЭлементыДерева.Добавить();
		
		Для Каждого КлючЗначение Из Строка.Значения Цикл
			СтрокаДерева[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;
		
		Если ЭтоДерево Тогда
			ДобавитьДеревоСтроки(СтрокаДерева.ПолучитьЭлементы(), Строка.Строки, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли