// MIT License

// Copyright (c) 2026 Zherebtsov Nikita <nikita@crimsongold.ru>

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура Построить(Форма, ГруппаРодитель, ПараметрыИзмененияФормы) Экспорт
	ДобавитьУдалитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы);
	ИзменитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы);
	
	ДобавитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, ГруппаРодитель);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДобавлениеИУдалениеРеквизитов

Процедура ДобавитьУдалитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы)
	МассивУдаляемых = Новый Массив;
	Для Каждого УдаляемыйРеквизит Из ПараметрыИзмененияФормы.УдаляемыеРеквизиты Цикл
		МассивУдаляемых.Добавить(?(УдаляемыйРеквизит.Path = "", "", УдаляемыйРеквизит.Path + ".") + УдаляемыйРеквизит.Name);
	КонецЦикла;
	
	МассивДобавляемых = ПолучитьМассивДобавляемыхРеквизитов(ПараметрыИзмененияФормы);
	
	Форма.ИзменитьРеквизиты(МассивУдаляемых, МассивДобавляемых);
КонецПроцедуры

Функция ПолучитьМассивДобавляемыхРеквизитов(ПараметрыИзмененияФормы)
	МассивДобавляемых = Новый Массив;
	Для Каждого ДобавляемыйРеквизит Из ПараметрыИзмененияФормы.ДобавляемыеРеквизиты Цикл
		ОписаниеТипа = ПолучитьОписаниеТипов(ДобавляемыйРеквизит.Type);
		НовыйРеквизит = Новый РеквизитФормы(ДобавляемыйРеквизит.Name, ОписаниеТипа, ДобавляемыйРеквизит.Path);
		МассивДобавляемых.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	Возврат МассивДобавляемых;
КонецФункции

#КонецОбласти

#Область ИзменениеРеквизитов

Процедура ИзменитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы)
	Для Каждого ИзменяемыйРеквизит Из ПараметрыИзмененияФормы.ИзменяемыеРеквизиты Цикл
		Если ИзменяемыйРеквизит.Свойство("Path") Тогда
			Родитель = Форма[ИзменяемыйРеквизит.Path];
		Иначе
			Родитель = Форма;
		КонецЕсли;
		
		Реквизит = Родитель[ИзменяемыйРеквизит.Name];
		
		Если ИзменяемыйРеквизит.Свойство("Type") Тогда
			Реквизит.Тип = ПолучитьОписаниеТипов(ИзменяемыйРеквизит.Type);
		КонецЕсли;
		
		Если ИзменяемыйРеквизит.Свойство("Title") Тогда
			Реквизит.Заголовок = ИзменяемыйРеквизит.Title;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеЭлементов

Процедура ДобавитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, ГруппаКонтейнер)
	Элементы = ПараметрыИзмененияФормы.ДобавляемыеЭлементы;
	Для Каждого ДобавляемыйЭлемент Из Элементы Цикл
		ДобавитьЭлементФормы(Форма, ДобавляемыйЭлемент, ГруппаКонтейнер);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьЭлементФормы(Форма, ДобавляемыйЭлемент, ГруппаКонтейнер)
	Родитель = ?(ДобавляемыйЭлемент.Свойство("ParentName"), Форма[ДобавляемыйЭлемент.ParentName], ГруппаКонтейнер);
	Форма.Элементы.Добавить(ДобавляемыйЭлемент.Name, Тип(ДобавляемыйЭлемент.ElementType), Родитель);
КонецПроцедуры

#КонецОбласти

#Область УдалениеЭлементов

Процедура УдалитьЭлементыФормы(Форма, ПараметрыИзмененияФормы)
	Элементы = ПараметрыИзмененияФормы.УдаляемыеЭлементы;
	Для Каждого УдаляемыйЭлемент Из Элементы Цикл
		Форма.Элементы.Удалить(УдаляемыйЭлемент.Name);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПеремещениеЭлементов

Процедура ПеремещениеЭлементовФормы(Форма, ПараметрыИзмененияФормы)
	Элементы = ПараметрыИзмененияФормы.ПеремещаемыеЭлементы;
	Для Каждого ПеремещаемыйЭлемент Из Элементы Цикл
		Форма.Элементы.Переместить(ПеремещаемыйЭлемент.Name, ПеремещаемыйЭлемент.ParentName, ПеремещаемыйЭлемент.Before);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

Процедура ДобавитьНаборСвойствЭлементаФормы(СхемаЭлемента, НовыйЭлементФормы)
	Результат = Новый Структура;
	Для Каждого КлючЗначение Из СхемаЭлемента Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		Если ИмяСвойства = "ElementType" ИЛИ ИмяСвойства = "Name" Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеСвойства = ПолучитьЗначениеСвойства(КлючЗначение.Значение);
		
		Результат.Вставить(ИмяСвойства, ЗначениеСвойства);
	КонецЦикла;
	Попытка
		ЗаполнитьЗначенияСвойств(НовыйЭлементФормы, Результат);
	Исключение
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ru = 'Ошибка при установке значений: '") + ОписаниеОшибки();
		//Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры

Процедура СкопироватьСписокЗначений(Источник, Приемник)
	Для Каждого ЭлементСписка Из Источник Цикл
		Приемник.Добавить(
			ЭлементСписка.Значение,
			ЭлементСписка.Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьЗначениеСвойства(ЗначениеСвойства)
	Если ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда
		Возврат ЗначениеСвойства;
	КонецЕсли;
	
	Если НЕ ЗначениеСвойства.Свойство("Value") Тогда
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ru = 'Ошибка при получении значения, нет свойства Value'");
		//Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Результат = Вычислить(ЗначениеСвойства.Value);
	Исключение
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = НСтр("ru = 'Ошибка при получении значения: '") + ЗначениеСвойства.Value;
		//Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьДеревоСтроки(ЭлементыДерева, Строки, ЭтоДерево)
	Для Каждого Строка Из Строки Цикл
		СтрокаДерева = ЭлементыДерева.Добавить();
		
		Для Каждого КлючЗначение Из Строка.Значения Цикл
			СтрокаДерева[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;
		
		Если ЭтоДерево Тогда
			ДобавитьДеревоСтроки(СтрокаДерева.ПолучитьЭлементы(), Строка.Строки, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли