// MIT License

// Copyright (c) 2026 Zherebtsov Nikita <nikita@crimsongold.ru>

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура Построить(Форма, ГруппаРодитель, ПараметрыИзмененияФормы) Экспорт
	ДобавитьУдалитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы);
	ИзменитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы);
	
	УдалитьЭлементыФормы(Форма, ПараметрыИзмененияФормы);
	ДобавитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, ГруппаРодитель);
	ПереместитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, ГруппаРодитель);
	
	ИзменитьСвойстваЭлементов(Форма, ПараметрыИзмененияФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОписаниеТипов

Функция ПолучитьОписаниеТипов(СоотвОписаниеТипов)
	КвалификаторыЧисла = ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов);
	КвалификаторыДаты = ПолучитьКвалификаторыДаты(СоотвОписаниеТипов);
	КвалификаторыСтроки = ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов);
	
	Типы = Новый Массив;
	Для Каждого ТекТип Из СоотвОписаниеТипов.Type Цикл
		Типы.Добавить(ТекТип);
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(
		СтрСоединить(Типы, ","),
		КвалификаторыЧисла,
		КвалификаторыСтроки,
		КвалификаторыДаты);
КонецФункции

Функция ПолучитьКвалификаторыЧисла(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("number") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЧислоРазрядов = 0;
	Если СоотвОписаниеТипов.Digits <> Неопределено Тогда
		ЧислоРазрядов = СоотвОписаниеТипов.Digits;
	КонецЕсли;
	
	ЧислоРазрядовДробнойЧасти = 0;
	Если СоотвОписаниеТипов.Свойство("FractionDigits") <> Неопределено Тогда
		ЧислоРазрядовДробнойЧасти = СоотвОписаниеТипов.FractionDigits;
	КонецЕсли;
	
	ДопустимыйЗнак = ДопустимыйЗнак.Любой;
	Если СоотвОписаниеТипов.Свойство("AllowedSign") <> Неопределено Тогда
		ДопустимыйЗнак = ?(СоотвОписаниеТипов.AllowedSign = "Any", ДопустимыйЗнак.Любой, ДопустимыйЗнак.Неотрицательный);
	КонецЕсли;
	
	Возврат Новый КвалификаторыЧисла(ЧислоРазрядов, ЧислоРазрядовДробнойЧасти, ДопустимыйЗнак);
КонецФункции

Функция ПолучитьКвалификаторыДаты(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("dataTime") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекЧастиДаты = ЧастиДаты.ДатаВремя;
	Если СоотвОписаниеТипов.Свойство("DateFractions") Тогда
		Если СоотвОписаниеТипов.DateFractions = "Date" Тогда
			ТекЧастиДаты = ЧастиДаты.Дата;
		ИначеЕсли СоотвОписаниеТипов.DateFractions = "Time" Тогда
			ТекЧастиДаты = ЧастиДаты.Время;
		Иначе
			ТекЧастиДаты = ЧастиДаты.ДатаВремя;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый КвалификаторыДаты(ТекЧастиДаты);
КонецФункции

Функция ПолучитьКвалификаторыСтроки(СоотвОписаниеТипов)
	Если СоотвОписаниеТипов.Type.Найти("string") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДлинаСтроки = 0;
	Если СоотвОписаниеТипов.Свойство("Length") Тогда
		ДлинаСтроки = СоотвОписаниеТипов.Length;
	КонецЕсли;
	
	ДопустимаяДлинаСтроки = ДопустимаяДлина.Переменная;
	Если СоотвОписаниеТипов.Свойство("AllowedLength") Тогда
		ДопустимаяДлинаСтроки = ДопустимаяДлинаСтроки.AllowedLength;
	КонецЕсли;
	
	Возврат Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлинаСтроки);
КонецФункции

#КонецОбласти

Функция ПолучитьПутьРеквизита(Реквизит)
	Возврат ?(НЕ Реквизит.Path = "", "", Реквизит.Path + ".") + Реквизит.Name;
КонецФункции

#Область ДобавлениеИУдалениеРеквизитов

Процедура ДобавитьУдалитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы)
	МассивУдаляемых = Новый Массив;
	Для Каждого УдаляемыйРеквизит Из ПараметрыИзмененияФормы.УдаляемыеРеквизиты Цикл
		МассивУдаляемых.Добавить(?(УдаляемыйРеквизит.Path = "", "", УдаляемыйРеквизит.Path + ".") + УдаляемыйРеквизит.Name);
	КонецЦикла;
	
	МассивДобавляемых = ПолучитьМассивДобавляемыхРеквизитов(ПараметрыИзмененияФормы);
	
	Форма.ИзменитьРеквизиты(МассивДобавляемых, МассивУдаляемых);
КонецПроцедуры

Функция ПолучитьМассивДобавляемыхРеквизитов(ПараметрыИзмененияФормы)
	МассивДобавляемых = Новый Массив;
	Для Каждого ДобавляемыйРеквизит Из ПараметрыИзмененияФормы.ДобавляемыеРеквизиты Цикл
		Путь = "";
		Если ДобавляемыйРеквизит.Свойство("Path") Тогда
			Путь = ДобавляемыйРеквизит.Path;
		КонецЕсли;
		
		Заголовок = Неопределено;
		Если ДобавляемыйРеквизит.Свойство("Title") Тогда
			Заголовок = ДобавляемыйРеквизит.Title;
		КонецЕсли;
		
		ОписаниеТипа = ПолучитьОписаниеТипов(ДобавляемыйРеквизит.Type);
		
		НовыйРеквизит = Новый РеквизитФормы(ДобавляемыйРеквизит.Name, ОписаниеТипа, Путь, Заголовок);
		МассивДобавляемых.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	Возврат МассивДобавляемых;
КонецФункции

#КонецОбласти

#Область ИзменениеРеквизитов

Процедура ИзменитьРеквизитыФормы(Форма, ПараметрыИзмененияФормы)
	Для Каждого ИзменяемыйРеквизит Из ПараметрыИзмененияФормы.ИзменяемыеРеквизиты Цикл
		ПутьРеквизита = ПолучитьПутьРеквизита(ИзменяемыйРеквизит);
		Реквизит = Форма.ПолучитьРеквизит(ПутьРеквизита);
		
		Если ИзменяемыйРеквизит.Свойство("Type") Тогда
			Реквизит.Тип = ПолучитьОписаниеТипов(ИзменяемыйРеквизит.Type);
		КонецЕсли;
		
		Если ИзменяемыйРеквизит.Свойство("Title") Тогда
			Реквизит.Заголовок = ИзменяемыйРеквизит.Title;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеЭлементов

Процедура ДобавитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, ГруппаКонтейнер)
	Элементы = ПараметрыИзмененияФормы.ДобавляемыеЭлементы;
	Для Каждого ДобавляемыйЭлемент Из Элементы Цикл
		ДобавитьЭлементФормы(Форма, ДобавляемыйЭлемент, ГруппаКонтейнер);
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьЭлементФормы(Форма, ДобавляемыйЭлемент, ГруппаКонтейнер)
	
	Родитель = ?(ДобавляемыйЭлемент.Свойство("ParentName"),
			Форма.Элементы[ДобавляемыйЭлемент.ParentName],
			ГруппаКонтейнер);
	
	ТипЭлемента = Тип(ДобавляемыйЭлемент.ElementType);
	
	НовыйЭлемент = Форма.Элементы.Добавить(ДобавляемыйЭлемент.Name, ТипЭлемента, Родитель);
	ОбновитьСвойстваЭлемента(НовыйЭлемент, ДобавляемыйЭлемент);
КонецПроцедуры

#КонецОбласти

#Область УдалениеЭлементов

Процедура УдалитьЭлементыФормы(Форма, ПараметрыИзмененияФормы)
	Элементы = ПараметрыИзмененияФормы.УдаляемыеЭлементы;
	Для Каждого ОписаниеЭлемента Из Элементы Цикл
		Элемент = Форма[ОписаниеЭлемента.Name];
		Форма.Элементы.Удалить(Элемент);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПеремещениеЭлементов

Процедура ПереместитьЭлементыФормы(Форма, ПараметрыИзмененияФормы, ГруппаКонтейнер)
	Элементы = ПараметрыИзмененияФормы.ПеремещаемыеЭлементы;
	Для Каждого ОписаниеПеремещения Из Элементы Цикл
		Элемент = Форма[ОписаниеПеремещения.Name];
		Родитель = ?(ОписаниеПеремещения.Свойство("ParentName"), Форма[ОписаниеПеремещения.ParentName], ГруппаКонтейнер);
		Перед = ?(ОписаниеПеремещения.Свойство("Before"), Форма[ОписаниеПеремещения.Before], Неопределено);
		
		Форма.Элементы.Переместить(Элемент, Родитель, Перед);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ИзменениеЭлементов

Процедура ИзменитьСвойстваЭлементов(Форма, ПараметрыИзмененияФормы)
	ИзменяемыеЭлементы = ПараметрыИзмененияФормы.ИзменяемыеЭлементы;
	Для Каждого СвойстваЭлемента Из ИзменяемыеЭлементы Цикл
		ЭлементФормы = ПолучитьЭлементФормыПоИмени(Форма, СвойстваЭлемента.Name);
		ОбновитьСвойстваЭлемента(ЭлементФормы, СвойстваЭлемента);
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьСвойстваЭлемента(ЭлементФормы, СвойстваЭлемента)
	Для Каждого КлючЗначение Из СвойстваЭлемента Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		ОписаниеСвойства = КлючЗначение.Значение;
		
		ЗначениеСвойства = ПолучитьЗначениеСвойства(ОписаниеСвойства);
		
		ЭлементФормы[ИмяСвойства] = ЗначениеСвойства;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьЭлементФормыПоИмени(Форма, ИмяЭлемента)
	Возврат Форма.Элементы[ИмяЭлемента];
КонецФункции
Функция ПолучитьЗначениеСвойства(ЗначениеСвойства)	Если ТипЗнч(ЗначениеСвойства) <> Тип("Структура") Тогда		Возврат ЗначениеСвойства;	КонецЕсли;		Если НЕ ЗначениеСвойства.Свойство("Value") Тогда		//Сообщение = Новый СообщениеПользователю;		//Сообщение.Текст = НСтр("ru = 'Ошибка при получении значения, нет свойства Value'");		//Сообщение.Сообщить(); 		Возврат Неопределено;	КонецЕсли;	Попытка		Результат = Вычислить(ЗначениеСвойства.Value);	Исключение		//Сообщение = Новый СообщениеПользователю;		//Сообщение.Текст = НСтр("ru = 'Ошибка при получении значения: '") + ЗначениеСвойства.Value;		//Сообщение.Сообщить();		Возврат Неопределено;	КонецПопытки;	Возврат Результат;КонецФункции
#КонецОбласти

Процедура СкопироватьСписокЗначений(Источник, Приемник)
	Для Каждого ЭлементСписка Из Источник Цикл
		Приемник.Добавить(
			ЭлементСписка.Значение,
			ЭлементСписка.Представление,
			ЭлементСписка.Пометка,
			ЭлементСписка.Картинка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли