#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	__Кэш = Новый Структура("Реквизиты, Элементы", Новый Соответствие, Новый Массив);
	HTMLДокумент = "http://127.0.0.1:3456";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Событие = ДанныеСобытия.Event.eventData1C;
	
	Если Событие = Неопределено ИЛИ ТипЗнч(Событие) = Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	JSON = Событие.data;
	JSON = Сред(JSON, 2, СтрДлина(JSON) - 2);
	JSON = СтрЗаменить(JSON, "\", "");
	ОбновитьФормуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФормуНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Построить(ЭтотОбъект, Элементы.ГруппаПросмотр, JSON, __Кэш);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(JSON)
	СтруктураФормы = JSONВСтруктуру(JSON);
	Если СтруктураФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбновитьФормуНаСервере();
КонецПроцедуры

// Преобразует JSON строку в структуру.
//
// Параметры:
//  СтрокаJSON - Строка - JSON строка для преобразования
//
// Возвращаемое значение:
// Структура - Преобразованная структура или пустая структура при ошибке
&НаКлиенте
Функция JSONВСтруктуру(СтрокаJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗарегистрироватьОшибку(НСтр("ru = 'Ошибка парсинга: '"), ОписаниеОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТребуетсяПередачаНаСервер(СтруктураИзмененияФормы)
	Возврат СтруктураИзмененияФормы.УдаляемыеРеквизиты.Количество() > 0
	ИЛИ СтруктураИзмененияФормы.ДобавляемыеРеквизиты.Количество() > 0;
КонецФункции

&НаКлиенте
Функция ПолучитьИзмененияФормыДляОбновления(СтруктураФормы)
	Кэш = СоздатьПолучитьКэш(СтруктураФормы.Prefix);
	РеквизитыКэша = Кэш.Реквизиты;
	
	Результат = Новый Структура();
	Результат.Вставить("УдаляемыеРеквизиты", Новый Массив);
	Результат.Вставить("ДобавляемыеРеквизиты", Новый Соответствие);
	Результат.Вставить("УдаляемыеЭлементы", Новый Массив);
	Результат.Вставить("ДобавляемыеЭлементы", Новый Массив);
	Результат.Вставить("ПеремещаемыеЭлементы", Новый Массив);
	Результат.Вставить("СоответствиеЭлементов", Новый Соответствие);
	
	НеиспользуемыеРеквизиты = Новый Структура();
	Для Каждого КлючЗначение Из РеквизитыКэша Цикл
		НеиспользуемыеРеквизиты.Вставить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Для Каждого Реквизит Из СтруктураФормы.Attributes Цикл
		ИмяРеквизита = Реквизит.Name;
		
		Если НеиспользуемыеРеквизиты.Свойство(ИмяРеквизита) Тогда
			НеиспользуемыеРеквизиты.Удалить(ИмяРеквизита);
		КонецЕсли;
		
		РеквизитКэша = РеквизитыКэша.Получить(ИмяРеквизита);
		
		Если НЕ РеквизитИзменился(Реквизит, РеквизитКэша) Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитКэша <> Неопределено Тогда
			Результат.УдаляемыеРеквизиты.Добавить(ИмяРеквизита);
		КонецЕсли;
		
		Результат.ДобавляемыеРеквизиты.Добавить(ИмяРеквизита);
	КонецЦикла;
	
	Для Каждого НеиспользуемыйРеквизит Из НеиспользуемыеРеквизиты Цикл
		Результат.УдаляемыеРеквизиты.Добавить(НеиспользуемыйРеквизит);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьИзмененияЭлементов(ЭлементыКэша, ЭлементыФормы)
	Результат = Новый Структура();
	Результат.Вставить("ДобавляемыеЭлементы", Новый Массив);
	Результат.Вставить("УдаляемыеЭлементы", Новый Массив);
	Результат.Вставить("ПеремещаемыеЭлементы", Новый Массив);
	Результат.Вставить("СоответствиеЭлементов", ПолучитьСоответствиеЭлементов(ЭлементыФормы));
	Результат.Вставить("ИзмененныеСвойства", Новый Соответствие);
	
	СоответствиеЭлементовКэша = ПолучитьСоответствиеЭлементов(ЭлементыКэша);
	
	Результат.ДобавляемыеЭлементы = ПолучитьНовыеЭлементы(СоответствиеЭлементовКэша, СоответствиеЭлементовФормы);
	Результат.УдаляемыеЭлементы = ПолучитьНовыеЭлементы(СоответствиеЭлементовФормы, СоответствиеЭлементовКэша);
	
	СравнитьДеревьяЭлементов(ЭлементыКэша, ЭлементыФормы, "", Результат);
	КартаПозиций = ПостроитьКартуПозицийФормы(ЭлементыФормы);
	ОтсортироватьПеремещения(Результат.ПеремещаемыеЭлементы, КартаПозиций, ЭлементыФормы);
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьСоответствиеЭлементов(Элементы)
	Результат = Новый Соответствие();
	ДобавитьЭлементыВСоответствие(Элементы, Результат);
	Возврат Результат;
КонецФункции

Функция ПолучитьНовыеЭлементы(СоответствиеЭлементовДо, СоответствиеЭлементовПосле)
	Результат = Новый Массив();
	Для Каждого КлючЗначение Из СоответствиеЭлементовПосле Цикл
		Если НЕ СоответствиеЭлементовДо.Свойство(КлючЗначение.Ключ) Тогда
			Результат.Добавить(КлючЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДобавитьЭлементыВСоответствие(Элементы, Результат)
	Для Каждого Элемент Из Элементы Цикл
		Результат.Вставить(Элемент.Name, Элемент);
		Если НЕ Элемент.Свойство("ChildItems") Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьЭлементыВСоответствие(Элемент["ChildItems"], Результат);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СравнитьДеревьяЭлементов(УдаленныеЭлементы, ЭлементыКэша, ЭлементыФормы, ЭлементРодитель, Результат)
	КоличествоЭлементов = Максимум(ЭлементыКэша.Количество(), ЭлементыФормы.Количество());
	
	ИндексКэша = 0;
	ЭлементФормыПеред = Неопределено;
	ЭлементКэша = Неопределено;
	
	Для Каждого ЭлементФормы Из ЭлементыФормы Цикл
		УстановитьСледующийЭлементКэша(ЭлементыКэша, ИндексКэша, УдаленныеЭлементы, ЭлементКэша);
		
		Если ЭлементКэша = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПеремещения = Новый Структура("Элемент,Родитель,Перед",
				ЭлементФормы, ЭлементФормыПеред, ЭлементФормыПеред);
		Результат.Добавить("ПеремещаемыеЭлементы", СтруктураПеремещения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСледующийЭлементКэша(ЭлементыКэша, Индекс, УдаленныеЭлементыь, Результат)
	Результат = Неопределено;
	Пока Индекс < ЭлементыКэша.Количество() Цикл
		Результат = ЭлементыКэша[Индекс];
		Если УдаленныеЭлементы.Найти(Результат.Name) = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Результат = Неопределено;
КонецПроцедуры

&НаКлиенте
Функция РеквизитИзменился(Реквизит, РеквизитКэша)
	Возврат СравнитьСтруктуры(Реквизит, РеквизитКэша);
КонецФункции

Функция СравнитьСтруктуры(Знач1, Знач2)
	Если Знач1 = Знач2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Знач1) <> ТипЗнч(Знач2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Знач1) = Тип("Структура") Тогда
		Если Знач1.Количество() <> Знач2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Каждого КлючЗначение Из Знач1 Цикл
			Знач2Под = Знач2.Получить(КлючЗначение.Ключ);
			Если НЕ СравнитьСтруктуры(КлючЗначение.Значение, Знач2Под) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Знач1) = Тип("Массив") Тогда
		Если Знач1.Количество() <> Знач2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Индекс = 0 По Знач1.ВГраница() Цикл
			Если НЕ СравнитьСтруктуры(Знач1[Индекс], Знач2[Индекс]) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	Возврат (Знач1 = Знач2);
КонецФункции

&НаКлиенте
Функция СоздатьПолучитьКэш(Идентификатор)
	Кэш = Новый Структура();
	Если Кэш.Свойство(Идентификатор) Тогда
		КэшПоПрефиксу = Кэш[Идентификатор];
	Иначе
		КэшПоПрефиксу = Новый Структура("Реквизиты", Новый Соответствие);
		Кэш.Вставить(ДанныеГенератора.Prefix, КэшПоПрефиксу);
	КонецЕсли;
	
	Возврат КэшПоПрефиксу;
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьОшибку(ТекстОшибки, ОписаниеОшибки)
КонецПроцедуры

#КонецОбласти


// 1
// 2
// 3
// 4


// 1
// 3
// 4