#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	__Кэш = Новый Структура();
	HTMLДокумент = "http://127.0.0.1:3456";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Событие = ДанныеСобытия.Event.eventData1C;
	
	Если Событие = Неопределено ИЛИ ТипЗнч(Событие) = Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	JSON = Событие.data;
	JSON = Сред(JSON, 2, СтрДлина(JSON) - 2);
	JSON = СтрЗаменить(JSON, "\", "");
	ОбновитьФормуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФормуНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Построить(ЭтотОбъект, Элементы.ГруппаПросмотр, JSON, __Кэш);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(JSON)
	СтруктураФормы = JSONВСтруктуру(JSON);
	Если СтруктураФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбновитьФормуНаСервере();
КонецПроцедуры

// Преобразует JSON строку в структуру.
//
// Параметры:
//  СтрокаJSON - Строка - JSON строка для преобразования
//
// Возвращаемое значение:
// Структура - Преобразованная структура или пустая структура при ошибке
&НаКлиенте
Функция JSONВСтруктуру(СтрокаJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗарегистрироватьОшибку(НСтр("ru = 'Ошибка парсинга: '"), ОписаниеОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТребуетсяПередачаНаСервер(СтруктураИзмененияФормы)
	Возврат СтруктураИзмененияФормы.УдаляемыеРеквизиты.Количество() > 0
	ИЛИ СтруктураИзмененияФормы.ДобавляемыеРеквизиты.Количество() > 0;
КонецФункции

&НаКлиенте
Функция ПолучитьИзмененияФормыДляОбновления(СтруктураФормы)
	Кэш = СоздатьПолучитьКэш(СтруктураФормы.Prefix);
	РеквизитыКэша = Кэш.Реквизиты;
	
	Результат = Новый Структура();
	Результат.Вставить("УдаляемыеРеквизиты", Новый Массив);
	Результат.Вставить("ДобавляемыеРеквизиты", Новый Соответствие);
	Результат.Вставить("УдаляемыеЭлементы", Новый Массив);
	Результат.Вставить("ДобавляемыеЭлементы", Новый Массив);
	Результат.Вставить("ПеремещаемыеЭлементы", Новый Массив);
	
	
	Для Каждого Реквизит Из СтруктураФормы.Attributes Цикл
		ИмяРеквизита = Реквизит.Name;
		
		РеквизитКэша = РеквизитыКэша.Получить(ИмяРеквизита);
		
		Если НЕ РеквизитИзменился(Реквизит, РеквизитКэша) Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитКэша <> Неопределено Тогда
			Результат.УдаляемыеРеквизиты.Добавить(ИмяРеквизита);
		КонецЕсли;
		
		Результат.ДобавляемыеРеквизиты.Добавить(ИмяРеквизита);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция РеквизитИзменился(Реквизит, РеквизитКэша)
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция СоздатьПолучитьКэш(Идентификатор)
	Кэш = Новый Структура();
	Если Кэш.Свойство(Идентификатор) Тогда
		КэшПоПрефиксу = Кэш[Идентификатор];
	Иначе
		КэшПоПрефиксу = Новый Структура("Реквизиты", Новый Соответствие);
		Кэш.Вставить(ДанныеГенератора.Prefix, КэшПоПрефиксу);
	КонецЕсли;
	
	Возврат КэшПоПрефиксу;
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьОшибку(ТекстОшибки, ОписаниеОшибки)
КонецПроцедуры

#КонецОбласти