#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	__Кэш = Новый Структура("Реквизиты, Элементы", Новый Соответствие, Новый Массив);
	HTMLДокумент = "http://127.0.0.1:3456";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Событие = ДанныеСобытия.Event.eventData1C;
	
	Если Событие = Неопределено ИЛИ ТипЗнч(Событие) = Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	JSON = Событие.data;
	JSON = Сред(JSON, 2, СтрДлина(JSON) - 2);
	JSON = СтрЗаменить(JSON, "\", "");
	ОбновитьФормуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФормуНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Построить(ЭтотОбъект, Элементы.ГруппаПросмотр, JSON, __Кэш);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(JSON)
	СтруктураФормы = JSONВСтруктуру(JSON);
	Если СтруктураФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбновитьФормуНаСервере();
КонецПроцедуры

// Преобразует JSON строку в структуру.
//
// Параметры:
//  СтрокаJSON - Строка - JSON строка для преобразования
//
// Возвращаемое значение:
// Структура - Преобразованная структура или пустая структура при ошибке
&НаКлиенте
Функция JSONВСтруктуру(СтрокаJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		ЗарегистрироватьОшибку(НСтр("ru = 'Ошибка парсинга: '"), ОписаниеОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТребуетсяПередачаНаСервер(СтруктураИзмененияФормы)
	Возврат СтруктураИзмененияФормы.УдаляемыеРеквизиты.Количество() > 0
	ИЛИ СтруктураИзмененияФормы.ДобавляемыеРеквизиты.Количество() > 0;
КонецФункции

&НаКлиенте
Функция ПолучитьИзмененияФормыДляОбновления(СтруктураФормы)
	Кэш = СоздатьПолучитьКэш(СтруктураФормы.Prefix);
	РеквизитыКэша = Кэш.Реквизиты;
	
	Результат = Новый Структура();
	Результат.Вставить("УдаляемыеРеквизиты", Новый Массив);
	Результат.Вставить("ДобавляемыеРеквизиты", Новый Соответствие);
	Результат.Вставить("УдаляемыеЭлементы", Новый Массив);
	Результат.Вставить("ДобавляемыеЭлементы", Новый Массив);
	Результат.Вставить("ПеремещаемыеЭлементы", Новый Массив);
	
	НеиспользуемыеРеквизиты = Новый Структура();
	Для Каждого КлючЗначение Из РеквизитыКэша Цикл
		НеиспользуемыеРеквизиты.Вставить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Для Каждого Реквизит Из СтруктураФормы.Attributes Цикл
		ИмяРеквизита = Реквизит.Name;
		
		Если НеиспользуемыеРеквизиты.Свойство(ИмяРеквизита) Тогда
			НеиспользуемыеРеквизиты.Удалить(ИмяРеквизита);
		КонецЕсли;
		
		РеквизитКэша = РеквизитыКэша.Получить(ИмяРеквизита);
		
		Если НЕ РеквизитИзменился(Реквизит, РеквизитКэша) Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитКэша <> Неопределено Тогда
			Результат.УдаляемыеРеквизиты.Добавить(ИмяРеквизита);
		КонецЕсли;
		
		Результат.ДобавляемыеРеквизиты.Добавить(ИмяРеквизита);
	КонецЦикла;
	
	Для Каждого НеиспользуемыйРеквизит Из НеиспользуемыеРеквизиты Цикл
		Результат.УдаляемыеРеквизиты.Добавить(НеиспользуемыйРеквизит);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьИзмененияЭлементов(ЭлементыКэша, ЭлементыФормы)
	Результат = Новый Структура();
	Результат.Вставить("УдаляемыеЭлементы", Новый Массив);
	Результат.Вставить("ДобавляемыеЭлементы", Новый Соответствие);
	Результат.Вставить("ПеремещаемыеЭлементы", Новый Массив);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьСоответствиеЭлементов(Элементы)
	Результат = Новый Соответствие();
	Для Каждого Элемент Из Элементы Цикл
		Результат.Вставить(Элемент.Name, Элемент);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция РеквизитИзменился(Реквизит, РеквизитКэша)
	Возврат СравнитьСтруктуры(Реквизит, РеквизитКэша);
КонецФункции

Функция СравнитьСтруктуры(Знач1, Знач2)
	Если Знач1 = Знач2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Знач1) <> ТипЗнч(Знач2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Знач1) = Тип("Структура") Тогда
		Если Знач1.Количество() <> Знач2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Каждого КлючЗначение Из Знач1 Цикл
			Знач2Под = Знач2.Получить(КлючЗначение.Ключ);
			Если НЕ СравнитьСтруктуры(КлючЗначение.Значение, Знач2Под) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Знач1) = Тип("Массив") Тогда
		Если Знач1.Количество() <> Знач2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Индекс = 0 По Знач1.ВГраница() Цикл
			Если НЕ СравнитьСтруктуры(Знач1[Индекс], Знач2[Индекс]) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	Возврат (Знач1 = Знач2);
КонецФункции

&НаКлиенте
Функция СоздатьПолучитьКэш(Идентификатор)
	Кэш = Новый Структура();
	Если Кэш.Свойство(Идентификатор) Тогда
		КэшПоПрефиксу = Кэш[Идентификатор];
	Иначе
		КэшПоПрефиксу = Новый Структура("Реквизиты", Новый Соответствие);
		Кэш.Вставить(ДанныеГенератора.Prefix, КэшПоПрефиксу);
	КонецЕсли;
	
	Возврат КэшПоПрефиксу;
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьОшибку(ТекстОшибки, ОписаниеОшибки)
КонецПроцедуры

#КонецОбласти